#pragma once

// Name: DeadB, Version: 5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.AnimGraph
struct UAB_Menu_Slasher26_C_AnimGraph_Params
{
	struct FPoseLink                                   AnimGraph;                                                 // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnNotifyEnd_0B64AF184ABD119B2E2270BFA977CABB
struct UAB_Menu_Slasher26_C_OnNotifyEnd_0B64AF184ABD119B2E2270BFA977CABB_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnNotifyBegin_0B64AF184ABD119B2E2270BFA977CABB
struct UAB_Menu_Slasher26_C_OnNotifyBegin_0B64AF184ABD119B2E2270BFA977CABB_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnInterrupted_0B64AF184ABD119B2E2270BFA977CABB
struct UAB_Menu_Slasher26_C_OnInterrupted_0B64AF184ABD119B2E2270BFA977CABB_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnBlendOut_0B64AF184ABD119B2E2270BFA977CABB
struct UAB_Menu_Slasher26_C_OnBlendOut_0B64AF184ABD119B2E2270BFA977CABB_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.OnCompleted_0B64AF184ABD119B2E2270BFA977CABB
struct UAB_Menu_Slasher26_C_OnCompleted_0B64AF184ABD119B2E2270BFA977CABB_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_59A388FC4E690DF0F2E3D890704EDD1A
struct UAB_Menu_Slasher26_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_59A388FC4E690DF0F2E3D890704EDD1A_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_05E0BAAB4A85C91D9E56BA88B668A259
struct UAB_Menu_Slasher26_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_05E0BAAB4A85C91D9E56BA88B668A259_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_6E64C09E483F3071218CA5B4D896DFA4
struct UAB_Menu_Slasher26_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_6E64C09E483F3071218CA5B4D896DFA4_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_B7FBDE744D7EABF276D9EBA9F4661A25
struct UAB_Menu_Slasher26_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher26_AnimGraphNode_TransitionResult_B7FBDE744D7EABF276D9EBA9F4661A25_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.BlueprintUpdateAnimation
struct UAB_Menu_Slasher26_C_BlueprintUpdateAnimation_Params
{
	float                                              DeltaTimeX;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.BlueprintInitializeAnimation
struct UAB_Menu_Slasher26_C_BlueprintInitializeAnimation_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.AnimNotify_Interupt02Start
struct UAB_Menu_Slasher26_C_AnimNotify_Interupt02Start_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.AnimNotify_Idle
struct UAB_Menu_Slasher26_C_AnimNotify_Idle_Params
{
};

// Function AB_Menu_Slasher26.AB_Menu_Slasher26_C.ExecuteUbergraph_AB_Menu_Slasher26
struct UAB_Menu_Slasher26_C_ExecuteUbergraph_AB_Menu_Slasher26_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
