#pragma once

// Name: DeadB, Version: 5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimGraph
struct UAB_Menu_Slasher25_C_AnimGraph_Params
{
	struct FPoseLink                                   AnimGraph;                                                 // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_D845EE60491051D138D7E69B859DEC98
struct UAB_Menu_Slasher25_C_OnNotifyEnd_D845EE60491051D138D7E69B859DEC98_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_D845EE60491051D138D7E69B859DEC98
struct UAB_Menu_Slasher25_C_OnNotifyBegin_D845EE60491051D138D7E69B859DEC98_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_D845EE60491051D138D7E69B859DEC98
struct UAB_Menu_Slasher25_C_OnInterrupted_D845EE60491051D138D7E69B859DEC98_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_D845EE60491051D138D7E69B859DEC98
struct UAB_Menu_Slasher25_C_OnBlendOut_D845EE60491051D138D7E69B859DEC98_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_D845EE60491051D138D7E69B859DEC98
struct UAB_Menu_Slasher25_C_OnCompleted_D845EE60491051D138D7E69B859DEC98_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_22E050B7467A5A507B9A4EB97AFB3C7A
struct UAB_Menu_Slasher25_C_OnNotifyEnd_22E050B7467A5A507B9A4EB97AFB3C7A_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_22E050B7467A5A507B9A4EB97AFB3C7A
struct UAB_Menu_Slasher25_C_OnNotifyBegin_22E050B7467A5A507B9A4EB97AFB3C7A_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_22E050B7467A5A507B9A4EB97AFB3C7A
struct UAB_Menu_Slasher25_C_OnInterrupted_22E050B7467A5A507B9A4EB97AFB3C7A_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_22E050B7467A5A507B9A4EB97AFB3C7A
struct UAB_Menu_Slasher25_C_OnBlendOut_22E050B7467A5A507B9A4EB97AFB3C7A_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_22E050B7467A5A507B9A4EB97AFB3C7A
struct UAB_Menu_Slasher25_C_OnCompleted_22E050B7467A5A507B9A4EB97AFB3C7A_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_1C411FA44F6B6E7B537275A481080575
struct UAB_Menu_Slasher25_C_OnNotifyEnd_1C411FA44F6B6E7B537275A481080575_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_1C411FA44F6B6E7B537275A481080575
struct UAB_Menu_Slasher25_C_OnNotifyBegin_1C411FA44F6B6E7B537275A481080575_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_1C411FA44F6B6E7B537275A481080575
struct UAB_Menu_Slasher25_C_OnInterrupted_1C411FA44F6B6E7B537275A481080575_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_1C411FA44F6B6E7B537275A481080575
struct UAB_Menu_Slasher25_C_OnBlendOut_1C411FA44F6B6E7B537275A481080575_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_1C411FA44F6B6E7B537275A481080575
struct UAB_Menu_Slasher25_C_OnCompleted_1C411FA44F6B6E7B537275A481080575_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyEnd_0E98A85F4EB644014D42909522C7C474
struct UAB_Menu_Slasher25_C_OnNotifyEnd_0E98A85F4EB644014D42909522C7C474_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnNotifyBegin_0E98A85F4EB644014D42909522C7C474
struct UAB_Menu_Slasher25_C_OnNotifyBegin_0E98A85F4EB644014D42909522C7C474_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnInterrupted_0E98A85F4EB644014D42909522C7C474
struct UAB_Menu_Slasher25_C_OnInterrupted_0E98A85F4EB644014D42909522C7C474_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnBlendOut_0E98A85F4EB644014D42909522C7C474
struct UAB_Menu_Slasher25_C_OnBlendOut_0E98A85F4EB644014D42909522C7C474_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.OnCompleted_0E98A85F4EB644014D42909522C7C474
struct UAB_Menu_Slasher25_C_OnCompleted_0E98A85F4EB644014D42909522C7C474_Params
{
	struct FName                                       NotifyName;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_LayeredBoneBlend_634B60C44CBBE54A99205A9667B45B41
struct UAB_Menu_Slasher25_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_LayeredBoneBlend_634B60C44CBBE54A99205A9667B45B41_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_TransitionResult_3432C8EB4229B4949B98409C2AC734CF
struct UAB_Menu_Slasher25_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_TransitionResult_3432C8EB4229B4949B98409C2AC734CF_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_TransitionResult_F4FE0D2D4C45163D1651928AAD4B8ED4
struct UAB_Menu_Slasher25_C_EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Menu_Slasher25_AnimGraphNode_TransitionResult_F4FE0D2D4C45163D1651928AAD4B8ED4_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.BlueprintUpdateAnimation
struct UAB_Menu_Slasher25_C_BlueprintUpdateAnimation_Params
{
	float                                              DeltaTimeX;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_Interupt02Start
struct UAB_Menu_Slasher25_C_AnimNotify_Interupt02Start_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_Interupt01Start
struct UAB_Menu_Slasher25_C_AnimNotify_Interupt01Start_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.BlueprintInitializeAnimation
struct UAB_Menu_Slasher25_C_BlueprintInitializeAnimation_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_Idle
struct UAB_Menu_Slasher25_C_AnimNotify_Idle_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_FX_K25_Menu_AppearBox
struct UAB_Menu_Slasher25_C_AnimNotify_FX_K25_Menu_AppearBox_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.AnimNotify_FX_K25_Menu_DisappearBox
struct UAB_Menu_Slasher25_C_AnimNotify_FX_K25_Menu_DisappearBox_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.HideAccessories
struct UAB_Menu_Slasher25_C_HideAccessories_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.HideChainsAndLament
struct UAB_Menu_Slasher25_C_HideChainsAndLament_Params
{
};

// Function AB_Menu_Slasher25.AB_Menu_Slasher25_C.ExecuteUbergraph_AB_Menu_Slasher25
struct UAB_Menu_Slasher25_C_ExecuteUbergraph_AB_Menu_Slasher25_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
