#pragma once

// Name: DeadB, Version: 5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class DBDUIViewsCore.CoreBaseUserWidget
// 0x0078 (FullSize[0x02D8] - InheritedSize[0x0260])
class UCoreBaseUserWidget : public UUserWidget
{
public:
	unsigned char                                      UnknownData_7T7B[0x10];                                    // 0x0260(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UScaleBox*                                   ScaleContainer;                                            // 0x0270(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               IsInteractive;                                             // 0x0278(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	DBDSharedTypes_EControlMode                        _controlMode;                                              // 0x0279(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	DBDUIManagers_EScaleType                           ScaleType;                                                 // 0x027A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_XNMH[0x5];                                     // 0x027B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDInputManager*                            _inputManager;                                             // 0x0280(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_KBS3[0x50];                                    // 0x0288(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreBaseUserWidget");
		return ptr;
	}



	void UpdateScale(float Scale);
	void RegisterForInput();
	void OnControlModeChangedBP(DBDSharedTypes_EControlMode controlMode);
	void DeregisterFromInput();
};

// Class DBDUIViewsCore.CharacterTooltipWidget
// 0x0020 (FullSize[0x02F8] - InheritedSize[0x02D8])
class UCharacterTooltipWidget : public UCoreBaseUserWidget
{
public:
	class UDBDTextBlock*                               InstructionTB;                                             // 0x02D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                               LevelTB;                                                   // 0x02E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                               MarketTB;                                                  // 0x02E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                           DifficultyRTB;                                             // 0x02F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CharacterTooltipWidget");
		return ptr;
	}



	void SetTooltipData(const struct FCharacterTooltipViewData& characterViewData);
	void SetLevel(int Level);
	void SetDifficulty(DBDSharedTypes_ECharacterDifficulty Difficulty);
};

// Class DBDUIViewsCore.CoreBaseLoadoutPartWidget
// 0x0018 (FullSize[0x0278] - InheritedSize[0x0260])
class UCoreBaseLoadoutPartWidget : public UUserWidget
{
public:
	class UDBDImage*                                   ImageRarity;                                               // 0x0260(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDImage*                                   ImageIcon;                                                 // 0x0268(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                                  TextStackCount;                                            // 0x0270(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreBaseLoadoutPartWidget");
		return ptr;
	}



	void SetLoadoutStackCount(int StackCount);
	void SetLoadoutPartRarity(DBDSharedTypes_EItemRarity Rarity);
	void SetLoadoutPartIcon();
};

// Class DBDUIViewsCore.CoreAddonWidget
// 0x0008 (FullSize[0x0280] - InheritedSize[0x0278])
class UCoreAddonWidget : public UCoreBaseLoadoutPartWidget
{
public:
	unsigned char                                      UnknownData_88J2[0x8];                                     // 0x0278(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreAddonWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreBaseHudWidget
// 0x0018 (FullSize[0x02F0] - InheritedSize[0x02D8])
class UCoreBaseHudWidget : public UCoreBaseUserWidget
{
public:
	float                                              FocusAnimationDuration;                                    // 0x02D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              FocusAnimationDelay;                                       // 0x02DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UITween_EEasingType                                FocusAnimationEasing;                                      // 0x02E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_QF0I[0x3];                                     // 0x02E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FocusAnimationMaxOpacity;                                  // 0x02E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              FocusAnimationMinOpacity;                                  // 0x02E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_7X7B[0x4];                                     // 0x02EC(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreBaseHudWidget");
		return ptr;
	}



	bool ShouldPlayFocusAnimation();
	void PlayFocusAnimation();
};

// Class DBDUIViewsCore.CoreButtonPromptWidget
// 0x0038 (FullSize[0x0310] - InheritedSize[0x02D8])
class UCoreButtonPromptWidget : public UCoreBaseUserWidget
{
public:
	class UAkAudioEvent*                               CursorOverSfx;                                             // 0x02D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                               CursorPressSfx;                                            // 0x02E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                               CursorReleaseSfx;                                          // 0x02E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputPromptTextWidget*                  _inputPromptText;                                          // 0x02F0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                                  _buttonTextField;                                          // 0x02F8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    _buttonPromptTriggeredDelegate;                            // 0x0300(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreButtonPromptWidget");
		return ptr;
	}



	void SetText(const struct FText& Text);
	void SetInputKey(const struct FKey& Key);
	void SetAction(DBDInput_EUIActionType actionType);
	void EnablePrompts();
	void DisablePrompts();
};

// Class DBDUIViewsCore.CoreButtonSelector
// 0x0048 (FullSize[0x0320] - InheritedSize[0x02D8])
class UCoreButtonSelector : public UCoreBaseUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnSelectedDelegate;                                        // 0x02D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnSelectedAgainDelegate;                                   // 0x02E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnUnselectedDelegate;                                      // 0x02F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UCoreSelectableButtonWidget*>         _buttons;                                                  // 0x0308(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_0FSD[0x8];                                     // 0x0318(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreButtonSelector");
		return ptr;
	}



	void UnselectCurrent();
	void SetAllEnabled(bool Enabled);
	bool SelectPrevious();
	bool SelectNext();
	bool Select(class UCoreSelectableButtonWidget* buttonToSelect);
	void OnUnselectedDelegate__DelegateSignature(class UCoreSelectableButtonWidget* unselectedButton);
	void OnSelectedDelegate__DelegateSignature(class UCoreSelectableButtonWidget* selectedButton);
	void OnSelectedAgainDelegate__DelegateSignature(class UCoreSelectableButtonWidget* selectedButton);
	void OnButtonSelectedChanged(class UCoreSelectableButtonWidget* selectedButton, bool IsSelected);
	void OnButtonSelectedAgain(class UCoreSelectableButtonWidget* selectedButton);
	bool HasSelection();
};

// Class DBDUIViewsCore.CoreButtonWidget
// 0x00C0 (FullSize[0x0398] - InheritedSize[0x02D8])
class UCoreButtonWidget : public UCoreBaseUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnHoveredDelegate;                                         // 0x02D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnUnhoveredDelegate;                                       // 0x02E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnPressedDelegate;                                         // 0x02F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnReleasedDelegate;                                        // 0x0308(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnClickedDelegate;                                         // 0x0318(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FString                                     HoveredSfxName;                                            // 0x0328(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               HoveredSfx;                                                // 0x0338(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PressedSfxName;                                            // 0x0340(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               PressedSfx;                                                // 0x0350(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ClickedSfxName;                                            // 0x0358(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               ClickedSfx;                                                // 0x0368(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDUIViewsCore_EAnalogCursorStickiness             AnalogCursorStickiness;                                    // 0x0370(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IJ2L[0x7];                                     // 0x0371(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDButton*                                  HitzoneButton;                                             // 0x0378(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                               LabelTB;                                                   // 0x0380(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_33NR[0x10];                                    // 0x0388(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreButtonWidget");
		return ptr;
	}



	void SetVisible(DBDUIViewsCore_EButtonWidgetVisibility visible);
	void SetPressable(bool isPressable);
	void SetLabel(const struct FText& label);
	void SetHoverable(bool isHoverable);
	void SetHoldable(bool isHoldable);
	void SetEnabled(bool IsEnabled);
	void SetClickable(bool isClickable);
	void SetChargeable(bool isChargeable);
	void OnUnhoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
	void OnUnhovered();
	void OnReleasedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
	void OnReleased();
	void OnPressedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
	void OnPressed();
	void OnInternalUnhovered();
	void OnInternalReleased();
	void OnInternalPressed();
	void OnInternalHovered();
	void OnInternalClicked();
	void OnHoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
	void OnHovered();
	void OnEnabledChanged(bool IsEnabled);
	void OnClickedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
	void OnClicked();
	bool IsEnabled();
};

// Class DBDUIViewsCore.CoreRewardWidget
// 0x0008 (FullSize[0x03A0] - InheritedSize[0x0398])
class UCoreRewardWidget : public UCoreButtonWidget
{
public:
	class UDBDImage*                                   RewardIcon;                                                // 0x0398(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreRewardWidget");
		return ptr;
	}



	void ClearData();
};

// Class DBDUIViewsCore.CoreCharacterRewardWidget
// 0x0000 (FullSize[0x03A0] - InheritedSize[0x03A0])
class UCoreCharacterRewardWidget : public UCoreRewardWidget
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreCharacterRewardWidget");
		return ptr;
	}



	void SetData(const struct FCharacterRewardViewData& CharacterRewardViewData);
};

// Class DBDUIViewsCore.CoreCurrencyProgressionRewardWidget
// 0x0000 (FullSize[0x03A0] - InheritedSize[0x03A0])
class UCoreCurrencyProgressionRewardWidget : public UCoreRewardWidget
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreCurrencyProgressionRewardWidget");
		return ptr;
	}



	void SetData(const struct FCurrencyProgressionRewardViewData& CurrencyProgressionRewardViewData);
};

// Class DBDUIViewsCore.CoreCustomizationRewardWidget
// 0x0000 (FullSize[0x03A0] - InheritedSize[0x03A0])
class UCoreCustomizationRewardWidget : public UCoreRewardWidget
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreCustomizationRewardWidget");
		return ptr;
	}



	void SetData(const struct FCustomizationRewardViewData& CustomizationRewardViewData);
};

// Class DBDUIViewsCore.CoreEndGameCollapseBarWidget
// 0x0078 (FullSize[0x0368] - InheritedSize[0x02F0])
class UCoreEndGameCollapseBarWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_1IDQ[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _progressBarInterpSpeed;                                   // 0x02F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_9DYD[0x6C];                                    // 0x02FC(0x006C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreEndGameCollapseBarWidget");
		return ptr;
	}



	void UpdateBarProgression(float Progress);
	void PlayToZeroAnimation();
};

// Class DBDUIViewsCore.CoreEndGameCollapseProgressWidget
// 0x0048 (FullSize[0x0320] - InheritedSize[0x02D8])
class UCoreEndGameCollapseProgressWidget : public UCoreBaseUserWidget
{
public:
	class UProgressBar*                                ProgressBar;                                               // 0x02D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                                MarkerLeftCanvas;                                          // 0x02E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                                MarkerRightCanvas;                                         // 0x02E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBoxSlot*                          _markerLeftBox;                                            // 0x02F0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBoxSlot*                          _markerRightBox;                                           // 0x02F8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_XLN9[0x20];                                    // 0x0300(0x0020) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreEndGameCollapseProgressWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreEquippedItemWidget
// 0x0010 (FullSize[0x0300] - InheritedSize[0x02F0])
class UCoreEquippedItemWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_9DV3[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAkAudioEvent*                               ItemDisappearSfx;                                          // 0x02F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreEquippedItemWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreEquippedPowerWidget
// 0x0008 (FullSize[0x02F8] - InheritedSize[0x02F0])
class UCoreEquippedPowerWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_DCBA[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreEquippedPowerWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreExampleWidget
// 0x0098 (FullSize[0x0388] - InheritedSize[0x02F0])
class UCoreExampleWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_GDXN[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     EditAnywhere;                                              // 0x02F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EditDefaultsOnly;                                          // 0x0308(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EditInstanceOnly;                                          // 0x0318(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EditNoBlueprint;                                           // 0x0328(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EditDefaultsOnlyBlueprintReadOnly;                         // 0x0338(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     VisibleAnywhere;                                           // 0x0348(0x0010) (Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     VisibleDefaultsOnly;                                       // 0x0358(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     VisibleInstanceOnly;                                       // 0x0368(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    ExampleButtonClickDelegate;                                // 0x0378(0x0010) (ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreExampleWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreExternalEffectsWidget
// 0x0278 (FullSize[0x0568] - InheritedSize[0x02F0])
class UCoreExternalEffectsWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_D2CE[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector2D                                   GridSlotSize;                                              // 0x02F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AddonScaleRatio;                                           // 0x0300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                SpacingBetweenRows;                                        // 0x0304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                SpacingPerks;                                              // 0x0308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                SpacingAddons;                                             // 0x030C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                SpacingBetweenPerksAndAddons;                              // 0x0310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_TNIR[0x4];                                     // 0x0314(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      PerkWidgetClass;                                           // 0x0318(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      AddonWidgetClass;                                          // 0x0320(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGridPanel*                                  Container;                                                 // 0x0328(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_16IN[0x8];                                     // 0x0330(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FPerkViewData>                       _perkData;                                                 // 0x0338(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FName, class UCorePerkWidget*>         _perkWidgets;                                              // 0x0348(0x0050) (ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCorePerkWidget*>                     _perkPool;                                                 // 0x0398(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _perkViewInterfaces[0x50];                                 // 0x03A8(0x0050) UNKNOWN PROPERTY: MapProperty
	TArray<struct FAddonViewData>                      _addonData;                                                // 0x03F8(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FName, class UCoreAddonWidget*>        _addonWidgets;                                             // 0x0408(0x0050) (ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCoreAddonWidget*>                    _addonPool;                                                // 0x0458(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _addonViewInterfaces[0x50];                                // 0x0468(0x0050) UNKNOWN PROPERTY: MapProperty
	TMap<struct FName, struct FTimerHandle>            _timerHandleMap;                                           // 0x04B8(0x0050) (Transient, NativeAccessSpecifierPrivate)
	TMap<struct FName, class USpacer*>                 _spacerWidgets;                                            // 0x0508(0x0050) (ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class USpacer*>                             _spacerPool;                                               // 0x0558(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreExternalEffectsWidget");
		return ptr;
	}



	void HideExternalPerk(const struct FName& perkId);
	void HideExternalAddon(const struct FName& AddonID);
};

// Class DBDUIViewsCore.CoreGameManualCategoryButton
// 0x0030 (FullSize[0x03C8] - InheritedSize[0x0398])
class UCoreGameManualCategoryButton : public UCoreButtonWidget
{
public:
	class UDBDTextBlock*                               Title;                                                     // 0x0398(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDBDTextBlock*                               Description;                                               // 0x03A0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDBDImage*                                   Icon;                                                      // 0x03A8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDBDImage*                                   Background;                                                // 0x03B0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                                  IconTexture;                                               // 0x03B8(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                                  BackgroundTexture;                                         // 0x03C0(0x0008) (Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreGameManualCategoryButton");
		return ptr;
	}



	void SetText(const struct FText& Title, const struct FText& Description);
};

// Class DBDUIViewsCore.CoreGameManualPanelWidget
// 0x00D8 (FullSize[0x03B0] - InheritedSize[0x02D8])
class UCoreGameManualPanelWidget : public UCoreBaseUserWidget
{
public:
	unsigned char                                      UnknownData_QVXJ[0x8];                                     // 0x02D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	DBDUIViewInterfaces_EGameManualMenuState           _currentSelectedManualMenu;                                // 0x02E0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	DBDSharedTypes_EHelpType                           _currentGameManualTopic;                                   // 0x02E1(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_4RAF[0x6];                                     // 0x02E2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UPanelWidget*                                CategoryPanel;                                             // 0x02E8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreGameManualCategoryButton*               GameCategoryButton;                                        // 0x02F0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreGameManualCategoryButton*               SurvivorCategoryButton;                                    // 0x02F8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreGameManualCategoryButton*               KillerCategoryButton;                                      // 0x0300(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                                TopicsPanel;                                               // 0x0308(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreTabContainerWidget*                     GameManualTopicsTabs;                                      // 0x0310(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                               GameManualContentTitle;                                    // 0x0318(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDTextBlock*                               GameManualContentSubtitle;                                 // 0x0320(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDRichTextBlock*                           GameManualContentText;                                     // 0x0328(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    _onSetOnboardingMenuSubtitleDelegate;                      // 0x0330(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	struct FScriptMulticastDelegate                    _onResetOnboardingMenuSubtitleDelegate;                    // 0x0340(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_8F6D[0x60];                                    // 0x0350(0x0060) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreGameManualPanelWidget");
		return ptr;
	}



	void ToggleGameManualMenuState();
	void ShowHelpTopics(DBDSharedTypes_EHelpType categoryType);
	void SetGameManualMenuState(DBDUIViewInterfaces_EGameManualMenuState menuState);
	void SetCurrentOnbardingMenuSubtitle();
	void ResetScrolls(bool resetTopicsScroll);
	void OnTopicsTabSelected(class UCoreSelectableButtonWidget* selectedButton);
};

// Class DBDUIViewsCore.CoreHookCountWidget
// 0x0008 (FullSize[0x02F8] - InheritedSize[0x02F0])
class UCoreHookCountWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_T1D6[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHookCountWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreHudAlertWidget
// 0x0090 (FullSize[0x0380] - InheritedSize[0x02F0])
class UCoreHudAlertWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_UGQS[0x8];                                     // 0x02F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MaxDisplayedItems;                                         // 0x02F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              SecondaryAlpha;                                            // 0x02FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              FullAlertDuration;                                         // 0x0300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              PendingAlertDuration;                                      // 0x0304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              AnimationDuration;                                         // 0x0308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	UITween_EEasingType                                AnimationEasing;                                           // 0x030C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_T30M[0x3];                                     // 0x030D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              AnimationTranslationY;                                     // 0x0310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_3SJK[0x4];                                     // 0x0314(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UClass*                                      CoreHudScoreAlertItemClass;                                // 0x0318(0x0008) (Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      CoreHudStatusEffectAlertItemClass;                         // 0x0320(0x0008) (Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGridPanel*                                  AlertContainer;                                            // 0x0328(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCoreBaseUserWidget*>                 _alerts;                                                   // 0x0330(0x0010) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCoreBaseUserWidget*>                 _pendingAlerts;                                            // 0x0340(0x0010) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCoreHudScoreAlertItem*>              _scoreAlertPool;                                           // 0x0350(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCoreHudStatusEffectAlertItem*>       _statusEffectAlertPool;                                    // 0x0360(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_Q7X5[0x10];                                    // 0x0370(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHudAlertWidget");
		return ptr;
	}



	void PopAlert();
	void OnPopAlertComplete(class UUITweenInstance* tween);
	void OnClearAlertsComplete(class UUITweenInstance* tween);
	float GetRemainingTime();
	TArray<class UCoreBaseUserWidget*> GetPendingAlerts();
	TArray<class UCoreBaseUserWidget*> GetAlerts();
	void ClearAlerts();
};

// Class DBDUIViewsCore.CoreHudObjectivesWidget
// 0x0018 (FullSize[0x0308] - InheritedSize[0x02F0])
class UCoreHudObjectivesWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_BT3Q[0x10];                                    // 0x02F0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDTextBlock*                               SpecialSpacer;                                             // 0x0300(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHudObjectivesWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreHudObjectiveWidget
// 0x0018 (FullSize[0x0308] - InheritedSize[0x02F0])
class UCoreHudObjectiveWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_YMFK[0x10];                                    // 0x02F0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDTextBlock*                               SpecialSpacer;                                             // 0x0300(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHudObjectiveWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreHudScoreAlertItem
// 0x0000 (FullSize[0x02D8] - InheritedSize[0x02D8])
class UCoreHudScoreAlertItem : public UCoreBaseUserWidget
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHudScoreAlertItem");
		return ptr;
	}



	void SetData(const struct FScoreAlertViewData& Data);
};

// Class DBDUIViewsCore.CoreHudStatusEffectAlertItem
// 0x0000 (FullSize[0x02D8] - InheritedSize[0x02D8])
class UCoreHudStatusEffectAlertItem : public UCoreBaseUserWidget
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreHudStatusEffectAlertItem");
		return ptr;
	}



	void SetData(const struct FStatusEffectAlertViewData& Data);
};

// Class DBDUIViewsCore.CoreInputPromptTextWidget
// 0x0048 (FullSize[0x0320] - InheritedSize[0x02D8])
class UCoreInputPromptTextWidget : public UCoreBaseUserWidget
{
public:
	class UCoreInputPromptWidget*                      InputPrompt;                                               // 0x02D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                                  TextField;                                                 // 0x02E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FKey                                        InputKey;                                                  // 0x02E8(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FText                                       Text;                                                      // 0x0308(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInputPromptTextWidget");
		return ptr;
	}



	void SetText(const struct FText& Text);
	void SetInputKey(const struct FKey& InputKey);
};

// Class DBDUIViewsCore.CoreInputPromptWidget
// 0x0040 (FullSize[0x0318] - InheritedSize[0x02D8])
class UCoreInputPromptWidget : public UCoreBaseUserWidget
{
public:
	struct FText                                       _unfoundInputKeyText;                                      // 0x02D8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FKey                                        _inputKey;                                                 // 0x02F0(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isEnabled;                                                // 0x0310(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_WXTT[0x7];                                     // 0x0311(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInputPromptWidget");
		return ptr;
	}



	void SetInputKey(const struct FKey& InputKey);
	void SetEnabled(bool IsEnabled);
	void PromptNotFound();
	void OnEnabledChanged(bool IsEnabled);
	bool IsEnabled();
	struct FText GetInputShortDisplayName();
	struct FKey GetInputKey();
	void DisplayPrompt();
};

// Class DBDUIViewsCore.CoreInputSwitcherWidget
// 0x0028 (FullSize[0x0300] - InheritedSize[0x02D8])
class UCoreInputSwitcherWidget : public UCoreBaseUserWidget
{
public:
	DBDUIViewsCore_EInputSwitcherDisplayRule           ButtonDisplayRule;                                         // 0x02D8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDUIViewsCore_EInputSwitcherDisplayRule           InputPromptDisplayRule;                                    // 0x02D9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0EXF[0x6];                                     // 0x02DA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UCoreKeyListenerInputPromptWidget*           InputPrompt;                                               // 0x02E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreButtonWidget*                           Button;                                                    // 0x02E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScriptMulticastDelegate                    _onInputSwitcherTriggeredDelegate;                         // 0x02F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInputSwitcherWidget");
		return ptr;
	}



	void SetUIAction(DBDInput_EUIActionType actionType);
	void SetLabel(const struct FText& label);
	void SetEnabled(bool IsEnabled);
	void OnInputPromptTriggered();
	void OnButtonClicked(class UCoreButtonWidget* Target);
	class UCoreKeyListenerInputPromptWidget* GetInputPrompt();
	class UCoreButtonWidget* GetButton();
};

// Class DBDUIViewsCore.CoreInteractionProgressWidget
// 0x0020 (FullSize[0x0310] - InheritedSize[0x02F0])
class UCoreInteractionProgressWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_BHC9[0x10];                                    // 0x02F0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UCoreStatusEffectIcon*>               Proficiencies;                                             // 0x0300(0x0010) (BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInteractionProgressWidget");
		return ptr;
	}



	void SetProficiencies(TArray<struct FStatusEffectViewData> proficiencyDatas);
};

// Class DBDUIViewsCore.CoreInteractionPromptActionWidget
// 0x00B8 (FullSize[0x0390] - InheritedSize[0x02D8])
class UCoreInteractionPromptActionWidget : public UCoreBaseUserWidget
{
public:
	class UCoreInputPromptWidget*                      InputPrompt;                                               // 0x02D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputPromptWidget*                      InputPrompt2;                                              // 0x02E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputPromptWidget*                      InputPrompt3;                                              // 0x02E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCoreInputPromptWidget*                      InputPrompt4;                                              // 0x02F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FName                                       IdleAnimationName;                                         // 0x02F8(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_DCDZ[0x4];                                     // 0x0304(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FKey                                        InputKey;                                                  // 0x0308(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FKey                                        InputKey2;                                                 // 0x0328(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FKey                                        InputKey3;                                                 // 0x0348(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FKey                                        InputKey4;                                                 // 0x0368(0x0020) (Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_K39Q[0x8];                                     // 0x0388(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInteractionPromptActionWidget");
		return ptr;
	}



	void StopIdleAnimation();
	void SetInputKey4(const struct FKey& InputKey4);
	void SetInputKey3(const struct FKey& InputKey3);
	void SetInputKey2(const struct FKey& InputKey2);
	void SetInputKey(const struct FKey& InputKey);
	void PlayIdleAnimation();
	bool HasThirdPrompt();
	bool HasSecondPrompt();
	bool HasFourthPrompt();
};

// Class DBDUIViewsCore.CoreInteractionPromptsContainerWidget
// 0x00B0 (FullSize[0x03A0] - InheritedSize[0x02F0])
class UCoreInteractionPromptsContainerWidget : public UCoreBaseHudWidget
{
public:
	unsigned char                                      UnknownData_QCTW[0x10];                                    // 0x02F0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UDBDWrapBox*                                 CenterContainerBox;                                        // 0x0300(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDBDWrapBox*                                 ContainerBox;                                              // 0x0308(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      InteractionPromptWidgetClass;                              // 0x0310(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MaxDisplayedPrompts;                                       // 0x0318(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                MaxDisplayedCenterPrompts;                                 // 0x031C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                     SlotMargin;                                                // 0x0320(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UCoreInteractionPromptWidget*>        _promptWidgetPool;                                         // 0x0330(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCoreInteractionPromptWidget*>        _centerPromptWidgetPool;                                   // 0x0340(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FName, class UCoreInteractionPromptWidget*> _displayedPromptsMap;                                      // 0x0350(0x0050) (ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class DBDUIViewsCore.CoreInteractionPromptsContainerWidget");
		return ptr;
	}



};

// Class DBDUIViewsCore.CoreInteractionPromptWidget
// 0x0020 (FullSize[0x0280] - InheritedSize[0x0260])
class UCoreInteractionPromptWidget : public UUserWidget
{
public:
	float                                              LargeTextScale;                                            // 0x0260(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_CKUD[0x4];                                     // 0x0264(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
