#pragma once

// Name: DeadB, Version: 5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum DeadByDaylight.EInputInteractionType
enum class DeadByDaylight_EInputInteractionType : uint8_t
{
	EInputInteractionType__VE_None = 0,
	EInputInteractionType__VE_Interact = 1,
	EInputInteractionType__VE_AttackInteract = 2,
	EInputInteractionType__VE_ItemInteract = 3,
	EInputInteractionType__VE_Rush = 4,
	EInputInteractionType__VE_Run  = 5,
	EInputInteractionType__VE_ItemUse = 6,
	EInputInteractionType__VE_ItemDrop = 7,
	EInputInteractionType__VE_InteractMash = 8,
	EInputInteractionType__VE_LeftRightMash = 9,
	EInputInteractionType__VE_ExternalRequestDrop = 10,
	EInputInteractionType__VE_ExternalRequestFlashlightStunUncloak = 11,
	EInputInteractionType__VE_ExternalRequestPalletStun = 12,
	EInputInteractionType__VE_ExternalRequestStunUncloak = 13,
	EInputInteractionType__VE_ExternalRequestPalletStunUncloak = 14,
	EInputInteractionType__VE_ExternalRequestStun = 15,
	EInputInteractionType__VE_ExternalRequestDropByStunning = 16,
	EInputInteractionType__VE_ExternalRequestDropByStunningByPallet = 17,
	EInputInteractionType__VE_ExternalRequestDropByWiggleFree = 18,
	EInputInteractionType__VE_ExternalRequestDropBySkillCheck = 19,
	EInputInteractionType__VE_ExternalRequestKillerCaughtInBearTrap = 20,
	EInputInteractionType__VE_ExternalRequestDestroyWithPowerAttack = 21,
	EInputInteractionType__VE_ExternalRequestHarpoonRifleStun = 22,
	EInputInteractionType__VE_ExternalRequestGeneratorTrapStun = 23,
	EInputInteractionType__VE_FastInteract = 24,
	EInputInteractionType__VE_ExternalRequestSlashedOutOfTrap = 25,
	EInputInteractionType__VE_ExternalRequestSacrifice = 26,
	EInputInteractionType__VE_Gesture01 = 27,
	EInputInteractionType__VE_Gesture02 = 28,
	EInputInteractionType__VE_Gesture03 = 29,
	EInputInteractionType__VE_Gesture04 = 30,
	EInputInteractionType__VE_ExternalChainBlink = 31,
	EInputInteractionType__VE_ExternalRequestStunEvilWithin = 32,
	EInputInteractionType__VE_ExternalRequestKickStun = 33,
	EInputInteractionType__VE_ExternalRequestEscape = 34,
	EInputInteractionType__VE_Struggle = 35,
	EInputInteractionType__VE_Action = 36,
	EInputInteractionType__VE_ExternalRequestPutToSleepStun = 37,
	EInputInteractionType__VE_Crouch = 38,
	EInputInteractionType__VE_ExternalRequestRBTExecute = 39,
	EInputInteractionType__VE_ActionKiller = 40,
	EInputInteractionType__VE_ExternalRequestRBTExecuteAtExit = 41,
	EInputInteractionType__VE_ExternalRequestStunBySkillCheck = 42,
	EInputInteractionType__VE_AbilityUse = 43,
	EInputInteractionType__VE_ExternalRequestClosetStun = 44,
	EInputInteractionType__VE_ExternalRequestClosetExitFast = 45,
	EInputInteractionType__VE_ActivatablePerk01 = 46,
	EInputInteractionType__VE_ActivatablePerk02 = 47,
	EInputInteractionType__VE_ActivatablePerk03 = 48,
	EInputInteractionType__VE_ActivatablePerk04 = 49,
	EInputInteractionType__VE_CancelCharge = 50,
	EInputInteractionType__VE_WiggleLeft = 51,
	EInputInteractionType__VE_WiggleRight = 52,
	EInputInteractionType__VE_SecondaryAction = 53,
	EInputInteractionType__VE_Count = 54,
	EInputInteractionType__VE_MAX  = 55,

};

// Enum DeadByDaylight.EInventoryType
enum class DeadByDaylight_EInventoryType : uint8_t
{
	EInventoryType__Main           = 0,
	EInventoryType__Backpack       = 1,
	EInventoryType__EInventoryType_MAX = 2,

};

// Enum DeadByDaylight.EAttachToSocketNameEnum
enum class DeadByDaylight_EAttachToSocketNameEnum : uint8_t
{
	EAttachToSocketNameEnum__ManualAttachment = 0,
	EAttachToSocketNameEnum__HandItemSocket = 1,
	EAttachToSocketNameEnum__Weapon_SocketLT = 2,
	EAttachToSocketNameEnum__Weapon_SocketRT = 3,
	EAttachToSocketNameEnum__LanternCollectableSocket = 4,
	EAttachToSocketNameEnum__Tentacle_SocketLT = 5,
	EAttachToSocketNameEnum__EAttachToSocketNameEnum_MAX = 6,

};

// Enum DeadByDaylight.ECollectableState
enum class DeadByDaylight_ECollectableState : uint8_t
{
	ECollectableState__OnGround    = 0,
	ECollectableState__Stored      = 1,
	ECollectableState__Equipped    = 2,
	ECollectableState__ToBeDropped = 3,
	ECollectableState__InSearchable = 4,
	ECollectableState__ECollectableState_MAX = 5,

};

// Enum DeadByDaylight.ECollectableCategory
enum class DeadByDaylight_ECollectableCategory : uint8_t
{
	ECollectableCategory__Common   = 0,
	ECollectableCategory__Rare     = 1,
	ECollectableCategory__ECollectableCategory_MAX = 2,

};

// Enum DeadByDaylight.EItemHandPosition
enum class DeadByDaylight_EItemHandPosition : uint8_t
{
	EItemHandPosition__None        = 0,
	EItemHandPosition__HandleItem  = 1,
	EItemHandPosition__AimItem     = 2,
	EItemHandPosition__SmallItem   = 3,
	EItemHandPosition__FirecrackerItem = 4,
	EItemHandPosition__VaccineItem = 5,
	EItemHandPosition__EItemHandPosition_MAX = 6,

};

// Enum DeadByDaylight.EAtlantaItemProgressionBarEnum
enum class DeadByDaylight_EAtlantaItemProgressionBarEnum : uint8_t
{
	EAtlantaItemProgressionBarEnum__PrimaryBar = 0,
	EAtlantaItemProgressionBarEnum__SecondaryBar = 1,
	EAtlantaItemProgressionBarEnum__EAtlantaItemProgressionBarEnum_MAX = 2,

};

// Enum DeadByDaylight.EDBDScoreTypes
enum class DeadByDaylight_EDBDScoreTypes : uint8_t
{
	EDBDScoreTypes__DBDCamperScore_SurviveHealthy = 0,
	EDBDScoreTypes__DBDCamperScore_SurviveWounded = 1,
	EDBDScoreTypes__DBDCamperScore_SurviveKO = 2,
	EDBDScoreTypes__DBDCamperScore_UnlockHatch = 3,
	EDBDScoreTypes__DBDCamperScore_EscapeThroughHatch = 4,
	EDBDScoreTypes__DBDCamperScore_AllEscapeThroughHatch = 5,
	EDBDScoreTypes__DBDCamperScore_EscapeCarry = 6,
	EDBDScoreTypes__DBDCamperScore_SurviveStreakSmall = 7,
	EDBDScoreTypes__DBDCamperScore_SurviveStreakBig = 8,
	EDBDScoreTypes__DBDCamperScore_DamageStateChanged = 9,
	EDBDScoreTypes__DBDCamperScore_NearFriendInNeed = 10,
	EDBDScoreTypes__DBDCamperScore_NearFriendInNeed_PostExit = 11,
	EDBDScoreTypes__DBDCamperScore_FoundCamper = 12,
	EDBDScoreTypes__DBDCamperScore_CoopObjectives = 13,
	EDBDScoreTypes__DBDCamperScore_OpenDoorPercent = 14,
	EDBDScoreTypes__DBDCamperScore_OpenDoor = 15,
	EDBDScoreTypes__DBDCamperScore_GeneratorPercent = 16,
	EDBDScoreTypes__DBDCamperScore_GeneratorSkillCheckSuccess = 17,
	EDBDScoreTypes__DBDCamperScore_GeneratorSkillCheckBonus = 18,
	EDBDScoreTypes__DBDCamperScore_SearchablePercent = 19,
	EDBDScoreTypes__DBDCamperScore_SearchCompleteFinalContributionPercent = 20,
	EDBDScoreTypes__DBDCamperScore_AddItemToMap = 21,
	EDBDScoreTypes__DBDCamperScore_FixGenerator = 22,
	EDBDScoreTypes__DBDCamperScore_FixSpecialMapGenerator = 23,
	EDBDScoreTypes__DBDCamperScore_LastSurvivorFixGenerator = 24,
	EDBDScoreTypes__DBDCamperScore_RepairDamagedGenerator = 25,
	EDBDScoreTypes__DBDCamperScore_PowerExitGates = 26,
	EDBDScoreTypes__DBDCamperScore_CoopAltruism = 27,
	EDBDScoreTypes__DBDCamperScore_HealPercent = 28,
	EDBDScoreTypes__DBDCamperScore_HealPercent_PostExit = 29,
	EDBDScoreTypes__DBDCamperScore_HealFromDying = 30,
	EDBDScoreTypes__DBDCamperScore_HealFromDying_PostExit = 31,
	EDBDScoreTypes__DBDCamperScore_HealFromInjured = 32,
	EDBDScoreTypes__DBDCamperScore_HealFromInjured_PostExit = 33,
	EDBDScoreTypes__DBDCamperScore_HealSkillCheckSuccess = 34,
	EDBDScoreTypes__DBDCamperScore_HealSkillCheckBonus = 35,
	EDBDScoreTypes__DBDCamperScore_HealSelfPercent = 36,
	EDBDScoreTypes__DBDCamperScore_HealSelfSkillCheckSuccess = 37,
	EDBDScoreTypes__DBDCamperScore_HealSelfSkillCheckBonus = 38,
	EDBDScoreTypes__DBDCamperScore_HitAfterHookSave = 39,
	EDBDScoreTypes__DBDCamperScore_HitNearFriendInNeed = 40,
	EDBDScoreTypes__DBDCamperScore_HitNearUnhookedFriendInNeed = 41,
	EDBDScoreTypes__DBDCamperScore_SabotageHook = 42,
	EDBDScoreTypes__DBDCamperScore_SabotageHookSkillCheckSuccess = 43,
	EDBDScoreTypes__DBDCamperScore_SabotageHookSkillCheckBonus = 44,
	EDBDScoreTypes__DBDCamperScore_EscapeFromHook = 45,
	EDBDScoreTypes__DBDCamperScore_HookStrugglePerSecond = 46,
	EDBDScoreTypes__DBDCamperScore_SaveFromHook = 47,
	EDBDScoreTypes__DBDCamperScore_SaveFromHook_PostExit = 48,
	EDBDScoreTypes__DBDCamperScore_WasUnhooked = 49,
	EDBDScoreTypes__DBDCamperScore_SabotageBearTrap = 50,
	EDBDScoreTypes__DBDCamperScore_SabotageBearTrapSkillCheckSuccess = 51,
	EDBDScoreTypes__DBDCamperScore_SabotageBearTrapSkillCheckBonus = 52,
	EDBDScoreTypes__DBDCamperScore_DisableBearTrap = 53,
	EDBDScoreTypes__DBDCamperScore_SaveFromBearTrap = 54,
	EDBDScoreTypes__DBDCamperScore_SaveFromBearTrap_PostExit = 55,
	EDBDScoreTypes__DBDCamperScore_EscapeBearTrap = 56,
	EDBDScoreTypes__DBDCamperScore_BasementChillingPerSecond = 57,
	EDBDScoreTypes__DBDCamperScore_CoopBoldness = 58,
	EDBDScoreTypes__DBDCamperScore_SlasherStun = 59,
	EDBDScoreTypes__DBDCamperScore_SlasherStunCarrying = 60,
	EDBDScoreTypes__DBDCamperScore_SlasherBlind = 61,
	EDBDScoreTypes__DBDCamperScore_SlasherBurnInvisibility = 62,
	EDBDScoreTypes__DBDCamperScore_ChasePerSecond = 63,
	EDBDScoreTypes__DBDCamperScore_ChaseEscape = 64,
	EDBDScoreTypes__DBDCamperScore_ChaseSteal = 65,
	EDBDScoreTypes__DBDCamperScore_ChaseBlind = 66,
	EDBDScoreTypes__DBDCamperScore_VaultInChase = 67,
	EDBDScoreTypes__DBDCamperScore_NoiseDistraction = 68,
	EDBDScoreTypes__DBDCamperScore_SprintingNearSlasherPerSecond = 69,
	EDBDScoreTypes__DBDCamperScore_UnhideNearSlasher = 70,
	EDBDScoreTypes__DBDCamperScore_EscapeWhileChased = 71,
	EDBDScoreTypes__DBDCamperScore_DestroyPhantomTrap = 72,
	EDBDScoreTypes__DBDCamperScore_NewItem = 73,
	EDBDScoreTypes__DBDCamperScore_StartMatchWithUltraRareItem = 74,
	EDBDScoreTypes__DBDCamperScore_ItemFrom = 75,
	EDBDScoreTypes__DBDCamperScore_ExposerAdded = 76,
	EDBDScoreTypes__DBDSlasherScore_Destroy = 77,
	EDBDScoreTypes__DBDSlasherScore_Kill = 78,
	EDBDScoreTypes__DBDSlasherScore_BleedOut = 79,
	EDBDScoreTypes__DBDSlasherScore_BleedOutPercent = 80,
	EDBDScoreTypes__DBDSlasherScore_AttackSuccess = 81,
	EDBDScoreTypes__DBDSlasherScore_AttackDeviousness = 82,
	EDBDScoreTypes__DBDSlasherScore_InterruptGenerator = 83,
	EDBDScoreTypes__DBDSlasherScore_InterruptWindow = 84,
	EDBDScoreTypes__DBDSlasherScore_InterruptHide = 85,
	EDBDScoreTypes__DBDSlasherScore_InterruptExit = 86,
	EDBDScoreTypes__DBDSlasherScore_InterruptUnhook = 87,
	EDBDScoreTypes__DBDSlasherScore_InterruptChest = 88,
	EDBDScoreTypes__DBDSlasherScore_InterruptOpenHatch = 89,
	EDBDScoreTypes__DBDSlasherScore_InterruptExitHatch = 90,
	EDBDScoreTypes__DBDSlasherScore_FindHiding = 91,
	EDBDScoreTypes__DBDSlasherScore_PlaceTrap = 92,
	EDBDScoreTypes__DBDSlasherScore_Trap = 93,
	EDBDScoreTypes__DBDSlasherScore_TrapPickup = 94,
	EDBDScoreTypes__DBDSlasherScore_Hook = 95,
	EDBDScoreTypes__DBDSlasherScore_SacrificePercent = 96,
	EDBDScoreTypes__DBDSlasherScore_SacrificeSuccess = 97,
	EDBDScoreTypes__DBDSlasherScore_SacrificedCount = 98,
	EDBDScoreTypes__DBDSlasherScore_NoEscape = 99,
	EDBDScoreTypes__DBDSlasherScore_ChaseStart = 100,
	EDBDScoreTypes__DBDSlasherScore_ChasePerSecond = 101,
	EDBDScoreTypes__DBDSlasherScore_CloakStalkPerSecond = 102,
	EDBDScoreTypes__DBDSlasherScore_UncloakInView = 103,
	EDBDScoreTypes__DBDSlasherScore_UncloakAttack = 104,
	EDBDScoreTypes__DBDSlasherScore_EvadeInvisBurn = 105,
	EDBDScoreTypes__DBDSlasherScore_EvadeBlind = 106,
	EDBDScoreTypes__DBDSlasherScore_CamperDisconnect = 107,
	EDBDScoreTypes__DBDSlasherScore_HitCamperWithChainsaw = 108,
	EDBDScoreTypes__DBDSlasherScore_RunningWithChainsaw = 109,
	EDBDScoreTypes__DBDSlasherScore_ChainBlinkAttack = 110,
	EDBDScoreTypes__DBDSlasherScore_ChainBlinkInterrupt = 111,
	EDBDScoreTypes__DBDSlasherScore_ChainBlinkInterruptAfter3 = 112,
	EDBDScoreTypes__DBDSlasherScore_ChainBlinkStartChase = 113,
	EDBDScoreTypes__DBDSlasherScore_StalkpointGained = 114,
	EDBDScoreTypes__DBDSlasherScore_StalkerTierIncrement = 115,
	EDBDScoreTypes__DBDSlasherScore_StalkerTierFirstTime = 116,
	EDBDScoreTypes__DBDSlasherScore_StalkerKillAllCampers = 117,
	EDBDScoreTypes__DBDSlasherScore_PhantomTrapSet = 118,
	EDBDScoreTypes__DBDSlasherScore_PhantomTrapTrigger = 119,
	EDBDScoreTypes__DBDSlasherScore_PhantomTrapTriggerAttack = 120,
	EDBDScoreTypes__DBDSlasherScore_PhantomTrapTeleportAttack = 121,
	EDBDScoreTypes__DBDSlasherScore_PhantomTrapTeleportAttackAllCampers = 122,
	EDBDScoreTypes__DBDSlasherScore_ThrillOfTheHunt = 123,
	EDBDScoreTypes__DBDPlayerScore_BloodwebLevelUp = 124,
	EDBDScoreTypes__DBDPlayerScore_BloodwebPrestigeLevelUp = 125,
	EDBDScoreTypes__DBDPlayerScore_BloodwebPrestige3LevelUp = 126,
	EDBDScoreTypes__DBDPlayerScore_AwardPips = 127,
	EDBDScoreTypes__DBDPlayerScore_AddBloodpoints = 128,
	EDBDScoreTypes__DBDPlayerScore_BloodpointsOneCategory = 129,
	EDBDScoreTypes__DBDPlayerScore_MaxBloodpointsAllCategories = 130,
	EDBDScoreTypes__DBDPlayerScore_AddNewPerk = 131,
	EDBDScoreTypes__DBDPlayerScore_PerkLevelUp = 132,
	EDBDScoreTypes__DBDPlayerScore_BurnOfferingUltraRare = 133,
	EDBDScoreTypes__DBDPlayerScore_StartGame = 134,
	EDBDScoreTypes__DBDPlayerScore_UnlockRanking = 135,
	EDBDScoreTypes__DBDPlayerScore_FinishWithPerks = 136,
	EDBDScoreTypes__DBDCamperScore_CheatObjectives = 137,
	EDBDScoreTypes__DBDCamperScore_CheatSurvival = 138,
	EDBDScoreTypes__DBDCamperScore_CheatAltruism = 139,
	EDBDScoreTypes__DBDCamperScore_CheatBoldness = 140,
	EDBDScoreTypes__DBDSlasherScore_CheatSacrifice = 141,
	EDBDScoreTypes__DBDSlasherScore_CheatBrutality = 142,
	EDBDScoreTypes__DBDSlasherScore_CheatDeviousness = 143,
	EDBDScoreTypes__DBDSlasherScore_CheatHunter = 144,
	EDBDScoreTypes__DBDCamperScore_CleanseDullTotem = 145,
	EDBDScoreTypes__DBDCamperScore_CleanseHexTotem = 146,
	EDBDScoreTypes__DBDPlayerScore_BalancedLanding = 147,
	EDBDScoreTypes__DBDPlayerScore_Lithe = 148,
	EDBDScoreTypes__DBDSlasherScore_DamageGenerator = 149,
	EDBDScoreTypes__DBDSlasherScore_Vault = 150,
	EDBDScoreTypes__DBDCamperScore_StartInjuredBleedout = 151,
	EDBDScoreTypes__DBDCamperScore_FullRecovery = 152,
	EDBDScoreTypes__DBDCamperScore_FirstTimeDying = 153,
	EDBDScoreTypes__DBDCamperScore_SecondTimeDying = 154,
	EDBDScoreTypes__DBDCamperScore_FirecrackerDisturbance = 155,
	EDBDScoreTypes__DBDCamperScore_GeneratorSkillCheckRuinBonus = 156,
	EDBDScoreTypes__DBDCamperScore_SlasherBurnBlink = 157,
	EDBDScoreTypes__DBDCamperScore_DieSacrificed = 158,
	EDBDScoreTypes__DBDCamperScore_DieBleedOut = 159,
	EDBDScoreTypes__DBDCamperScore_DieKill = 160,
	EDBDScoreTypes__DBDPlayerScore_EndGame = 161,
	EDBDScoreTypes__DBDPlayerScore_EnterParadise = 162,
	EDBDScoreTypes__DBDSlasherScore_CamperHookedFirstTime = 163,
	EDBDScoreTypes__DBDSlasherScore_CamperEnterHookStrugglePhase = 164,
	EDBDScoreTypes__DBDSlasherScore_ElectroShockSurvivor = 165,
	EDBDScoreTypes__DBDSlasherScore_BringAllSurvivorsToMadnessTier3 = 166,
	EDBDScoreTypes__DBDSlasherScore_BringSurvivorUpOneMadnessTier = 167,
	EDBDScoreTypes__DBDSlasherScore_HitSurvivorAfterElectroShock = 168,
	EDBDScoreTypes__DBDSlasherScore_PickupCamper = 169,
	EDBDScoreTypes__DBDSlasherScore_Blink = 170,
	EDBDScoreTypes__DBDSlasherScore_TeleportToPhantomTrap = 171,
	EDBDScoreTypes__DBDSlasherScore_HatchetThrow = 172,
	EDBDScoreTypes__DBDSlasherScore_HatchetHit = 173,
	EDBDScoreTypes__DBDSlasherScore_HatchetSkillShotHit = 174,
	EDBDScoreTypes__DBDSlasherScore_HatchetFarHit = 175,
	EDBDScoreTypes__DBDCamperScore_QuickVault = 176,
	EDBDScoreTypes__DBDCamperScore_QuickCloset = 177,
	EDBDScoreTypes__DBDCamperScore_StartGeneratorRepair = 178,
	EDBDScoreTypes__DBDCamperScore_StartCleansingTotem = 179,
	EDBDScoreTypes__DBDCamperScore_FirstRepairSkillCheck = 180,
	EDBDScoreTypes__DBDSlasherScore_CamperDisconnectedBeforeMatchStart = 181,
	EDBDScoreTypes__DBDSlasherScore_CamperDisconnectedDuringMatch = 182,
	EDBDScoreTypes__DBDCamperScore_NearFriendInNeed_GeneratorsComplete = 183,
	EDBDScoreTypes__DBDCamperScore_HealPercent_GeneratorsComplete = 184,
	EDBDScoreTypes__DBDCamperScore_HealFromDying_GeneratorsComplete = 185,
	EDBDScoreTypes__DBDCamperScore_SaveFromHook_GeneratorsComplete = 186,
	EDBDScoreTypes__DBDCamperScore_SaveFromBearTrap_GeneratorsComplete = 187,
	EDBDScoreTypes__DBDCamperScore_SnapOutOfIt = 188,
	EDBDScoreTypes__DBDSlasherScore_HookInBasement = 189,
	EDBDScoreTypes__DBDSlasherScore_LFChainsawHit = 190,
	EDBDScoreTypes__DBDCamperScore_PalletDrop = 191,
	EDBDScoreTypes__DBDCamperScore_Vault = 192,
	EDBDScoreTypes__DBDSlasherScore_StartChaseWithChainsawAttack = 193,
	EDBDScoreTypes__DBDSlasherScore_MissedAttackInChase = 194,
	EDBDScoreTypes__DBDCamperScore_DodgeAndVault = 195,
	EDBDScoreTypes__DBDCamperScore_BeginQuickVault = 196,
	EDBDScoreTypes__DBDSlasherScore_StartChainsawAttack = 197,
	EDBDScoreTypes__DBDCamperScore_WakeUpBySkillCheck = 198,
	EDBDScoreTypes__DBDCamperScore_FallAsleep = 199,
	EDBDScoreTypes__DBDCamperScore_WakeUpSelf = 200,
	EDBDScoreTypes__DBDCamperScore_WakeUpOther = 201,
	EDBDScoreTypes__DBDSlasherScore_RecentlyAsleepAttack = 202,
	EDBDScoreTypes__DBDSlasherScore_SurvivorPartyOnBasementHooks = 203,
	EDBDScoreTypes__DBDCamperScore_LootBasementChest = 204,
	EDBDScoreTypes__DBDPlayerScore_OpenMysteryBox = 205,
	EDBDScoreTypes__DBDGameEvent_SurvivorDowned = 206,
	EDBDScoreTypes__DBDGameEvent_SurvivorDied = 207,
	EDBDScoreTypes__DBDGameEvent_KillerCloak = 208,
	EDBDScoreTypes__DBDSlasherScore_SetReverseBearTrap = 209,
	EDBDScoreTypes__DBDSlasherScore_AbductionDash = 210,
	EDBDScoreTypes__DBDSlasherScore_DashHitSuccess = 211,
	EDBDScoreTypes__DBDSlasherScore_KillWithReverseBearTrap = 212,
	EDBDScoreTypes__DBDCamperScore_SearchRBTKey = 213,
	EDBDScoreTypes__DBDCamperScore_EscapeRBT = 214,
	EDBDScoreTypes__DBDGameEvent_ReplacedGoodSkillCheckAsGreat = 215,
	EDBDScoreTypes__DBDCamperScore_RemoveReverseBearTrapSkillCheckSuccess = 216,
	EDBDScoreTypes__DBDCamperScore_RemoveReverseBearTrapSkillCheckBonus = 217,
	EDBDScoreTypes__DBDSlasherScore_DamageGeneratorWhileHooked = 218,
	EDBDScoreTypes__DBDGameEvent_SurvivorDamaged = 219,
	EDBDScoreTypes__DBDGameEvent_SurvivorHealed = 220,
	EDBDScoreTypes__DBDGameEvent_Interruption = 221,
	EDBDScoreTypes__DBDGameEvent_SurvivorFailedHealSkillcheck = 222,
	EDBDScoreTypes__DBDGameEvent_HookedSurvivorSacrificeBegin = 223,
	EDBDScoreTypes__DBDGameEvent_AcquireEventKillerCoin = 224,
	EDBDScoreTypes__DBDGameEvent_AcquireEventSurvivorCoin = 225,
	EDBDScoreTypes__DBDCamperScore_EventGeneratorFixed = 226,
	EDBDScoreTypes__DBDSlasherScore_HookedOnEventHook = 227,
	EDBDScoreTypes__DBDGameEvent_GeneratorProgress = 228,
	EDBDScoreTypes__DBDSlasherScore_DownSmokedCamper = 229,
	EDBDScoreTypes__DBDSlasherScore_HitSmokedCamper = 230,
	EDBDScoreTypes__DBDSlasherScore_SurvivorEnterGasCloud = 231,
	EDBDScoreTypes__DBDSlasherScore_BombDirectHit = 232,
	EDBDScoreTypes__DBDSlasherScore_ThrowBomb = 233,
	EDBDScoreTypes__DBDGameEvent_CoopAction = 234,
	EDBDScoreTypes__DBDSlasherScore_StartActivePhaseWalk = 235,
	EDBDScoreTypes__DBDScore_Count = 236,
	EDBDScoreTypes__Count          = 237,
	EDBDScoreTypes__EDBDScoreTypes_MAX = 238,

};

// Enum DeadByDaylight.EDBDCameraSocketID
enum class DeadByDaylight_EDBDCameraSocketID : uint8_t
{
	EDBDCameraSocketID__VE_None    = 0,
	EDBDCameraSocketID__VE_Default = 1,
	EDBDCameraSocketID__VE_Killcam = 2,
	EDBDCameraSocketID__VE_Reaction = 3,
	EDBDCameraSocketID__VE_Struggle = 4,
	EDBDCameraSocketID__VE_Sacrifice = 5,
	EDBDCameraSocketID__VE_MAX     = 6,

};

// Enum DeadByDaylight.ECharacterStance
enum class DeadByDaylight_ECharacterStance : uint8_t
{
	ECharacterStance__VE_Stand     = 0,
	ECharacterStance__VE_Crouch    = 1,
	ECharacterStance__VE_Crawl     = 2,
	ECharacterStance__VE_MAX       = 3,

};

// Enum DeadByDaylight.EAuthoritativeMovementFlag
enum class DeadByDaylight_EAuthoritativeMovementFlag : uint8_t
{
	EAuthoritativeMovementFlag__INTERACTION = 0,
	EAuthoritativeMovementFlag__SLASHED = 1,
	EAuthoritativeMovementFlag__CHEAT = 2,
	EAuthoritativeMovementFlag__DROPPED = 3,
	EAuthoritativeMovementFlag__NOPUSH = 4,
	EAuthoritativeMovementFlag__INTERACTIONNOPUSH = 5,
	EAuthoritativeMovementFlag__DREAMWORLD_NOSLASHERCOLLISION = 6,
	EAuthoritativeMovementFlag__COUNT = 7,
	EAuthoritativeMovementFlag__EAuthoritativeMovementFlag_MAX = 8,

};

// Enum DeadByDaylight.ECustomizationCategory
enum class DeadByDaylight_ECustomizationCategory : uint8_t
{
	ECustomizationCategory__None   = 0,
	ECustomizationCategory__SurvivorHead = 1,
	ECustomizationCategory__SurvivorTorso = 2,
	ECustomizationCategory__SurvivorLegs = 3,
	ECustomizationCategory__KillerHead = 4,
	ECustomizationCategory__KillerBody = 5,
	ECustomizationCategory__KillerWeapon = 6,
	ECustomizationCategory__Outfits = 7,
	ECustomizationCategory__Charm  = 8,
	ECustomizationCategory__ECustomizationCategory_MAX = 9,

};

// Enum DeadByDaylight.EInventoryItemType
enum class DeadByDaylight_EInventoryItemType : uint8_t
{
	EInventoryItemType__None       = 0,
	EInventoryItemType__Item       = 1,
	EInventoryItemType__ItemAddOn  = 2,
	EInventoryItemType__CamperPerk = 3,
	EInventoryItemType__Power      = 4,
	EInventoryItemType__PowerAddOn = 5,
	EInventoryItemType__SlasherPerk = 6,
	EInventoryItemType__Favor      = 7,
	EInventoryItemType__Customization = 8,
	EInventoryItemType__IridescentShardsPack = 9,
	EInventoryItemType__AuricCellsPack = 10,
	EInventoryItemType__BloodPointsPack = 11,
	EInventoryItemType__FreeTicket = 12,
	EInventoryItemType__Chest      = 13,
	EInventoryItemType__SuperChest = 14,
	EInventoryItemType__EntityBox  = 15,
	EInventoryItemType__Count      = 16,
	EInventoryItemType__EInventoryItemType_MAX = 17,

};

// Enum DeadByDaylight.EOfferingCategory
enum class DeadByDaylight_EOfferingCategory : uint8_t
{
	EOfferingCategory__None        = 0,
	EOfferingCategory__Bloodpoints = 1,
	EOfferingCategory__Mapmods     = 2,
	EOfferingCategory__Realms      = 3,
	EOfferingCategory__Shrouds     = 4,
	EOfferingCategory__Wards       = 5,
	EOfferingCategory__CharacterXP = 6,
	EOfferingCategory__Luck        = 7,
	EOfferingCategory__Moris       = 8,
	EOfferingCategory__EOfferingCategory_MAX = 9,

};

// Enum DeadByDaylight.EPerkCategory
enum class DeadByDaylight_EPerkCategory : uint8_t
{
	EPerkCategory__None            = 0,
	EPerkCategory__Navigation      = 1,
	EPerkCategory__Perception      = 2,
	EPerkCategory__Safeguard       = 3,
	EPerkCategory__Concealment     = 4,
	EPerkCategory__Strategy        = 5,
	EPerkCategory__Support         = 6,
	EPerkCategory__Adaptation      = 7,
	EPerkCategory__Chasing         = 8,
	EPerkCategory__Tracking        = 9,
	EPerkCategory__Cruelty         = 10,
	EPerkCategory__Trickery        = 11,
	EPerkCategory__Obstruction     = 12,
	EPerkCategory__Hinderance      = 13,
	EPerkCategory__Enhancement     = 14,
	EPerkCategory__EPerkCategory_MAX = 15,

};

// Enum DeadByDaylight.ELoadoutSlot
enum class DeadByDaylight_ELoadoutSlot : uint8_t
{
	ELoadoutSlot__SKIN             = 0,
	ELoadoutSlot__ITEM_POWER       = 1,
	ELoadoutSlot__ADD_ON           = 2,
	ELoadoutSlot__ADD_ON01         = 3,
	ELoadoutSlot__PERK             = 4,
	ELoadoutSlot__PERK01           = 5,
	ELoadoutSlot__PERK02           = 6,
	ELoadoutSlot__PERK03           = 7,
	ELoadoutSlot__FAVOR            = 8,
	ELoadoutSlot__ELoadoutSlot_MAX = 9,

};

// Enum DeadByDaylight.ETeachableStatus
enum class DeadByDaylight_ETeachableStatus : uint8_t
{
	ETeachableStatus__Unknown      = 0,
	ETeachableStatus__Locked       = 1,
	ETeachableStatus__AvailableInBloodWeb = 2,
	ETeachableStatus__AvailableInShrine = 3,
	ETeachableStatus__Acquired     = 4,
	ETeachableStatus__ETeachableStatus_MAX = 5,

};

// Enum DeadByDaylight.EEmblemQuality
enum class DeadByDaylight_EEmblemQuality : uint8_t
{
	EEmblemQuality__None           = 0,
	EEmblemQuality__Bronze         = 1,
	EEmblemQuality__Silver         = 2,
	EEmblemQuality__Gold           = 3,
	EEmblemQuality__Iridescent     = 4,
	EEmblemQuality__Count          = 5,
	EEmblemQuality__EEmblemQuality_MAX = 6,

};

// Enum DeadByDaylight.EEndGameReason
enum class DeadByDaylight_EEndGameReason : uint8_t
{
	EEndGameReason__None           = 0,
	EEndGameReason__Normal         = 1,
	EEndGameReason__KillerLeft     = 2,
	EEndGameReason__PlayerLeftDuringLoading = 3,
	EEndGameReason__KillerLeftEarly = 4,
	EEndGameReason__InvalidPlayerRoles = 5,
	EEndGameReason__LoadingTimeout = 6,
	EEndGameReason__EEndGameReason_MAX = 7,

};

// Enum DeadByDaylight.ETileSpawnPointType
enum class DeadByDaylight_ETileSpawnPointType : uint8_t
{
	ETileSpawnPointType__Unspecified = 0,
	ETileSpawnPointType__Survivor  = 1,
	ETileSpawnPointType__SurvivorItem = 2,
	ETileSpawnPointType__Killer    = 3,
	ETileSpawnPointType__KillerItem = 4,
	ETileSpawnPointType__InteractableObject = 5,
	ETileSpawnPointType__Count     = 6,
	ETileSpawnPointType__ETileSpawnPointType_MAX = 7,

};

// Enum DeadByDaylight.EGameplayMode
enum class DeadByDaylight_EGameplayMode : uint8_t
{
	EGameplayMode__Ranked          = 0,
	EGameplayMode__TrainingVersusBots = 1,
	EGameplayMode__CustomGame      = 2,
	EGameplayMode__None            = 3,
	EGameplayMode__EGameplayMode_MAX = 4,

};

// Enum DeadByDaylight.ECamperDamageState
enum class DeadByDaylight_ECamperDamageState : uint8_t
{
	ECamperDamageState__VE_Healthy = 0,
	ECamperDamageState__VE_Injured = 1,
	ECamperDamageState__VE_KO      = 2,
	ECamperDamageState__VE_Dead    = 3,
	ECamperDamageState__VE_MAX     = 4,

};

// Enum DeadByDaylight.ECamperImmobilizeState
enum class DeadByDaylight_ECamperImmobilizeState : uint8_t
{
	ECamperImmobilizeState__VE_None = 0,
	ECamperImmobilizeState__VE_Hooked = 1,
	ECamperImmobilizeState__VE_Trapped = 2,
	ECamperImmobilizeState__VE_Hiding = 3,
	ECamperImmobilizeState__VE_Dead = 4,
	ECamperImmobilizeState__VE_InDeathBed = 5,
	ECamperImmobilizeState__VE_MAX = 6,

};

// Enum DeadByDaylight.EAttackZoneSet
enum class DeadByDaylight_EAttackZoneSet : uint8_t
{
	EAttackZoneSet__VE_OriginalZones = 0,
	EAttackZoneSet__VE_WedgeZones  = 1,
	EAttackZoneSet__VE_MAX         = 2,

};

// Enum DeadByDaylight.ESlasherGuidedAction
enum class DeadByDaylight_ESlasherGuidedAction : uint8_t
{
	ESlasherGuidedAction__VE_None  = 0,
	ESlasherGuidedAction__VE_Hooking = 1,
	ESlasherGuidedAction__VE_PickingUp = 2,
	ESlasherGuidedAction__VE_PuttingDown = 3,
	ESlasherGuidedAction__VE_MAX   = 4,

};

// Enum DeadByDaylight.ETutorialStep
enum class DeadByDaylight_ETutorialStep : uint8_t
{
	ETutorialStep__Survivor_NotStarted = 0,
	ETutorialStep__Survivor_CompleteGenerator = 1,
	ETutorialStep__Survivor_EvadeKiller = 2,
	ETutorialStep__Survivor_OnHook = 3,
	ETutorialStep__Done            = 4,
	ETutorialStep__Invalid         = 5,
	ETutorialStep__ETutorialStep_MAX = 6,

};

// Enum DeadByDaylight.ELanternState
enum class DeadByDaylight_ELanternState : uint8_t
{
	ELanternState__Collectable     = 0,
	ELanternState__Collected       = 1,
	ELanternState__Destroyed       = 2,
	ELanternState__Destroyable     = 3,
	ELanternState__ELanternState_MAX = 4,

};

// Enum DeadByDaylight.EHitValidatorConfigName
enum class DeadByDaylight_EHitValidatorConfigName : uint8_t
{
	EHitValidatorConfigName__Default = 0,
	EHitValidatorConfigName__Hatchet = 1,
	EHitValidatorConfigName__Bomb  = 2,
	EHitValidatorConfigName__Harpoon = 3,
	EHitValidatorConfigName__Oni   = 4,
	EHitValidatorConfigName__Whip  = 5,
	EHitValidatorConfigName__DefaultProjectile = 6,
	EHitValidatorConfigName__EHitValidatorConfigName_MAX = 7,

};

// Enum DeadByDaylight.EGhostStealthState
enum class DeadByDaylight_EGhostStealthState : uint8_t
{
	EGhostStealthState__AWAITING_ACTIVATION = 0,
	EGhostStealthState__ACTIVATED  = 1,
	EGhostStealthState__COOLDOWN   = 2,
	EGhostStealthState__EGhostStealthState_MAX = 3,

};

// Enum DeadByDaylight.EAudioCustomizationCategory
enum class DeadByDaylight_EAudioCustomizationCategory : uint8_t
{
	EAudioCustomizationCategory__AudioCharacterName = 0,
	EAudioCustomizationCategory__AudioCharacterSubName = 1,
	EAudioCustomizationCategory__AudioCharacterHead = 2,
	EAudioCustomizationCategory__AudioCharacterClothes = 3,
	EAudioCustomizationCategory__AudioCharacterShoes = 4,
	EAudioCustomizationCategory__AudioCharacterWeapon = 5,
	EAudioCustomizationCategory__AudioCharacterAmbiance = 6,
	EAudioCustomizationCategory__AudioCharacterState = 7,
	EAudioCustomizationCategory__EAudioCustomizationCategory_MAX = 8,

};

// Enum DeadByDaylight.EActionButtonState
enum class DeadByDaylight_EActionButtonState : uint8_t
{
	EActionButtonState__Normal     = 0,
	EActionButtonState__Toggled    = 1,
	EActionButtonState__Disabled   = 2,
	EActionButtonState__Hidden     = 3,
	EActionButtonState__EActionButtonState_MAX = 4,

};

// Enum DeadByDaylight.EKnowledgeSharingType
enum class DeadByDaylight_EKnowledgeSharingType : uint8_t
{
	EKnowledgeSharingType__Possessor = 0,
	EKnowledgeSharingType__Survivors = 1,
	EKnowledgeSharingType__Killers = 2,
	EKnowledgeSharingType__All     = 3,
	EKnowledgeSharingType__EKnowledgeSharingType_MAX = 4,

};

// Enum DeadByDaylight.EGameplayElementType
enum class DeadByDaylight_EGameplayElementType : uint8_t
{
	EGameplayElementType__Generic  = 0,
	EGameplayElementType__MeatLocker_Small = 1,
	EGameplayElementType__TileLights = 2,
	EGameplayElementType__MeatLocker_Big = 3,
	EGameplayElementType__Searchable = 4,
	EGameplayElementType__EdgeObjects = 5,
	EGameplayElementType__LivingWorldObjects = 6,
	EGameplayElementType__Hatch    = 7,
	EGameplayElementType__Bookshelves = 8,
	EGameplayElementType__Totems   = 9,
	EGameplayElementType__QuadrantSpawn = 10,
	EGameplayElementType__EdgeObjectsBlocker = 11,
	EGameplayElementType__BreakableWalls = 12,
	EGameplayElementType__Escape   = 13,
	EGameplayElementType__Count    = 14,
	EGameplayElementType__EGameplayElementType_MAX = 15,

};

// Enum DeadByDaylight.EAIHideInLockerState
enum class DeadByDaylight_EAIHideInLockerState : uint8_t
{
	EAIHideInLockerState__WalkToLocker = 0,
	EAIHideInLockerState__GetIntoLocker = 1,
	EAIHideInLockerState__HidingInLocker = 2,
	EAIHideInLockerState__EAIHideInLockerState_MAX = 3,

};

// Enum DeadByDaylight.EAIRepairGeneratorState
enum class DeadByDaylight_EAIRepairGeneratorState : uint8_t
{
	EAIRepairGeneratorState__FindAvailableGeneratorPosition = 0,
	EAIRepairGeneratorState__WalkToGenerator = 1,
	EAIRepairGeneratorState__RotateTowardsGenerator = 2,
	EAIRepairGeneratorState__BeginGeneratorRepairs = 3,
	EAIRepairGeneratorState__RepairingGenerator = 4,
	EAIRepairGeneratorState__EAIRepairGeneratorState_MAX = 5,

};

// Enum DeadByDaylight.EArchivesTab
enum class DeadByDaylight_EArchivesTab : uint8_t
{
	EArchivesTab__EventStory       = 0,
	EArchivesTab__CurrentStory     = 1,
	EArchivesTab__Rewards          = 2,
	EArchivesTab__PastStories      = 3,
	EArchivesTab__TabCount         = 4,
	EArchivesTab__EArchivesTab_MAX = 5,

};

// Enum DeadByDaylight.EArchiveNodeType
enum class DeadByDaylight_EArchiveNodeType : uint8_t
{
	EArchiveNodeType__Narrative    = 0,
	EArchiveNodeType__Task         = 1,
	EArchiveNodeType__Challenge    = 2,
	EArchiveNodeType__Contextual   = 3,
	EArchiveNodeType__Reward       = 4,
	EArchiveNodeType__None         = 5,
	EArchiveNodeType__EArchiveNodeType_MAX = 6,

};

// Enum DeadByDaylight.EArchiveNodeStatus
enum class DeadByDaylight_EArchiveNodeStatus : uint8_t
{
	EArchiveNodeStatus__Closed     = 0,
	EArchiveNodeStatus__Completed  = 1,
	EArchiveNodeStatus__Open       = 2,
	EArchiveNodeStatus__Paused     = 3,
	EArchiveNodeStatus__Waiting    = 4,
	EArchiveNodeStatus__Error      = 5,
	EArchiveNodeStatus__EArchiveNodeStatus_MAX = 6,

};

// Enum DeadByDaylight.EOwnershipBehaviour
enum class DeadByDaylight_EOwnershipBehaviour : uint8_t
{
	EOwnershipBehaviour__Personal  = 0,
	EOwnershipBehaviour__Shared    = 1,
	EOwnershipBehaviour__EOwnershipBehaviour_MAX = 2,

};

// Enum DeadByDaylight.EStackingBehaviours
enum class DeadByDaylight_EStackingBehaviours : uint8_t
{
	EStackingBehaviours__Stackable = 0,
	EStackingBehaviours__Override  = 1,
	EStackingBehaviours__EStackingBehaviours_MAX = 2,

};

// Enum DeadByDaylight.EAdditiveBehaviour
enum class DeadByDaylight_EAdditiveBehaviour : uint8_t
{
	EAdditiveBehaviour__AddValues  = 0,
	EAdditiveBehaviour__MaxValue   = 1,
	EAdditiveBehaviour__EAdditiveBehaviour_MAX = 2,

};

// Enum DeadByDaylight.EContextualType
enum class DeadByDaylight_EContextualType : uint8_t
{
	EContextualType__None          = 0,
	EContextualType__RedGlyph      = 1,
	EContextualType__BlueGlyph     = 2,
	EContextualType__YellowGlyph   = 3,
	EContextualType__PurpleGlyph   = 4,
	EContextualType__GlyphUpperBound = 5,
	EContextualType__ToxinPlantHalloween2020 = 6,
	EContextualType__PumpkinHalloween2021 = 7,
	EContextualType__EContextualType_MAX = 8,

};

// Enum DeadByDaylight.EArchiveStoryType
enum class DeadByDaylight_EArchiveStoryType : uint8_t
{
	EArchiveStoryType__NotSet      = 0,
	EArchiveStoryType__CurrentStory = 1,
	EArchiveStoryType__PastStory   = 2,
	EArchiveStoryType__EventStory  = 3,
	EArchiveStoryType__EArchiveStoryType_MAX = 4,

};

// Enum DeadByDaylight.EArm
enum class DeadByDaylight_EArm : uint8_t
{
	EArm__Left                     = 0,
	EArm__Right                    = 1,
	EArm__EArm_MAX                 = 2,

};

// Enum DeadByDaylight.EAtlantaControlTypeSetting
enum class DeadByDaylight_EAtlantaControlTypeSetting : uint8_t
{
	EAtlantaControlTypeSetting__CameraFullScreen = 0,
	EAtlantaControlTypeSetting__SnapOnJoystick = 1,
	EAtlantaControlTypeSetting__EAtlantaControlTypeSetting_MAX = 2,

};

// Enum DeadByDaylight.EDeepLinkUid
enum class DeadByDaylight_EDeepLinkUid : uint8_t
{
	EDeepLinkUid__NONE             = 0,
	EDeepLinkUid__StorefrontSpecialOffers = 1,
	EDeepLinkUid__StorefrontFeatured = 2,
	EDeepLinkUid__StorefrontPremium = 3,
	EDeepLinkUid__StorefrontSubscription = 4,
	EDeepLinkUid__Calendar         = 5,
	EDeepLinkUid__RitualsStarter   = 6,
	EDeepLinkUid__RitualsDaily     = 7,
	EDeepLinkUid__RitualsWeekly    = 8,
	EDeepLinkUid__MenuCharactersSurvivors = 9,
	EDeepLinkUid__MenuCharactersKillers = 10,
	EDeepLinkUid__MenuCustomizations = 11,
	EDeepLinkUid__MenuEvents       = 12,
	EDeepLinkUid__MenuFriends      = 13,
	EDeepLinkUid__Loadout          = 14,
	EDeepLinkUid__BloodmarketSurvivors = 15,
	EDeepLinkUid__BloodmarketKillers = 16,
	EDeepLinkUid__External         = 17,
	EDeepLinkUid__EDeepLinkUid_MAX = 18,

};

// Enum DeadByDaylight.EAtlantaDisplayStandPosition
enum class DeadByDaylight_EAtlantaDisplayStandPosition : uint8_t
{
	EAtlantaDisplayStandPosition__Forefront = 0,
	EAtlantaDisplayStandPosition__Background = 1,
	EAtlantaDisplayStandPosition__EAtlantaDisplayStandPosition_MAX = 2,

};

// Enum DeadByDaylight.EEventsType
enum class DeadByDaylight_EEventsType : uint8_t
{
	EEventsType__Generic           = 0,
	EEventsType__Calendar          = 1,
	EEventsType__BonusACEvent      = 2,
	EEventsType__FirstPremiumPurchase = 3,
	EEventsType__MonthlyPass       = 4,
	EEventsType__Count             = 5,
	EEventsType__EEventsType_MAX   = 6,

};

// Enum DeadByDaylight.EFreeTicketButtonState
enum class DeadByDaylight_EFreeTicketButtonState : uint8_t
{
	EFreeTicketButtonState__Disabled = 0,
	EFreeTicketButtonState__Enabled = 1,
	EFreeTicketButtonState__InEffect = 2,
	EFreeTicketButtonState__None   = 3,
	EFreeTicketButtonState__EFreeTicketButtonState_MAX = 4,

};

// Enum DeadByDaylight.EQuitGameReason
enum class DeadByDaylight_EQuitGameReason : uint8_t
{
	EQuitGameReason__None          = 0,
	EQuitGameReason__Logout        = 1,
	EQuitGameReason__Suspend       = 2,
	EQuitGameReason__Shutdown      = 3,
	EQuitGameReason__Count         = 4,
	EQuitGameReason__EQuitGameReason_MAX = 5,

};

// Enum DeadByDaylight.EFrameRateLimitButtonSetting
enum class DeadByDaylight_EFrameRateLimitButtonSetting : uint8_t
{
	EFrameRateLimitButtonSetting__ThirtyFPS = 0,
	EFrameRateLimitButtonSetting__SixtyFPS = 1,
	EFrameRateLimitButtonSetting__EFrameRateLimitButtonSetting_MAX = 2,

};

// Enum DeadByDaylight.EKillerSoundComparisonType
enum class DeadByDaylight_EKillerSoundComparisonType : uint8_t
{
	EKillerSoundComparisonType__Equal = 0,
	EKillerSoundComparisonType__IsGreaterThan = 1,
	EKillerSoundComparisonType__IsLesserThan = 2,
	EKillerSoundComparisonType__EKillerSoundComparisonType_MAX = 3,

};

// Enum DeadByDaylight.EMobileLoginAuthContext
enum class DeadByDaylight_EMobileLoginAuthContext : uint8_t
{
	EMobileLoginAuthContext__Splash = 0,
	EMobileLoginAuthContext__OverlayMenu = 1,
	EMobileLoginAuthContext__ResumeFromSuspend = 2,
	EMobileLoginAuthContext__EMobileLoginAuthContext_MAX = 3,

};

// Enum DeadByDaylight.EAtlantaRewardType
enum class DeadByDaylight_EAtlantaRewardType : uint8_t
{
	EAtlantaRewardType__Item       = 0,
	EAtlantaRewardType__AddOn      = 1,
	EAtlantaRewardType__Offering   = 2,
	EAtlantaRewardType__BloodPoints = 3,
	EAtlantaRewardType__IridescentShards = 4,
	EAtlantaRewardType__AuricCells = 5,
	EAtlantaRewardType__Customization = 6,
	EAtlantaRewardType__FreeTicket = 7,
	EAtlantaRewardType__MysteryBox = 8,
	EAtlantaRewardType__Character  = 9,
	EAtlantaRewardType__DuplicatesRefundKey = 10,
	EAtlantaRewardType__Count      = 11,
	EAtlantaRewardType__EAtlantaRewardType_MAX = 12,

};

// Enum DeadByDaylight.EAtlantaRitualRewardUIType
enum class DeadByDaylight_EAtlantaRitualRewardUIType : uint8_t
{
	EAtlantaRitualRewardUIType__Item = 0,
	EAtlantaRitualRewardUIType__AddOn = 1,
	EAtlantaRitualRewardUIType__Offering = 2,
	EAtlantaRitualRewardUIType__BloodPoints = 3,
	EAtlantaRitualRewardUIType__IridescentShards = 4,
	EAtlantaRitualRewardUIType__AuricCells = 5,
	EAtlantaRitualRewardUIType__Customization = 6,
	EAtlantaRitualRewardUIType__CustoTicket = 7,
	EAtlantaRitualRewardUIType__MysteryBox = 8,
	EAtlantaRitualRewardUIType__EAtlantaRitualRewardUIType_MAX = 9,

};

// Enum DeadByDaylight.EAltantaRitualUIType
enum class DeadByDaylight_EAltantaRitualUIType : uint8_t
{
	EAltantaRitualUIType__Single   = 0,
	EAltantaRitualUIType__Master   = 1,
	EAltantaRitualUIType__Special  = 2,
	EAltantaRitualUIType__EAltantaRitualUIType_MAX = 3,

};

// Enum DeadByDaylight.EAtlantaTutorialRewardPopupState
enum class DeadByDaylight_EAtlantaTutorialRewardPopupState : uint8_t
{
	EAtlantaTutorialRewardPopupState__Starting = 0,
	EAtlantaTutorialRewardPopupState__Skipped = 1,
	EAtlantaTutorialRewardPopupState__Done = 2,
	EAtlantaTutorialRewardPopupState__EAtlantaTutorialRewardPopupState_MAX = 3,

};

// Enum DeadByDaylight.EAttackEventType
enum class DeadByDaylight_EAttackEventType : uint8_t
{
	EAttackEventType__VE_None      = 0,
	EAttackEventType__VE_BasicAttackAttempt = 1,
	EAttackEventType__VE_BasicAttackHit = 2,
	EAttackEventType__VE_SpecialAttackAttempt = 3,
	EAttackEventType__VE_SpecialAttackHit = 4,
	EAttackEventType__VE_MAX       = 5,

};

// Enum DeadByDaylight.EBlinkerState
enum class DeadByDaylight_EBlinkerState : uint8_t
{
	EBlinkerState__VE_Ready        = 0,
	EBlinkerState__VE_ChainBlink   = 1,
	EBlinkerState__VE_AttackBlink  = 2,
	EBlinkerState__VE_CooldownRequested = 3,
	EBlinkerState__VE_Cooldown     = 4,
	EBlinkerState__VE_MAX          = 5,

};

// Enum DeadByDaylight.EBPBonusType
enum class DeadByDaylight_EBPBonusType : uint8_t
{
	EBPBonusType__None             = 0,
	EBPBonusType__Event            = 1,
	EBPBonusType__Offerings        = 2,
	EBPBonusType__EBPBonusType_MAX = 3,

};

// Enum DeadByDaylight.EBloodchestType
enum class DeadByDaylight_EBloodchestType : uint8_t
{
	EBloodchestType__None          = 0,
	EBloodchestType__Chest         = 1,
	EBloodchestType__SuperChests   = 2,
	EBloodchestType__EntityBox     = 3,
	EBloodchestType__EBloodchestType_MAX = 4,

};

// Enum DeadByDaylight.EBloodwebFillingMethod
enum class DeadByDaylight_EBloodwebFillingMethod : uint8_t
{
	EBloodwebFillingMethod__RestrictionsBasedOnData = 0,
	EBloodwebFillingMethod__FillAll = 1,
	EBloodwebFillingMethod__EBloodwebFillingMethod_MAX = 2,

};

// Enum DeadByDaylight.EBloodMarketRefreshMethod
enum class DeadByDaylight_EBloodMarketRefreshMethod : uint8_t
{
	EBloodMarketRefreshMethod__Automatic = 0,
	EBloodMarketRefreshMethod__Manual = 1,
	EBloodMarketRefreshMethod__EBloodMarketRefreshMethod_MAX = 2,

};

// Enum DeadByDaylight.EBloodwebDefinitionContentType
enum class DeadByDaylight_EBloodwebDefinitionContentType : uint8_t
{
	EBloodwebDefinitionContentType__Empty = 0,
	EBloodwebDefinitionContentType__Nodes = 1,
	EBloodwebDefinitionContentType__Paths = 2,
	EBloodwebDefinitionContentType__NodesAndPaths = 3,
	EBloodwebDefinitionContentType__NodesNoPath = 4,
	EBloodwebDefinitionContentType__EBloodwebDefinitionContentType_MAX = 5,

};

// Enum DeadByDaylight.EBloodwebDistributionType
enum class DeadByDaylight_EBloodwebDistributionType : uint8_t
{
	EBloodwebDistributionType__PerWeb = 0,
	EBloodwebDistributionType__PerRing = 1,
	EBloodwebDistributionType__EBloodwebDistributionType_MAX = 2,

};

// Enum DeadByDaylight.EBloodwebDataSource
enum class DeadByDaylight_EBloodwebDataSource : uint8_t
{
	EBloodwebDataSource__ByLevel   = 0,
	EBloodwebDataSource__ByRing    = 1,
	EBloodwebDataSource__EBloodwebDataSource_MAX = 2,

};

// Enum DeadByDaylight.EBloodwebSaveReason
enum class DeadByDaylight_EBloodwebSaveReason : uint8_t
{
	EBloodwebSaveReason__PayToRefresh = 0,
	EBloodwebSaveReason__PrestigeUp = 1,
	EBloodwebSaveReason__ShouldRebuild = 2,
	EBloodwebSaveReason__Cheat     = 3,
	EBloodwebSaveReason__EBloodwebSaveReason_MAX = 4,

};

// Enum DeadByDaylight.EBloodwebNodeGateTypes
enum class DeadByDaylight_EBloodwebNodeGateTypes : uint8_t
{
	EBloodwebNodeGateTypes__RequiredRank = 0,
	EBloodwebNodeGateTypes__RequiredItem = 1,
	EBloodwebNodeGateTypes__Count  = 2,
	EBloodwebNodeGateTypes__EBloodwebNodeGateTypes_MAX = 3,

};

// Enum DeadByDaylight.EBloodwebNodeContentType
enum class DeadByDaylight_EBloodwebNodeContentType : uint8_t
{
	EBloodwebNodeContentType__Empty = 0,
	EBloodwebNodeContentType__Perks = 1,
	EBloodwebNodeContentType__PerkBuffs_Do_Not_Use_Deprecated = 2,
	EBloodwebNodeContentType__Offerings = 3,
	EBloodwebNodeContentType__Items = 4,
	EBloodwebNodeContentType__AddOn = 5,
	EBloodwebNodeContentType__Chests = 6,
	EBloodwebNodeContentType__PerksPacks = 7,
	EBloodwebNodeContentType__IridiscentShards = 8,
	EBloodwebNodeContentType__AuricCells = 9,
	EBloodwebNodeContentType__SuperChests = 10,
	EBloodwebNodeContentType__CosmeticItems = 11,
	EBloodwebNodeContentType__Bloodpoints = 12,
	EBloodwebNodeContentType__FreeTicket = 13,
	EBloodwebNodeContentType__EntityBox = 14,
	EBloodwebNodeContentType__Count = 15,
	EBloodwebNodeContentType__EBloodwebNodeContentType_MAX = 16,

};

// Enum DeadByDaylight.EBloodwebNodeState
enum class DeadByDaylight_EBloodwebNodeState : uint8_t
{
	EBloodwebNodeState__Inactive   = 0,
	EBloodwebNodeState__Available  = 1,
	EBloodwebNodeState__Locked_Do_Not_Use_Deprecated = 2,
	EBloodwebNodeState__Collected  = 3,
	EBloodwebNodeState__Consumed   = 4,
	EBloodwebNodeState__Count      = 5,
	EBloodwebNodeState__EBloodwebNodeState_MAX = 6,

};

// Enum DeadByDaylight.EBloodwebRing
enum class DeadByDaylight_EBloodwebRing : uint8_t
{
	EBloodwebRing__CenterRing      = 0,
	EBloodwebRing__InnerRing       = 1,
	EBloodwebRing__MiddleRing      = 2,
	EBloodwebRing__OuterRing       = 3,
	EBloodwebRing__EntityRing      = 4,
	EBloodwebRing__RingCount       = 5,
	EBloodwebRing__Count           = 6,
	EBloodwebRing__EBloodwebRing_MAX = 7,

};

// Enum DeadByDaylight.EBreakableState
enum class DeadByDaylight_EBreakableState : uint8_t
{
	EBreakableState__Unbroken      = 0,
	EBreakableState__Broken        = 1,
	EBreakableState__EBreakableState_MAX = 2,

};

// Enum DeadByDaylight.ECameraOffsetState
enum class DeadByDaylight_ECameraOffsetState : uint8_t
{
	ECameraOffsetState__None       = 0,
	ECameraOffsetState__Default    = 1,
	ECameraOffsetState__Crouching  = 2,
	ECameraOffsetState__Crawling   = 3,
	ECameraOffsetState__Carried    = 4,
	ECameraOffsetState__ECameraOffsetState_MAX = 5,

};

// Enum DeadByDaylight.EManualZoomType
enum class DeadByDaylight_EManualZoomType : uint8_t
{
	EManualZoomType__None          = 0,
	EManualZoomType__TargetZoomValue = 1,
	EManualZoomType__CurveFloatProgression = 2,
	EManualZoomType__EManualZoomType_MAX = 3,

};

// Enum DeadByDaylight.EEscapeType
enum class DeadByDaylight_EEscapeType : uint8_t
{
	EEscapeType__Escape_ExitGate   = 0,
	EEscapeType__Escape_Hatch      = 1,
	EEscapeType__Escape_KillerDisconnect = 2,
	EEscapeType__Escape_MAX        = 3,

};

// Enum DeadByDaylight.ECDNPatchCompleteStatus
enum class DeadByDaylight_ECDNPatchCompleteStatus : uint8_t
{
	ECDNPatchCompleteStatus__Success = 0,
	ECDNPatchCompleteStatus__NotEnoughDiskSpace = 1,
	ECDNPatchCompleteStatus__PatchInstallDownloadError = 2,
	ECDNPatchCompleteStatus__PatchInstallFileConstructionFail = 3,
	ECDNPatchCompleteStatus__PatchInstallMoveFileToInstallFail = 4,
	ECDNPatchCompleteStatus__PatchInstallBuildVerifyFail = 5,
	ECDNPatchCompleteStatus__PatchInstallApplicationClosing = 6,
	ECDNPatchCompleteStatus__PatchInstallApplicationError = 7,
	ECDNPatchCompleteStatus__PatchInstallUserCanceled = 8,
	ECDNPatchCompleteStatus__PatchInstallPrerequisiteError = 9,
	ECDNPatchCompleteStatus__PatchInstallInitializationError = 10,
	ECDNPatchCompleteStatus__PatchInstallPathLengthExceeded = 11,
	ECDNPatchCompleteStatus__PatchInstallOutOfDiskSpace = 12,
	ECDNPatchCompleteStatus__PatchInstallUnknownError = 13,
	ECDNPatchCompleteStatus__FailureToMountContent = 14,
	ECDNPatchCompleteStatus__InstalledContentNotFound = 15,
	ECDNPatchCompleteStatus__InvalidPendingContent = 16,
	ECDNPatchCompleteStatus__CantFindContentToDownload = 17,
	ECDNPatchCompleteStatus__NoPatchForCurrentPlatformAndVersion = 18,
	ECDNPatchCompleteStatus__FailureToRetrieveContent = 19,
	ECDNPatchCompleteStatus__CancelledByUser = 20,
	ECDNPatchCompleteStatus__ECDNPatchCompleteStatus_MAX = 21,

};

// Enum DeadByDaylight.EChargeableInteractionBarType
enum class DeadByDaylight_EChargeableInteractionBarType : uint8_t
{
	EChargeableInteractionBarType__VE_Normal = 0,
	EChargeableInteractionBarType__VE_ProgressPips = 1,
	EChargeableInteractionBarType__VE_MAX = 2,

};

// Enum DeadByDaylight.ECharmCategory
enum class DeadByDaylight_ECharmCategory : uint8_t
{
	ECharmCategory__None           = 0,
	ECharmCategory__Small          = 1,
	ECharmCategory__Medium         = 2,
	ECharmCategory__Big            = 3,
	ECharmCategory__ECharmCategory_MAX = 4,

};

// Enum DeadByDaylight.EItemDomain
enum class DeadByDaylight_EItemDomain : uint8_t
{
	EItemDomain__Store             = 0,
	EItemDomain__Local             = 1,
	EItemDomain__Any               = 2,
	EItemDomain__EItemDomain_MAX   = 3,

};

// Enum DeadByDaylight.EOwnership
enum class DeadByDaylight_EOwnership : uint8_t
{
	EOwnership__Owned              = 0,
	EOwnership__NotOwned           = 1,
	EOwnership__Any                = 2,
	EOwnership__EOwnership_MAX     = 3,

};

// Enum DeadByDaylight.EHudEditorDragAxisOption
enum class DeadByDaylight_EHudEditorDragAxisOption : uint8_t
{
	EHudEditorDragAxisOption__PositiveSide = 0,
	EHudEditorDragAxisOption__NegativeSide = 1,
	EHudEditorDragAxisOption__BothSide = 2,
	EHudEditorDragAxisOption__EHudEditorDragAxisOption_MAX = 3,

};

// Enum DeadByDaylight.EUMGDailyRewardWidgetState
enum class DeadByDaylight_EUMGDailyRewardWidgetState : uint8_t
{
	EUMGDailyRewardWidgetState__Unknown = 0,
	EUMGDailyRewardWidgetState__Locked = 1,
	EUMGDailyRewardWidgetState__ReadyToCollect = 2,
	EUMGDailyRewardWidgetState__NewlyCollected = 3,
	EUMGDailyRewardWidgetState__Collected = 4,
	EUMGDailyRewardWidgetState__MysteryLocked = 5,
	EUMGDailyRewardWidgetState__MysteryReadyToDiscover = 6,
	EUMGDailyRewardWidgetState__MysteryNewlyDiscovered = 7,
	EUMGDailyRewardWidgetState__EUMGDailyRewardWidgetState_MAX = 8,

};

// Enum DeadByDaylight.DBDScalabilityLevel
enum class DeadByDaylight_EDBDScalabilityLevel : uint8_t
{
	DBDScalabilityLevel__LOW       = 0,
	DBDScalabilityLevel__MEDIUM    = 1,
	DBDScalabilityLevel__HIGH      = 2,
	DBDScalabilityLevel__EPIC      = 3,
	DBDScalabilityLevel__ULTRA     = 4,
	DBDScalabilityLevel__DBDScalabilityLevel_MAX = 5,

};

// Enum DeadByDaylight.EAIDodgeType
enum class DeadByDaylight_EAIDodgeType : uint8_t
{
	EAIDodgeType__FORWARD_SIDE_STEP = 0,
	EAIDodgeType__SIDE_STEP        = 1,
	EAIDodgeType__BACKWARD_SIDE_STEP = 2,
	EAIDodgeType__EAIDodgeType_MAX = 3,

};

// Enum DeadByDaylight.EPawnInputPressTypes
enum class DeadByDaylight_EPawnInputPressTypes : uint8_t
{
	EPawnInputPressTypes__None     = 0,
	EPawnInputPressTypes__FastInteract = 1,
	EPawnInputPressTypes__Interact = 2,
	EPawnInputPressTypes__Wiggle   = 3,
	EPawnInputPressTypes__Struggle = 4,
	EPawnInputPressTypes__Slash    = 5,
	EPawnInputPressTypes__Attack   = 6,
	EPawnInputPressTypes__Action   = 7,
	EPawnInputPressTypes__SecondaryAction = 8,
	EPawnInputPressTypes__UseItem  = 9,
	EPawnInputPressTypes__DropItem = 10,
	EPawnInputPressTypes__Gesture01 = 11,
	EPawnInputPressTypes__Gesture02 = 12,
	EPawnInputPressTypes__Gesture03 = 13,
	EPawnInputPressTypes__Gesture04 = 14,
	EPawnInputPressTypes__EPawnInputPressTypes_MAX = 15,

};

// Enum DeadByDaylight.EAIDifficultyLevel
enum class DeadByDaylight_EAIDifficultyLevel : uint8_t
{
	EAIDifficultyLevel__VeryEasy   = 0,
	EAIDifficultyLevel__Easy       = 1,
	EAIDifficultyLevel__Medium     = 2,
	EAIDifficultyLevel__Hard       = 3,
	EAIDifficultyLevel__Suggested  = 4,
	EAIDifficultyLevel__Random     = 5,
	EAIDifficultyLevel__None       = 6,
	EAIDifficultyLevel__Max        = 7,
	EAIDifficultyLevel__EAIDifficultyLevel_MAX = 8,

};

// Enum DeadByDaylight.ECharacterMovementTypes
enum class DeadByDaylight_ECharacterMovementTypes : uint8_t
{
	ECharacterMovementTypes__Normal = 0,
	ECharacterMovementTypes__Run   = 1,
	ECharacterMovementTypes__Crouch = 2,
	ECharacterMovementTypes__ECharacterMovementTypes_MAX = 3,

};

// Enum DeadByDaylight.EAITerrorLevel
enum class DeadByDaylight_EAITerrorLevel : uint8_t
{
	EAITerrorLevel__None           = 0,
	EAITerrorLevel__Low            = 1,
	EAITerrorLevel__Min            = 2,
	EAITerrorLevel__Medium         = 3,
	EAITerrorLevel__High           = 4,
	EAITerrorLevel__VeryHigh       = 5,
	EAITerrorLevel__Max            = 6,
	EAITerrorLevel__EAITerrorLevel_MAX = 7,

};

// Enum DeadByDaylight.ECamperGuidedAction
enum class DeadByDaylight_ECamperGuidedAction : uint8_t
{
	ECamperGuidedAction__VE_None   = 0,
	ECamperGuidedAction__VE_PrepBeingKilled = 1,
	ECamperGuidedAction__VE_BeingKilled = 2,
	ECamperGuidedAction__VE_PrepGuidedAction = 3,
	ECamperGuidedAction__VE_BeingHelpedOffHookFront = 4,
	ECamperGuidedAction__VE_BeingHelpedOffHookBack = 5,
	ECamperGuidedAction__VE_BeingPickedUp = 6,
	ECamperGuidedAction__VE_BeingPutDown = 7,
	ECamperGuidedAction__VE_BeingCarried = 8,
	ECamperGuidedAction__VE_BeingPutOnHook = 9,
	ECamperGuidedAction__VE_BeingHealed = 10,
	ECamperGuidedAction__VE_BeingPulledFromCloset = 11,
	ECamperGuidedAction__VE_BeingHelpedFromTrap = 12,
	ECamperGuidedAction__VE_AttachReverseBearTrap = 13,
	ECamperGuidedAction__VE_BeingMended = 14,
	ECamperGuidedAction__VE_BeingInjectedWithSerum = 15,
	ECamperGuidedAction__VE_MAX    = 16,

};

// Enum DeadByDaylight.EMovementCurveType
enum class DeadByDaylight_EMovementCurveType : uint8_t
{
	EMovementCurveType__AdditiveSpeedCurve = 0,
	EMovementCurveType__MultiplicativeSpeedCurve = 1,
	EMovementCurveType__EMovementCurveType_MAX = 2,

};

// Enum DeadByDaylight.ECustomMovementMode
enum class DeadByDaylight_ECustomMovementMode : uint8_t
{
	ECustomMovementMode__CUSTOM_MOVE_None = 0,
	ECustomMovementMode__CUSTOM_MOVE_Snapping = 1,
	ECustomMovementMode__CUSTOM_MOVE_MAX = 2,

};

// Enum DeadByDaylight.EDiceRollType
enum class DeadByDaylight_EDiceRollType : uint8_t
{
	EDiceRollType__VE_EscapeHook   = 0,
	EDiceRollType__VE_EscapeTrap   = 1,
	EDiceRollType__VE_TrapInflictsDying = 2,
	EDiceRollType__VE_TriggerSkillCheck = 3,
	EDiceRollType__VE_TriggerFootNoise = 4,
	EDiceRollType__VE_TriggerCrowAlert = 5,
	EDiceRollType__VE_MAX          = 6,

};

// Enum DeadByDaylight.EEmblemProgressionType
enum class DeadByDaylight_EEmblemProgressionType : uint8_t
{
	EEmblemProgressionType__SurvivorLightbringerStartingValue = 0,
	EEmblemProgressionType__SurvivorLightbringerGeneratorRepair = 1,
	EEmblemProgressionType__SurvivorLightbringerTotemCleanse = 2,
	EEmblemProgressionType__SurvivorLightbringerKillerDiversion = 3,
	EEmblemProgressionType__SurvivorLightbringerExitGameOpen = 4,
	EEmblemProgressionType__SurvivorUnbrokenTimeAlive = 5,
	EEmblemProgressionType__SurvivorBenevolentStartingValue = 6,
	EEmblemProgressionType__SurvivorBenevolentHealing = 7,
	EEmblemProgressionType__SurvivorBenevolentHooked = 8,
	EEmblemProgressionType__SurvivorBenevolentUnhook = 9,
	EEmblemProgressionType__SurvivorBenevolentPerformUnhook = 10,
	EEmblemProgressionType__SurvivorBenevolentSaveFromKiller = 11,
	EEmblemProgressionType__SurvivorBenevolentUnsafeUnhook = 12,
	EEmblemProgressionType__SurvivorBenevolentHitWhileCarrying = 13,
	EEmblemProgressionType__SurvivorEvaderStartingValue = 14,
	EEmblemProgressionType__SurvivorEvaderSneaking = 15,
	EEmblemProgressionType__SurvivorEvaderChaseWon = 16,
	EEmblemProgressionType__SurvivorEvaderChaseLost = 17,
	EEmblemProgressionType__SurvivorEvaderPalletStun = 18,
	EEmblemProgressionType__KillerGatekeeperStartingValue = 19,
	EEmblemProgressionType__KillerGatekeeperGeneratorDefense = 20,
	EEmblemProgressionType__KillerGatekeeperGatesClosed = 21,
	EEmblemProgressionType__KillerDevoutStartingValue = 22,
	EEmblemProgressionType__KillerDevoutSacrifice = 23,
	EEmblemProgressionType__KillerDevoutDisconnect = 24,
	EEmblemProgressionType__KillerDevoutMoris = 25,
	EEmblemProgressionType__KillerDevoutAllSurvivorsHooked = 26,
	EEmblemProgressionType__KillerDevoutHooksBonus = 27,
	EEmblemProgressionType__KillerMaliciousStartingValue = 28,
	EEmblemProgressionType__KillerMaliciousInjuries = 29,
	EEmblemProgressionType__KillerMaliciousHookStages = 30,
	EEmblemProgressionType__KillerMaliciousInjuriesHealed = 31,
	EEmblemProgressionType__KillerMaliciousEscapeGrasp = 32,
	EEmblemProgressionType__KillerMaliciousDisconnect = 33,
	EEmblemProgressionType__KillerChaserStartingValue = 34,
	EEmblemProgressionType__KillerChaserSurvivorFound = 35,
	EEmblemProgressionType__KillerChaserSurvivorLost = 36,
	EEmblemProgressionType__KillerChaserHit = 37,
	EEmblemProgressionType__KillerChaserChaseWon = 38,
	EEmblemProgressionType__KillerChaserProximityToHookPenalty = 39,
	EEmblemProgressionType__Invalid = 40,
	EEmblemProgressionType__EEmblemProgressionType_MAX = 41,

};

// Enum DeadByDaylight.EEmblemEvaluation
enum class DeadByDaylight_EEmblemEvaluation : uint8_t
{
	EEmblemEvaluation__Authority   = 0,
	EEmblemEvaluation__Local       = 1,
	EEmblemEvaluation__EEmblemEvaluation_MAX = 2,

};

// Enum DeadByDaylight.EErrorCodes
enum class DeadByDaylight_EErrorCodes : uint8_t
{
	EErrorCodes__None              = 0,
	EErrorCodes__SavefileDeserializationFailure = 1,
	EErrorCodes__SavefileDecryptionFailure = 2,
	EErrorCodes__SavefileEmpty     = 3,
	EErrorCodes__SavefileBadPlayerId = 4,
	EErrorCodes__SavefileEmptyPlayerUID = 5,
	EErrorCodes__SavefileInvalidUniqueNetID = 6,
	EErrorCodes__SavefileInvalidPlayerState = 7,
	EErrorCodes__SavefileBackendError = 8,
	EErrorCodes__KrakenRankError   = 9,
	EErrorCodes__KrakenRatingsError = 10,
	EErrorCodes__SavefileKrakenPlayerForbidden = 11,
	EErrorCodes__SyncCachedCurrencyError = 12,
	EErrorCodes__CurrencyTransactionError = 13,
	EErrorCodes__StateDownloadFailed = 14,
	EErrorCodes__StatcacheDecryptionFailed = 15,
	EErrorCodes__SavefilePlayerLoadUIDMismatch = 16,
	EErrorCodes__SavefilePlayerStateUIDMismatch = 17,
	EErrorCodes__SavefileEncryptionFailure = 18,
	EErrorCodes__SaveFailedInvalidData = 19,
	EErrorCodes__SaveFailedInvalidJSON = 20,
	EErrorCodes__SaveFailedDecodeDataString = 21,
	EErrorCodes__SaveFailedCompressDataString = 22,
	EErrorCodes__SaveFailedEncryptString = 23,
	EErrorCodes__StatcacheEncryptionFailed = 24,
	EErrorCodes__SaveFailedCloudErrorTimeout = 25,
	EErrorCodes__JsonToPersistenDataFailed = 26,
	EErrorCodes__SaveFailedCloudErrorAfterRetries = 27,
	EErrorCodes__StateUploadFailed = 28,
	EErrorCodes__GetPlayerLevelRequestError = 29,
	EErrorCodes__EarnPlayerXpRequestError = 30,
	EErrorCodes__EarnPlayerXpParamError = 31,
	EErrorCodes__OnboardingFailGet = 32,
	EErrorCodes__OnboardingFailUpdate = 33,
	EErrorCodes__OnboardingFailRequest = 34,
	EErrorCodes__MatchCancelledPlayerLeftDuringLoading = 35,
	EErrorCodes__MatchCancelledInvalidPlayerRoles = 36,
	EErrorCodes__MatchCancelledLoadingTimeout = 37,
	EErrorCodes__EErrorCodes_MAX   = 38,

};

// Enum DeadByDaylight.EGameIntroSteps
enum class DeadByDaylight_EGameIntroSteps : uint8_t
{
	EGameIntroSteps__Idling        = 0,
	EGameIntroSteps__PlayingIntro  = 1,
	EGameIntroSteps__LoopingCamView = 2,
	EGameIntroSteps__EGameIntroSteps_MAX = 3,

};

// Enum DeadByDaylight.EDisconnectErrors
enum class DeadByDaylight_EDisconnectErrors : uint8_t
{
	EDisconnectErrors__None        = 0,
	EDisconnectErrors__SteamAuthFailure = 1,
	EDisconnectErrors__SteamAuthFailureKickedFromServer = 2,
	EDisconnectErrors__EACServerValidationFailure = 3,
	EDisconnectErrors__EACValidationFailureKickedFromServer = 4,
	EDisconnectErrors__EACClientNotRunning = 5,
	EDisconnectErrors__EACClientIntegrityViolation = 6,
	EDisconnectErrors__PlayerRemovedOnSuspend = 7,
	EDisconnectErrors__LostConnectionToHost = 8,
	EDisconnectErrors__LostConnectionToProfileService = 9,
	EDisconnectErrors__MirrorsUnscheduledSessionDestruction = 10,
	EDisconnectErrors__SessionKilledByMirrors = 11,
	EDisconnectErrors__UnableToSaveProfileAfterRetries = 12,
	EDisconnectErrors__UnableToGetPlayerLevel = 13,
	EDisconnectErrors__UnableToEarnPlayerXp = 14,
	EDisconnectErrors__UnableToUpdatePips = 15,
	EDisconnectErrors__UnableToUpdateRatings = 16,
	EDisconnectErrors__ClientProviderAuthenticationFailed = 17,
	EDisconnectErrors__UnableToSyncCachedCurrency = 18,
	EDisconnectErrors__OwnershipValidationFailure = 19,
	EDisconnectErrors__EDisconnectErrors_MAX = 20,

};

// Enum DeadByDaylight.ELevelLoadingSteps
enum class DeadByDaylight_ELevelLoadingSteps : uint8_t
{
	ELevelLoadingSteps__Invalid    = 0,
	ELevelLoadingSteps__WaitingForPlayersToBeSpawned = 1,
	ELevelLoadingSteps__WaitingForAIPawnToBeSpawned = 2,
	ELevelLoadingSteps__WaitingForAssetPreloader = 3,
	ELevelLoadingSteps__WaitingForLoadoutAndTheme = 4,
	ELevelLoadingSteps__WaitingForPIAToBeSpawnedAndInitialized = 5,
	ELevelLoadingSteps__WaitingForNavmeshComputationToStart = 6,
	ELevelLoadingSteps__WaitingForNavmeshComputationToFinish = 7,
	ELevelLoadingSteps__SetGameLoadedAndReadyToPlay = 8,
	ELevelLoadingSteps__WaitingForIntroToBeDone = 9,
	ELevelLoadingSteps__LoadingCompleted = 10,
	ELevelLoadingSteps__ELevelLoadingSteps_MAX = 11,

};

// Enum DeadByDaylight.ELoadProgress
enum class DeadByDaylight_ELoadProgress : uint8_t
{
	ELoadProgress__NotStarted      = 0,
	ELoadProgress__Init            = 1,
	ELoadProgress__ArtificialDelay = 2,
	ELoadProgress__DisconnectingPresencePlugin = 3,
	ELoadProgress__ValidateOnlineSubsystem = 4,
	ELoadProgress__CheckingPlatformService = 5,
	ELoadProgress__PreMirrorsLogin = 6,
	ELoadProgress__ConnectingToMirrors = 7,
	ELoadProgress__StartEAC        = 8,
	ELoadProgress__LoadingAuthInfo = 9,
	ELoadProgress__LoadingBackendConfigs = 10,
	ELoadProgress__SetupRichPresence = 11,
	ELoadProgress__LoadingBackendTunables = 12,
	ELoadProgress__ApplyingCDNPatch = 13,
	ELoadProgress__AquiringExternalAuthentication = 14,
	ELoadProgress__LoadingPlayerIndependentShopData = 15,
	ELoadProgress__LicenseCache    = 16,
	ELoadProgress__LoadingEvents   = 17,
	ELoadProgress__LoadingInventory = 18,
	ELoadProgress__SyncingOwnedCharacters = 19,
	ELoadProgress__LoadingProfile  = 20,
	ELoadProgress__LoadingMirrorCurrencies = 21,
	ELoadProgress__LoadingWallet   = 22,
	ELoadProgress__LoadingConsent  = 23,
	ELoadProgress__LoadingGameConfigs = 24,
	ELoadProgress__LoadingCharacterXPTables = 25,
	ELoadProgress__CheckingPendingTransactions = 26,
	ELoadProgress__LoadingContentSchedule = 27,
	ELoadProgress__LoadingNews     = 28,
	ELoadProgress__SendingAnalytics = 29,
	ELoadProgress__ValidateData    = 30,
	ELoadProgress__ValidatingClientVersion = 31,
	ELoadProgress__CheckingNeedForCurrencyMigration = 32,
	ELoadProgress__MigratingCurrenciesToMirror = 33,
	ELoadProgress__SyncingFriendsList = 34,
	ELoadProgress__Complete        = 35,
	ELoadProgress__Locating        = 36,
	ELoadProgress__InitializingRTMConnection = 37,
	ELoadProgress__LoadingStreamVideoData = 38,
	ELoadProgress__CollectingFreeCatalogItems = 39,
	ELoadProgress__DownloadDynamicContent = 40,
	ELoadProgress__CheckingMobilePendingTransactions = 41,
	ELoadProgress__LoadMarketingBanners = 42,
	ELoadProgress__LoadingSubscriptionStatus = 43,
	ELoadProgress__RequestingTrackingAuthorization = 44,
	ELoadProgress__ELoadProgress_MAX = 45,

};

// Enum DeadByDaylight.EProceduralDebugMode
enum class DeadByDaylight_EProceduralDebugMode : uint8_t
{
	EProceduralDebugMode__None     = 0,
	EProceduralDebugMode__NoMap    = 1,
	EProceduralDebugMode__TilesSmall = 2,
	EProceduralDebugMode__TilesBig = 3,
	EProceduralDebugMode__Count    = 4,
	EProceduralDebugMode__EProceduralDebugMode_MAX = 5,

};

// Enum DeadByDaylight.EAIEvadeLoopSides
enum class DeadByDaylight_EAIEvadeLoopSides : uint8_t
{
	EAIEvadeLoopSides__Left        = 0,
	EAIEvadeLoopSides__Right       = 1,
	EAIEvadeLoopSides__Count       = 2,
	EAIEvadeLoopSides__EAIEvadeLoopSides_MAX = 3,

};

// Enum DeadByDaylight.EPlayerMovementDirection
enum class DeadByDaylight_EPlayerMovementDirection : uint8_t
{
	EPlayerMovementDirection__Left = 0,
	EPlayerMovementDirection__Right = 1,
	EPlayerMovementDirection__Forward = 2,
	EPlayerMovementDirection__Backward = 3,
	EPlayerMovementDirection__EPlayerMovementDirection_MAX = 4,

};

// Enum DeadByDaylight.EPlayerGameplayEventType
enum class DeadByDaylight_EPlayerGameplayEventType : uint8_t
{
	EPlayerGameplayEventType__VE_UnhookedOther = 0,
	EPlayerGameplayEventType__VE_UntrappedOther = 1,
	EPlayerGameplayEventType__VE_HealedOther = 2,
	EPlayerGameplayEventType__VE_MAX = 3,

};

// Enum DeadByDaylight.EVisibleMenuActorType
enum class DeadByDaylight_EVisibleMenuActorType : uint8_t
{
	EVisibleMenuActorType__None    = 0,
	EVisibleMenuActorType__Pawn    = 1,
	EVisibleMenuActorType__Hook    = 2,
	EVisibleMenuActorType__Charm   = 3,
	EVisibleMenuActorType__EVisibleMenuActorType_MAX = 4,

};

// Enum DeadByDaylight.ELoginType
enum class DeadByDaylight_ELoginType : uint8_t
{
	ELoginType__Reservation        = 0,
	ELoginType__Join               = 1,
	ELoginType__None               = 2,
	ELoginType__ELoginType_MAX     = 3,

};

// Enum DeadByDaylight.EGameType
enum class DeadByDaylight_EGameType : uint8_t
{
	EGameType__Online              = 0,
	EGameType__KillYourFriends     = 1,
	EGameType__SurvivorGroup       = 2,
	EGameType__Tutorial            = 3,
	EGameType__TutorialBotMatch    = 4,
	EGameType__SecretBotMatch      = 5,
	EGameType__None                = 6,
	EGameType__EGameType_MAX       = 7,

};

// Enum DeadByDaylight.EToastInputType
enum class DeadByDaylight_EToastInputType : uint8_t
{
	EToastInputType__Toast_Accept  = 0,
	EToastInputType__Toast_Reject  = 1,
	EToastInputType__Toast_Close   = 2,
	EToastInputType__Toast_MAX     = 3,

};

// Enum DeadByDaylight.EShadowSystem
enum class DeadByDaylight_EShadowSystem : uint8_t
{
	EShadowSystem__CascadedShadowMap = 0,
	EShadowSystem__CacheWholeSceneStaticShadowMap = 1,
	EShadowSystem__AdaptiveShadowMap = 2,
	EShadowSystem__EShadowSystem_MAX = 3,

};

// Enum DeadByDaylight.EDemogorgonPortalState
enum class DeadByDaylight_EDemogorgonPortalState : uint8_t
{
	EDemogorgonPortalState__Hidden = 0,
	EDemogorgonPortalState__InUse  = 1,
	EDemogorgonPortalState__Exposed = 2,
	EDemogorgonPortalState__EDemogorgonPortalState_MAX = 3,

};

// Enum DeadByDaylight.EDoctorAbilityPhase
enum class DeadByDaylight_EDoctorAbilityPhase : uint8_t
{
	EDoctorAbilityPhase__VE_Charging = 0,
	EDoctorAbilityPhase__VE_Firing = 1,
	EDoctorAbilityPhase__VE_None   = 2,
	EDoctorAbilityPhase__VE_MAX    = 3,

};

// Enum DeadByDaylight.EDoctorAbilityType
enum class DeadByDaylight_EDoctorAbilityType : uint8_t
{
	EDoctorAbilityType__VE_ShockTherapy = 0,
	EDoctorAbilityType__VE_StaticBlast = 1,
	EDoctorAbilityType__VE_None    = 2,
	EDoctorAbilityType__VE_MAX     = 3,

};

// Enum DeadByDaylight.EEndGameScenarioTrigger
enum class DeadByDaylight_EEndGameScenarioTrigger : uint8_t
{
	EEndGameScenarioTrigger__ClosedHatch = 0,
	EEndGameScenarioTrigger__OpenedGate = 1,
	EEndGameScenarioTrigger__CheatUsed = 2,
	EEndGameScenarioTrigger__NotActivated = 3,
	EEndGameScenarioTrigger__EEndGameScenarioTrigger_MAX = 4,

};

// Enum DeadByDaylight.EEnergyTypeEnum
enum class DeadByDaylight_EEnergyTypeEnum : uint8_t
{
	EEnergyTypeEnum__EInvalid      = 0,
	EEnergyTypeEnum__EBattery      = 1,
	EEnergyTypeEnum__EHealth       = 2,
	EEnergyTypeEnum__EEnergyTypeEnum_MAX = 3,

};

// Enum DeadByDaylight.EEscapeDoorActivationMode
enum class DeadByDaylight_EEscapeDoorActivationMode : uint8_t
{
	EEscapeDoorActivationMode__Standard = 0,
	EEscapeDoorActivationMode__Tutorial = 1,
	EEscapeDoorActivationMode__EEscapeDoorActivationMode_MAX = 2,

};

// Enum DeadByDaylight.EConditionSubject
enum class DeadByDaylight_EConditionSubject : uint8_t
{
	EConditionSubject__Instigator  = 0,
	EConditionSubject__Target      = 1,
	EConditionSubject__EConditionSubject_MAX = 2,

};

// Enum DeadByDaylight.EEventItemContentType
enum class DeadByDaylight_EEventItemContentType : uint8_t
{
	EEventItemContentType__None    = 0,
	EEventItemContentType__Cells   = 1,
	EEventItemContentType__Character = 2,
	EEventItemContentType__Customization = 3,
	EEventItemContentType__NameChangeCard = 4,
	EEventItemContentType__FreeTicket = 5,
	EEventItemContentType__OtherCurrency = 6,
	EEventItemContentType__Item    = 7,
	EEventItemContentType__Addon   = 8,
	EEventItemContentType__Offering = 9,
	EEventItemContentType__Count   = 10,
	EEventItemContentType__EEventItemContentType_MAX = 11,

};

// Enum DeadByDaylight.EFeaturedStoreContentType
enum class DeadByDaylight_EFeaturedStoreContentType : uint8_t
{
	EFeaturedStoreContentType__None = 0,
	EFeaturedStoreContentType__Character = 1,
	EFeaturedStoreContentType__Customization = 2,
	EFeaturedStoreContentType__Outfit = 3,
	EFeaturedStoreContentType__Count = 4,
	EFeaturedStoreContentType__EFeaturedStoreContentType_MAX = 5,

};

// Enum DeadByDaylight.ELoadoutType
enum class DeadByDaylight_ELoadoutType : uint8_t
{
	ELoadoutType__Item             = 0,
	ELoadoutType__Perk             = 1,
	ELoadoutType__Offering         = 2,
	ELoadoutType__ELoadoutType_MAX = 3,

};

// Enum DeadByDaylight.FlickeringLightType
enum class DeadByDaylight_EFlickeringLightType : uint8_t
{
	FlickeringLightType__Point     = 0,
	FlickeringLightType__Rect      = 1,
	FlickeringLightType__Spot      = 2,
	FlickeringLightType__FlickeringLightType_MAX = 3,

};

// Enum DeadByDaylight.EFrenzyEndReason
enum class DeadByDaylight_EFrenzyEndReason : uint8_t
{
	EFrenzyEndReason__OutOfTime    = 0,
	EFrenzyEndReason__Manual       = 1,
	EFrenzyEndReason__PickUpCamper = 2,
	EFrenzyEndReason__Stunned      = 3,
	EFrenzyEndReason__Mori         = 4,
	EFrenzyEndReason__Blinded      = 5,
	EFrenzyEndReason__EFrenzyEndReason_MAX = 6,

};

// Enum DeadByDaylight.EFriendUIRichPresence
enum class DeadByDaylight_EFriendUIRichPresence : uint8_t
{
	EFriendUIRichPresence__Undefined = 0,
	EFriendUIRichPresence__InMenus = 1,
	EFriendUIRichPresence__InLobby = 2,
	EFriendUIRichPresence__InMatch = 3,
	EFriendUIRichPresence__Connected = 4,
	EFriendUIRichPresence__Closing = 5,
	EFriendUIRichPresence__EFriendUIRichPresence_MAX = 6,

};

// Enum DeadByDaylight.EFriendUIStatus
enum class DeadByDaylight_EFriendUIStatus : uint8_t
{
	EFriendUIStatus__Offline       = 0,
	EFriendUIStatus__Online        = 1,
	EFriendUIStatus__PlayingDBD    = 2,
	EFriendUIStatus__PendingSentRequest = 3,
	EFriendUIStatus__PendingReceivedRequest = 4,
	EFriendUIStatus__NotFriend     = 5,
	EFriendUIStatus__Self          = 6,
	EFriendUIStatus__EFriendUIStatus_MAX = 7,

};

// Enum DeadByDaylight.EFlowTransitionType
enum class DeadByDaylight_EFlowTransitionType : uint8_t
{
	EFlowTransitionType__Tally     = 0,
	EFlowTransitionType__OnlineLobby = 1,
	EFlowTransitionType__PartyLobby = 2,
	EFlowTransitionType__OfflineLobby = 3,
	EFlowTransitionType__Splash    = 4,
	EFlowTransitionType__RoleSelection = 5,
	EFlowTransitionType__None      = 6,
	EFlowTransitionType__EFlowTransitionType_MAX = 7,

};

// Enum DeadByDaylight.EUIFlowEvent
enum class DeadByDaylight_EUIFlowEvent : uint8_t
{
	EUIFlowEvent__None             = 0,
	EUIFlowEvent__AtlantaRoleSelectionScreenReady = 1,
	EUIFlowEvent__AtlantaNavigationScreenReady = 2,
	EUIFlowEvent__InGameHudReady   = 3,
	EUIFlowEvent__LoadingScreenReady = 4,
	EUIFlowEvent__OfflineLobbyScreenReady = 5,
	EUIFlowEvent__OnlineLobbyScreenReady = 6,
	EUIFlowEvent__RoleSelectionScreenReady = 7,
	EUIFlowEvent__SplashScreenReady = 8,
	EUIFlowEvent__TallyScreenReady = 9,
	EUIFlowEvent__PartyLobbyScreenReady = 10,
	EUIFlowEvent__StoreScreenReady = 11,
	EUIFlowEvent__EUIFlowEvent_MAX = 12,

};

// Enum DeadByDaylight.EWorldFlowEvent
enum class DeadByDaylight_EWorldFlowEvent : uint8_t
{
	EWorldFlowEvent__None          = 0,
	EWorldFlowEvent__GameLevelLoaded = 1,
	EWorldFlowEvent__LoadingGameLevel = 2,
	EWorldFlowEvent__LoadingOfflineParadise = 3,
	EWorldFlowEvent__LoadingOnlineLobbyLevel = 4,
	EWorldFlowEvent__OfflineLobbyMapLoaded = 5,
	EWorldFlowEvent__OfflineParadiseLoaded = 6,
	EWorldFlowEvent__OnlineLobbyMapLoaded = 7,
	EWorldFlowEvent__StartScreenMapLoaded = 8,
	EWorldFlowEvent__LoadingSplashScreen = 9,
	EWorldFlowEvent__EWorldFlowEvent_MAX = 10,

};

// Enum DeadByDaylight.EGameFlowStep
enum class DeadByDaylight_EGameFlowStep : uint8_t
{
	EGameFlowStep__None            = 0,
	EGameFlowStep__InGame          = 1,
	EGameFlowStep__OfflineLobby    = 2,
	EGameFlowStep__OfflineTally    = 3,
	EGameFlowStep__OnlineLobby     = 4,
	EGameFlowStep__SplashScreen    = 5,
	EGameFlowStep__PartyLobby      = 6,
	EGameFlowStep__Store           = 7,
	EGameFlowStep__RoleSelection   = 8,
	EGameFlowStep__EGameFlowStep_MAX = 9,

};

// Enum DeadByDaylight.EGameplayModifierSource
enum class DeadByDaylight_EGameplayModifierSource : uint8_t
{
	EGameplayModifierSource__VE_Perk = 0,
	EGameplayModifierSource__VE_StatusEffect = 1,
	EGameplayModifierSource__VE_Item = 2,
	EGameplayModifierSource__VE_ItemAddon = 3,
	EGameplayModifierSource__VE_All = 4,
	EGameplayModifierSource__VE_PerkOrStatusEffect = 5,
	EGameplayModifierSource__VE_PerkStatusOrAddon = 6,
	EGameplayModifierSource__VE_MAX = 7,

};

// Enum DeadByDaylight.EGateType
enum class DeadByDaylight_EGateType : uint8_t
{
	EGateType__VE_AndGate          = 0,
	EGateType__VE_TimerGate        = 1,
	EGateType__VE_MAX              = 2,

};

// Enum DeadByDaylight.EGestureID
enum class DeadByDaylight_EGestureID : uint8_t
{
	EGestureID__POINT              = 0,
	EGestureID__COME               = 1,
	EGestureID__EGestureID_MAX     = 2,

};

// Enum DeadByDaylight.EHatchState
enum class DeadByDaylight_EHatchState : uint8_t
{
	EHatchState__Hidden            = 0,
	EHatchState__DefaultClose      = 1,
	EHatchState__Opened            = 2,
	EHatchState__ForcedClose       = 3,
	EHatchState__EHatchState_MAX   = 4,

};

// Enum DeadByDaylight.EHintCategory
enum class DeadByDaylight_EHintCategory : uint8_t
{
	EHintCategory__Lore            = 0,
	EHintCategory__Survivor        = 1,
	EHintCategory__Killer          = 2,
	EHintCategory__EHintCategory_MAX = 3,

};

// Enum DeadByDaylight.EHookType
enum class DeadByDaylight_EHookType : uint8_t
{
	EHookType__Hook                = 0,
	EHookType__DeathBed            = 1,
	EHookType__None                = 2,
	EHookType__EHookType_MAX       = 3,

};

// Enum DeadByDaylight.EProgressModifier
enum class DeadByDaylight_EProgressModifier : uint8_t
{
	EProgressModifier__Default     = 0,
	EProgressModifier__Buff        = 1,
	EProgressModifier__Debuff      = 2,
	EProgressModifier__EProgressModifier_MAX = 3,

};

// Enum DeadByDaylight.EInteractionLayer
enum class DeadByDaylight_EInteractionLayer : uint8_t
{
	EInteractionLayer__VE_Camper   = 0,
	EInteractionLayer__VE_Slasher  = 1,
	EInteractionLayer__VE_MAX      = 2,

};

// Enum DeadByDaylight.ESnapBackPositionType
enum class DeadByDaylight_ESnapBackPositionType : uint8_t
{
	ESnapBackPositionType__SnapBackToInitialPosition = 0,
	ESnapBackPositionType__SnapBackToOffsetPositionFromSnap = 1,
	ESnapBackPositionType__ESnapBackPositionType_MAX = 2,

};

// Enum DeadByDaylight.ESnapBackType
enum class DeadByDaylight_ESnapBackType : uint8_t
{
	ESnapBackType__None            = 0,
	ESnapBackType__Always          = 1,
	ESnapBackType__OnInteractionCancelledOnly = 2,
	ESnapBackType__OnInteractionEndOnly = 3,
	ESnapBackType__OnSurvivorDownedOnly = 4,
	ESnapBackType__ESnapBackType_MAX = 5,

};

// Enum DeadByDaylight.EPowerProgressBar
enum class DeadByDaylight_EPowerProgressBar : uint8_t
{
	EPowerProgressBar__NoProgressBar = 0,
	EPowerProgressBar__ChargeBar   = 1,
	EPowerProgressBar__EPowerProgressBar_MAX = 2,

};

// Enum DeadByDaylight.EInteractionComparisonPriority
enum class DeadByDaylight_EInteractionComparisonPriority : uint8_t
{
	EInteractionComparisonPriority__Lower = 0,
	EInteractionComparisonPriority__Equal = 1,
	EInteractionComparisonPriority__Higher = 2,
	EInteractionComparisonPriority__EInteractionComparisonPriority_MAX = 3,

};

// Enum DeadByDaylight.EInteractionOwnership
enum class DeadByDaylight_EInteractionOwnership : uint8_t
{
	EInteractionOwnership__AnyCanUse = 0,
	EInteractionOwnership__OnlyOwnerCanUse = 1,
	EInteractionOwnership__OwnerCannotUse = 2,
	EInteractionOwnership__EInteractionOwnership_MAX = 3,

};

// Enum DeadByDaylight.EKillerTutorialEndGameType
enum class DeadByDaylight_EKillerTutorialEndGameType : uint8_t
{
	EKillerTutorialEndGameType__DeathByHook = 0,
	EKillerTutorialEndGameType__DeathByEndGameCollapse = 1,
	EKillerTutorialEndGameType__EKillerTutorialEndGameType_MAX = 2,

};

// Enum DeadByDaylight.EKillerHeight
enum class DeadByDaylight_EKillerHeight : uint8_t
{
	EKillerHeight__Short           = 0,
	EKillerHeight__Average         = 1,
	EKillerHeight__Tall            = 2,
	EKillerHeight__EKillerHeight_MAX = 3,

};

// Enum DeadByDaylight.EFPVTransitionStrategy
enum class DeadByDaylight_EFPVTransitionStrategy : uint8_t
{
	EFPVTransitionStrategy__TurnInvisible = 0,
	EFPVTransitionStrategy__SquishTorsoBackward = 1,
	EFPVTransitionStrategy__EFPVTransitionStrategy_MAX = 2,

};

// Enum DeadByDaylight.EDisplayStandActorType
enum class DeadByDaylight_EDisplayStandActorType : uint8_t
{
	EDisplayStandActorType__None   = 0,
	EDisplayStandActorType__Character = 1,
	EDisplayStandActorType__Hook   = 2,
	EDisplayStandActorType__Charm  = 3,
	EDisplayStandActorType__EDisplayStandActorType_MAX = 4,

};

// Enum DeadByDaylight.EPlayerDataType
enum class DeadByDaylight_EPlayerDataType : uint8_t
{
	EPlayerDataType__None          = 0,
	EPlayerDataType__PlayerState   = 1,
	EPlayerDataType__SocialPartyMember = 2,
	EPlayerDataType__EPlayerDataType_MAX = 3,

};

// Enum DeadByDaylight.ELobbyWaitStopReason
enum class DeadByDaylight_ELobbyWaitStopReason : uint8_t
{
	ELobbyWaitStopReason__StartMatchWait = 0,
	ELobbyWaitStopReason__PlayerCancelled = 1,
	ELobbyWaitStopReason__Unknown  = 2,
	ELobbyWaitStopReason__ELobbyWaitStopReason_MAX = 3,

};

// Enum DeadByDaylight.EMainMenuButton
enum class DeadByDaylight_EMainMenuButton : uint8_t
{
	EMainMenuButton__News          = 0,
	EMainMenuButton__PlaySurvivor  = 1,
	EMainMenuButton__PlayKiller    = 2,
	EMainMenuButton__KillYourFriends = 3,
	EMainMenuButton__DailyRituals  = 4,
	EMainMenuButton__Store         = 5,
	EMainMenuButton__Settings      = 6,
	EMainMenuButton__Onboarding    = 7,
	EMainMenuButton__Credits       = 8,
	EMainMenuButton__QuitGame      = 9,
	EMainMenuButton__Friends       = 10,
	EMainMenuButton__Archives      = 11,
	EMainMenuButton__CrowdChoice   = 12,
	EMainMenuButton__Support       = 13,
	EMainMenuButton__PlaySurvivorFromCrowdChoice = 14,
	EMainMenuButton__PlayKillerFromCrowdChoice = 15,
	EMainMenuButton__EMainMenuButton_MAX = 16,

};

// Enum DeadByDaylight.EMapActorCategory
enum class DeadByDaylight_EMapActorCategory : uint8_t
{
	EMapActorCategory__None        = 0,
	EMapActorCategory__Objective   = 1,
	EMapActorCategory__Chest       = 2,
	EMapActorCategory__BlackLock   = 3,
	EMapActorCategory__KillerObject = 4,
	EMapActorCategory__ExitGate    = 5,
	EMapActorCategory__EMapActorCategory_MAX = 6,

};

// Enum DeadByDaylight.EQuadDirection
enum class DeadByDaylight_EQuadDirection : uint8_t
{
	EQuadDirection__None           = 0,
	EQuadDirection__Up             = 1,
	EQuadDirection__Down           = 2,
	EQuadDirection__Left           = 3,
	EQuadDirection__Right          = 4,
	EQuadDirection__Empty          = 5,
	EQuadDirection__EQuadDirection_MAX = 6,

};

// Enum DeadByDaylight.ETileVariation
enum class DeadByDaylight_ETileVariation : uint8_t
{
	ETileVariation__None           = 0,
	ETileVariation__BlueTag        = 1,
	ETileVariation__PinkTag        = 2,
	ETileVariation__YellowTag      = 3,
	ETileVariation__GreenTag       = 4,
	ETileVariation__Empty          = 5,
	ETileVariation__ETileVariation_MAX = 6,

};

// Enum DeadByDaylight.EPathType
enum class DeadByDaylight_EPathType : uint8_t
{
	EPathType__None                = 0,
	EPathType__Straight            = 1,
	EPathType__DeadEnd             = 2,
	EPathType__Corner              = 3,
	EPathType__Crossroads          = 4,
	EPathType__TJunction           = 5,
	EPathType__OrientationOnly     = 6,
	EPathType__Unspecified         = 7,
	EPathType__OrientedCrossroads  = 8,
	EPathType__EPathType_MAX       = 9,

};

// Enum DeadByDaylight.EDensity
enum class DeadByDaylight_EDensity : uint8_t
{
	EDensity__Unspecified          = 0,
	EDensity__Light                = 1,
	EDensity__Moderate             = 2,
	EDensity__Heavy                = 3,
	EDensity__Empty                = 4,
	EDensity__EDensity_MAX         = 5,

};

// Enum DeadByDaylight.ETileType
enum class DeadByDaylight_ETileType : uint8_t
{
	ETileType__None                = 0,
	ETileType__Blocker             = 1,
	ETileType__Any                 = 2,
	ETileType__Forest              = 3,
	ETileType__Building            = 4,
	ETileType__Maze                = 5,
	ETileType__Landmark            = 6,
	ETileType__Signature           = 7,
	ETileType__ETileType_MAX       = 8,

};

// Enum DeadByDaylight.EDirection
enum class DeadByDaylight_EDirection : uint8_t
{
	EDirection__Up                 = 0,
	EDirection__Down               = 1,
	EDirection__Left               = 2,
	EDirection__Right              = 3,
	EDirection__UpLeft             = 4,
	EDirection__UpRight            = 5,
	EDirection__DownLeft           = 6,
	EDirection__DownRight          = 7,
	EDirection__EDirection_MAX     = 8,

};

// Enum DeadByDaylight.EBasementType
enum class DeadByDaylight_EBasementType : uint8_t
{
	EBasementType__None            = 0,
	EBasementType__Basic           = 1,
	EBasementType__MainBuilding    = 2,
	EBasementType__Shack           = 3,
	EBasementType__Count           = 4,
	EBasementType__EBasementType_MAX = 5,

};

// Enum DeadByDaylight.EQuadrantSpawnType
enum class DeadByDaylight_EQuadrantSpawnType : uint8_t
{
	EQuadrantSpawnType__L_Shape    = 0,
	EQuadrantSpawnType__Square     = 1,
	EQuadrantSpawnType__Rect_X     = 2,
	EQuadrantSpawnType__Rect_Y     = 3,
	EQuadrantSpawnType__Rect       = 4,
	EQuadrantSpawnType__None       = 5,
	EQuadrantSpawnType__EQuadrantSpawnType_MAX = 6,

};

// Enum DeadByDaylight.EQuadrant
enum class DeadByDaylight_EQuadrant : uint8_t
{
	EQuadrant__BottomRight         = 0,
	EQuadrant__BottomLeft          = 1,
	EQuadrant__TopLeft             = 2,
	EQuadrant__TopRight            = 3,
	EQuadrant__Count               = 4,
	EQuadrant__EQuadrant_MAX       = 5,

};

// Enum DeadByDaylight.EPlayerAnimState
enum class DeadByDaylight_EPlayerAnimState : uint8_t
{
	EPlayerAnimState__VE_Default   = 0,
	EPlayerAnimState__VE_Injured   = 1,
	EPlayerAnimState__VE_InjuredCrouch = 2,
	EPlayerAnimState__VE_Crouch    = 3,
	EPlayerAnimState__VE_MAX       = 4,

};

// Enum DeadByDaylight.EOfferingEffectType
enum class DeadByDaylight_EOfferingEffectType : uint8_t
{
	EOfferingEffectType__SlasherPointsAll = 0,
	EOfferingEffectType__PointsBrutality = 1,
	EOfferingEffectType__PointsDeviouness = 2,
	EOfferingEffectType__PointsSacrice = 3,
	EOfferingEffectType__PointsHunting = 4,
	EOfferingEffectType__CamperPointsAll = 5,
	EOfferingEffectType__PointsObjective = 6,
	EOfferingEffectType__PointsSurvival = 7,
	EOfferingEffectType__PointsAltruism = 8,
	EOfferingEffectType__PointsBoldness = 9,
	EOfferingEffectType__SurvivorCharacterXP = 10,
	EOfferingEffectType__KillerCharacterXP = 11,
	EOfferingEffectType__CamperItemLostPrevention = 12,
	EOfferingEffectType__KillerItemLostPrevention = 13,
	EOfferingEffectType__Luck      = 14,
	EOfferingEffectType__IndustrialThemeSelectionModifier = 15,
	EOfferingEffectType__JunkyardThemeSelectionModifier = 16,
	EOfferingEffectType__FarmThemeSelectionModifier = 17,
	EOfferingEffectType__SwampThemeSelectionModifier = 18,
	EOfferingEffectType__MapModifier = 19,
	EOfferingEffectType__ChestCountModifier = 20,
	EOfferingEffectType__PortableHookCountModifier = 21,
	EOfferingEffectType__LairCountModifier = 22,
	EOfferingEffectType__PlayerGrouping = 23,
	EOfferingEffectType__FarKiller = 24,
	EOfferingEffectType__KillAllowedModifier = 25,
	EOfferingEffectType__LightingModification = 26,
	EOfferingEffectType__FogModification = 27,
	EOfferingEffectType__LivingWorldObjectCountModifier = 28,
	EOfferingEffectType__LivingWorldObjectMultModifier = 29,
	EOfferingEffectType__KillLastSurvivor = 30,
	EOfferingEffectType__SuburbsThemeSelectionModifier = 31,
	EOfferingEffectType__AsylumThemeSelectionModifier = 32,
	EOfferingEffectType__KillerSelectionModifier = 33,
	EOfferingEffectType__HospitalThemeSelectionModifier = 34,
	EOfferingEffectType__KillAllowedAfterStrugglePhase = 35,
	EOfferingEffectType__BorealThemeSelectionModifier = 36,
	EOfferingEffectType__SpringwoodThemeSelectionModifier = 37,
	EOfferingEffectType__FinlandThemeSelectionModifier = 38,
	EOfferingEffectType__JapaneseCountrySideSelectionModifier = 39,
	EOfferingEffectType__KenyaThemeSelectionModifier = 40,
	EOfferingEffectType__QatarThemeSelectionModifier = 41,
	EOfferingEffectType__UkraineThemeSelectionModifier = 42,
	EOfferingEffectType__WalesThemeSelectionModifier = 43,
	EOfferingEffectType__CancelThemeSelectionModifier = 44,
	EOfferingEffectType__BasementMainBuildingModifier = 45,
	EOfferingEffectType__BasementShackModifier = 46,
	EOfferingEffectType__HatchMainBuildingModifier = 47,
	EOfferingEffectType__HatchShackModifier = 48,
	EOfferingEffectType__EclipseThemeSelectionModifier = 49,
	EOfferingEffectType__IonThemeSelectionModifier = 50,
	EOfferingEffectType__SpecialEvent = 51,
	EOfferingEffectType__ObjectSubsitution = 52,
	EOfferingEffectType__ObjectAddition = 53,
	EOfferingEffectType__EOfferingEffectType_MAX = 54,

};

// Enum DeadByDaylight.EOfferingType
enum class DeadByDaylight_EOfferingType : uint8_t
{
	EOfferingType__None            = 0,
	EOfferingType__Atmosphere      = 1,
	EOfferingType__Lighting        = 2,
	EOfferingType__Points          = 3,
	EOfferingType__Zone            = 4,
	EOfferingType__Position        = 5,
	EOfferingType__Chest           = 6,
	EOfferingType__Hook            = 7,
	EOfferingType__Protection      = 8,
	EOfferingType__Hatch           = 9,
	EOfferingType__Odds            = 10,
	EOfferingType__Killing         = 11,
	EOfferingType__World           = 12,
	EOfferingType__Luck            = 13,
	EOfferingType__Killer          = 14,
	EOfferingType__ProceduralGeneration = 15,
	EOfferingType__CharacterXP     = 16,
	EOfferingType__Count           = 17,
	EOfferingType__EOfferingType_MAX = 18,

};

// Enum DeadByDaylight.EOfferingCombinationResult
enum class DeadByDaylight_EOfferingCombinationResult : uint8_t
{
	EOfferingCombinationResult__None = 0,
	EOfferingCombinationResult__Stacked = 1,
	EOfferingCombinationResult__CoConsummed = 2,
	EOfferingCombinationResult__Overruling = 3,
	EOfferingCombinationResult__Cancelled = 4,
	EOfferingCombinationResult__EOfferingCombinationResult_MAX = 5,

};

// Enum DeadByDaylight.EOfferingAnimState
enum class DeadByDaylight_EOfferingAnimState : uint8_t
{
	EOfferingAnimState__None       = 0,
	EOfferingAnimState__Idle       = 1,
	EOfferingAnimState__Init       = 2,
	EOfferingAnimState__Reveal     = 3,
	EOfferingAnimState__ShowInteraction = 4,
	EOfferingAnimState__Burned     = 5,
	EOfferingAnimState__Returned   = 6,
	EOfferingAnimState__Cancel     = 7,
	EOfferingAnimState__Hidden     = 8,
	EOfferingAnimState__EOfferingAnimState_MAX = 9,

};

// Enum DeadByDaylight.EOfferingSequenceState
enum class DeadByDaylight_EOfferingSequenceState : uint8_t
{
	EOfferingSequenceState__SmokeIn = 0,
	EOfferingSequenceState__FadeOut = 1,
	EOfferingSequenceState__FadeIn = 2,
	EOfferingSequenceState__NotInitialized = 3,
	EOfferingSequenceState__Idle   = 4,
	EOfferingSequenceState__Init   = 5,
	EOfferingSequenceState__InitDone = 6,
	EOfferingSequenceState__Reveal = 7,
	EOfferingSequenceState__RevealDone = 8,
	EOfferingSequenceState__ShowInteraction = 9,
	EOfferingSequenceState__Finalize = 10,
	EOfferingSequenceState__Done   = 11,
	EOfferingSequenceState__EOfferingSequenceState_MAX = 12,

};

// Enum DeadByDaylight.EOfflineLobbyState
enum class DeadByDaylight_EOfflineLobbyState : uint8_t
{
	EOfflineLobbyState__None       = 0,
	EOfflineLobbyState__RoleSelection = 1,
	EOfflineLobbyState__OfflineLobby = 2,
	EOfflineLobbyState__Store      = 3,
	EOfflineLobbyState__PartyLobby = 4,
	EOfflineLobbyState__Archives   = 5,
	EOfflineLobbyState__EOfflineLobbyState_MAX = 6,

};

// Enum DeadByDaylight.EOniAttackType
enum class DeadByDaylight_EOniAttackType : uint8_t
{
	EOniAttackType__VE_NotDemonMode = 0,
	EOniAttackType__VE_DemonBasicAttack = 1,
	EOniAttackType__VE_DemonPowerAttack = 2,
	EOniAttackType__VE_DemonDashAttack = 3,
	EOniAttackType__VE_MAX         = 4,

};

// Enum DeadByDaylight.EJoinSessionFailureType
enum class DeadByDaylight_EJoinSessionFailureType : uint8_t
{
	EJoinSessionFailureType__None  = 0,
	EJoinSessionFailureType__JoiningAlreadyStartedGame = 1,
	EJoinSessionFailureType__JoiningPrivateGame = 2,
	EJoinSessionFailureType__JoiningAlreadyFullGame = 3,
	EJoinSessionFailureType__JoiningInvitation = 4,
	EJoinSessionFailureType__JoiningFailedOnDisconnect = 5,
	EJoinSessionFailureType__JoiningHostUnreachable = 6,
	EJoinSessionFailureType__JoiningIncompatibleServer = 7,
	EJoinSessionFailureType__EJoinSessionFailureType_MAX = 8,

};

// Enum DeadByDaylight.EOnlineOperation
enum class DeadByDaylight_EOnlineOperation : uint8_t
{
	EOnlineOperation__None         = 0,
	EOnlineOperation__HostGame     = 1,
	EOnlineOperation__EndingSession = 2,
	EOnlineOperation__DestroyingSession = 3,
	EOnlineOperation__PreparingJoinGame = 4,
	EOnlineOperation__JoinGame     = 5,
	EOnlineOperation__JoinCancelled = 6,
	EOnlineOperation__OnlineCheck  = 7,
	EOnlineOperation__CancellingMatchmaking = 8,
	EOnlineOperation__EOnlineOperation_MAX = 9,

};

// Enum DeadByDaylight.EOverlayMode
enum class DeadByDaylight_EOverlayMode : uint8_t
{
	EOverlayMode__Default          = 0,
	EOverlayMode__TrialOrTally     = 1,
	EOverlayMode__TutorialLevel    = 2,
	EOverlayMode__TutorialBotMatch = 3,
	EOverlayMode__EOverlayMode_MAX = 4,

};

// Enum DeadByDaylight.EOverlayTabs
enum class DeadByDaylight_EOverlayTabs : uint8_t
{
	EOverlayTabs__Settings         = 0,
	EOverlayTabs__Controls         = 1,
	EOverlayTabs__Help             = 2,
	EOverlayTabs__Survivors        = 3,
	EOverlayTabs__CoreTabCount     = 4,
	EOverlayTabs__About            = 5,
	EOverlayTabs__Language         = 6,
	EOverlayTabs__EOverlayTabs_MAX = 7,

};

// Enum DeadByDaylight.EPalletStunZoneSideStrategy
enum class DeadByDaylight_EPalletStunZoneSideStrategy : uint8_t
{
	EPalletStunZoneSideStrategy__OppositeSideToPlayerExecutingPulldown = 0,
	EPalletStunZoneSideStrategy__SameSideToPlayerExecutingPulldown = 1,
	EPalletStunZoneSideStrategy__EPalletStunZoneSideStrategy_MAX = 2,

};

// Enum DeadByDaylight.EPalletPushSideStrategy
enum class DeadByDaylight_EPalletPushSideStrategy : uint8_t
{
	EPalletPushSideStrategy__PushToClosestPalletSide = 0,
	EPalletPushSideStrategy__PushOppositeToPlayerExecutingPulldown = 1,
	EPalletPushSideStrategy__EPalletPushSideStrategy_MAX = 2,

};

// Enum DeadByDaylight.EPalletSide
enum class DeadByDaylight_EPalletSide : uint8_t
{
	EPalletSide__None              = 0,
	EPalletSide__Left              = 1,
	EPalletSide__Right             = 2,
	EPalletSide__EPalletSide_MAX   = 3,

};

// Enum DeadByDaylight.EPalletState
enum class DeadByDaylight_EPalletState : uint8_t
{
	EPalletState__Up               = 0,
	EPalletState__Falling          = 1,
	EPalletState__Fallen           = 2,
	EPalletState__Destroyed        = 3,
	EPalletState__Illusionary      = 4,
	EPalletState__EPalletState_MAX = 5,

};

// Enum DeadByDaylight.EInventoryGridFormat
enum class DeadByDaylight_EInventoryGridFormat : uint8_t
{
	EInventoryGridFormat__DEFAULT  = 0,
	EInventoryGridFormat__DIAMOND  = 1,
	EInventoryGridFormat__HONEYCOMB = 2,
	EInventoryGridFormat__EInventoryGridFormat_MAX = 3,

};

// Enum DeadByDaylight.ERequestState
enum class DeadByDaylight_ERequestState : uint8_t
{
	ERequestState__VE_None         = 0,
	ERequestState__VE_Pending      = 1,
	ERequestState__VE_Success      = 2,
	ERequestState__VE_Fail         = 3,
	ERequestState__VE_MAX          = 4,

};

// Enum DeadByDaylight.EInteractionValidationState
enum class DeadByDaylight_EInteractionValidationState : uint8_t
{
	EInteractionValidationState__None = 0,
	EInteractionValidationState__Predicted = 1,
	EInteractionValidationState__Authorized = 2,
	EInteractionValidationState__DeniedByRaceCondition = 3,
	EInteractionValidationState__DeniedByTimeout = 4,
	EInteractionValidationState__DeniedByError = 5,
	EInteractionValidationState__EInteractionValidationState_MAX = 6,

};

// Enum DeadByDaylight.ESecondaryActionRequestTypes
enum class DeadByDaylight_ESecondaryActionRequestTypes : uint8_t
{
	ESecondaryActionRequestTypes__None = 0,
	ESecondaryActionRequestTypes__SecondaryActionRequested = 1,
	ESecondaryActionRequestTypes__SecondaryActionRequestedFromCancel = 2,
	ESecondaryActionRequestTypes__ESecondaryActionRequestTypes_MAX = 3,

};

// Enum DeadByDaylight.ERadialProgressBarType
enum class DeadByDaylight_ERadialProgressBarType : uint8_t
{
	ERadialProgressBarType__Yellow = 0,
	ERadialProgressBarType__Red    = 1,
	ERadialProgressBarType__ERadialProgressBarType_MAX = 2,

};

// Enum DeadByDaylight.EPreLevelGenerationModifierType
enum class DeadByDaylight_EPreLevelGenerationModifierType : uint8_t
{
	EPreLevelGenerationModifierType__None = 0,
	EPreLevelGenerationModifierType__ModifyKillerObjectCount = 1,
	EPreLevelGenerationModifierType__EPreLevelGenerationModifierType_MAX = 2,

};

// Enum DeadByDaylight.ESurvivorGrouping
enum class DeadByDaylight_ESurvivorGrouping : uint8_t
{
	ESurvivorGrouping__Invalid     = 0,
	ESurvivorGrouping__Separated   = 1,
	ESurvivorGrouping__Grouped2    = 2,
	ESurvivorGrouping__Grouped3    = 3,
	ESurvivorGrouping__Grouped4    = 4,
	ESurvivorGrouping__ESurvivorGrouping_MAX = 5,

};

// Enum DeadByDaylight.EscapeStrategyType
enum class DeadByDaylight_EscapeStrategyType : uint8_t
{
	EscapeStrategyType__EscapeDoor = 0,
	EscapeStrategyType__EscapeHatch = 1,
	EscapeStrategyType__EscapeStrategyType_MAX = 2,

};

// Enum DeadByDaylight.ELevelBuildingState
enum class DeadByDaylight_ELevelBuildingState : uint8_t
{
	ELevelBuildingState__NotInitialized = 0,
	ELevelBuildingState__WaitingForInitialSync = 1,
	ELevelBuildingState__SyncSeeds = 2,
	ELevelBuildingState__GetAvailableItems = 3,
	ELevelBuildingState__PendingGettingItems = 4,
	ELevelBuildingState__GettingLevelsDone = 5,
	ELevelBuildingState__PendingPremadeMapStreaming = 6,
	ELevelBuildingState__GetThemedTiles = 7,
	ELevelBuildingState__PendingGettingTiles = 8,
	ELevelBuildingState__SpawnRequiredTiles = 9,
	ELevelBuildingState__SpawningLevelTiles = 10,
	ELevelBuildingState__SpawnInterTileElements = 11,
	ELevelBuildingState__PendingInterTileElementsSpawning = 12,
	ELevelBuildingState__SpawningActors = 13,
	ELevelBuildingState__SpawningMultiPassActors = 14,
	ELevelBuildingState__StallingForRemotes = 15,
	ELevelBuildingState__BuildingDone = 16,
	ELevelBuildingState__BuildingStateCount = 17,
	ELevelBuildingState__ELevelBuildingState_MAX = 18,

};

// Enum DeadByDaylight.EPromoPackContentType
enum class DeadByDaylight_EPromoPackContentType : uint8_t
{
	EPromoPackContentType__None    = 0,
	EPromoPackContentType__Item    = 1,
	EPromoPackContentType__Addon   = 2,
	EPromoPackContentType__Offering = 3,
	EPromoPackContentType__Character = 4,
	EPromoPackContentType__Customization = 5,
	EPromoPackContentType__Bonus   = 6,
	EPromoPackContentType__BloodPoints = 7,
	EPromoPackContentType__IridescentShards = 8,
	EPromoPackContentType__FreeTicket = 9,
	EPromoPackContentType__Count   = 10,
	EPromoPackContentType__EPromoPackContentType_MAX = 11,

};

// Enum DeadByDaylight.ERefundSource
enum class DeadByDaylight_ERefundSource : uint8_t
{
	ERefundSource__None            = 0,
	ERefundSource__BloodMarket     = 1,
	ERefundSource__DailyCalendar   = 2,
	ERefundSource__PromoPack       = 3,
	ERefundSource__Count           = 4,
	ERefundSource__ERefundSource_MAX = 5,

};

// Enum DeadByDaylight.ESaveGameErrorCategory
enum class DeadByDaylight_ESaveGameErrorCategory : uint8_t
{
	ESaveGameErrorCategory__EvaluateDisconnectPenalty = 0,
	ESaveGameErrorCategory__SaveGameSaveError = 1,
	ESaveGameErrorCategory__SaveGameUnreadable = 2,
	ESaveGameErrorCategory__SaveGameValidation = 3,
	ESaveGameErrorCategory__SaveFailed = 4,
	ESaveGameErrorCategory__ESaveGameErrorCategory_MAX = 5,

};

// Enum DeadByDaylight.EScreenType
enum class DeadByDaylight_EScreenType : uint8_t
{
	EScreenType__eScaleformScreen  = 0,
	EScreenType__eUMGScreen        = 1,
	EScreenType__eMixedScaleformUMG = 2,
	EScreenType__EScreenType_MAX   = 3,

};

// Enum DeadByDaylight.SettingsId
enum class DeadByDaylight_ESettingsId : uint8_t
{
	SettingsId__None               = 0,
	SettingsId__Language           = 1,
	SettingsId__RevokeConsent      = 2,
	SettingsId__BhvrAccount        = 3,
	SettingsId__AllowCrossplayGeneric = 4,
	SettingsId__AllowCrossplayLive = 5,
	SettingsId__AutoDeclineFriendRequests = 6,
	SettingsId__PlayerId           = 7,
	SettingsId__PartyPrivacy       = 8,
	SettingsId__Quality            = 9,
	SettingsId__AutoAdjust         = 10,
	SettingsId__Resolution         = 11,
	SettingsId__FullScreen         = 12,
	SettingsId__MenuScaleFactor    = 13,
	SettingsId__HudScaleFactor     = 14,
	SettingsId__SkillCheckScaleFactor = 15,
	SettingsId__LargeText          = 16,
	SettingsId__HUDPlayerNamesVisibility = 17,
	SettingsId__HUDKillerHookCountVisibility = 18,
	SettingsId__HUDScoreEventsVisibility = 19,
	SettingsId__MainVolume         = 20,
	SettingsId__MenuMusicVolume    = 21,
	SettingsId__Headphones         = 22,
	SettingsId__MuteOnFocusLost    = 23,
	SettingsId__InvertYAxis        = 24,
	SettingsId__SurvivorMouseSensitivity = 25,
	SettingsId__SurvivorControllerSensitivity = 26,
	SettingsId__KillerMouseSensitivity = 27,
	SettingsId__KillerControllerSensitivity = 28,
	SettingsId__ColorBarPalette    = 29,
	SettingsId__ColorBlindMode     = 30,
	SettingsId__ColorBlindModeIntensity = 31,
	SettingsId__BeginnerMode       = 32,
	SettingsId__Subtitles          = 33,
	SettingsId__SubtitlesBackgroundOpacity = 34,
	SettingsId__SubtitlesSize      = 35,
	SettingsId__SurvivorCameraSensitivity = 36,
	SettingsId__KillerCameraSensitivity = 37,
	SettingsId__MenuMusicVolumeOn  = 38,
	SettingsId__MainVolumeOn       = 39,
	SettingsId__AimAssist          = 40,
	SettingsId__SurvivorQuickTurn  = 41,
	SettingsId__KillerQuickTurn    = 42,
	SettingsId__FPSLimit           = 43,
	SettingsId__AutoQuality        = 44,
	SettingsId__ControlType        = 45,
	SettingsId__CustomizedControls = 46,
	SettingsId__DynamicResolution  = 47,
	SettingsId__InvertYAxisSurvivor = 48,
	SettingsId__SettingsId_MAX     = 49,

};

// Enum DeadByDaylight.SettingsSubCategory
enum class DeadByDaylight_ESettingsSubCategory : uint8_t
{
	SettingsSubCategory__None      = 0,
	SettingsSubCategory__Language  = 1,
	SettingsSubCategory__Tutorial  = 2,
	SettingsSubCategory__Subtitles = 3,
	SettingsSubCategory__Privacy   = 4,
	SettingsSubCategory__Online    = 5,
	SettingsSubCategory__Graphics  = 6,
	SettingsSubCategory__UIHud     = 7,
	SettingsSubCategory__Audio     = 8,
	SettingsSubCategory__CommonControls = 9,
	SettingsSubCategory__SurvivorControls = 10,
	SettingsSubCategory__KillerControls = 11,
	SettingsSubCategory__ColorBlindMode = 12,
	SettingsSubCategory__Atlanta   = 13,
	SettingsSubCategory__SettingsSubCategory_MAX = 14,

};

// Enum DeadByDaylight.SettingsCategory
enum class DeadByDaylight_ESettingsCategory : uint8_t
{
	SettingsCategory__None         = 0,
	SettingsCategory__General      = 1,
	SettingsCategory__Graphics     = 2,
	SettingsCategory__Audio        = 3,
	SettingsCategory__Controls     = 4,
	SettingsCategory__Atlanta      = 5,
	SettingsCategory__SettingsCategory_MAX = 6,

};

// Enum DeadByDaylight.SettingsType
enum class DeadByDaylight_ESettingsType : uint8_t
{
	SettingsType__None             = 0,
	SettingsType__Button           = 1,
	SettingsType__PlayerId         = 2,
	SettingsType__NumericStepper   = 3,
	SettingsType__Dropdown         = 4,
	SettingsType__ColorBar         = 5,
	SettingsType__TextStepper      = 6,
	SettingsType__BoolTextStepper  = 7,
	SettingsType__Checkbox         = 8,
	SettingsType__SettingsType_MAX = 9,

};

// Enum DeadByDaylight.EStoreUITag
enum class DeadByDaylight_EStoreUITag : uint8_t
{
	EStoreUITag__None              = 0,
	EStoreUITag__Sale              = 1,
	EStoreUITag__New               = 2,
	EStoreUITag__EStoreUITag_MAX   = 3,

};

// Enum DeadByDaylight.ECatalogStatus
enum class DeadByDaylight_ECatalogStatus : uint8_t
{
	ECatalogStatus__NotReady       = 0,
	ECatalogStatus__Updating       = 1,
	ECatalogStatus__Fetched        = 2,
	ECatalogStatus__ECatalogStatus_MAX = 3,

};

// Enum DeadByDaylight.EShopLoadProgress
enum class DeadByDaylight_EShopLoadProgress : uint8_t
{
	EShopLoadProgress__None        = 0,
	EShopLoadProgress__LoadCatalog = 1,
	EShopLoadProgress__LoadCurrencyPacks = 2,
	EShopLoadProgress__PlatformStoreCatalog = 3,
	EShopLoadProgress__Inventory   = 4,
	EShopLoadProgress__Wallet      = 5,
	EShopLoadProgress__FeaturedPageContent = 6,
	EShopLoadProgress__EShopLoadProgress_MAX = 7,

};

// Enum DeadByDaylight.ESoftBanReason
enum class DeadByDaylight_ESoftBanReason : uint8_t
{
	ESoftBanReason__Invalid        = 0,
	ESoftBanReason__Harassment     = 1,
	ESoftBanReason__Griefing       = 2,
	ESoftBanReason__Exploits       = 3,
	ESoftBanReason__Unsportsmanlike = 4,
	ESoftBanReason__Count          = 5,
	ESoftBanReason__ESoftBanReason_MAX = 6,

};

// Enum DeadByDaylight.ESoundIndicatorType
enum class DeadByDaylight_ESoundIndicatorType : uint8_t
{
	ESoundIndicatorType__None      = 0,
	ESoundIndicatorType__CloseNoiseIndicator = 1,
	ESoundIndicatorType__ExitOpenedIndicator = 2,
	ESoundIndicatorType__GeneratorIndicator = 3,
	ESoundIndicatorType__HatchIndicator = 4,
	ESoundIndicatorType__HookedIndicator = 5,
	ESoundIndicatorType__KillerCuesIndicator = 6,
	ESoundIndicatorType__GlobalSoundIndicator = 7,
	ESoundIndicatorType__DirectionalTerrorRadiusIndicator = 8,
	ESoundIndicatorType__ESoundIndicatorType_MAX = 9,

};

// Enum DeadByDaylight.ESpawnerStrategyType
enum class DeadByDaylight_ESpawnerStrategyType : uint8_t
{
	ESpawnerStrategyType__None     = 0,
	ESpawnerStrategyType__NoAccumulation = 1,
	ESpawnerStrategyType__LimitAccumulation = 2,
	ESpawnerStrategyType__ESpawnerStrategyType_MAX = 3,

};

// Enum DeadByDaylight.ESpecialEventDependency
enum class DeadByDaylight_ESpecialEventDependency : uint8_t
{
	ESpecialEventDependency__None  = 0,
	ESpecialEventDependency__Archives = 1,
	ESpecialEventDependency__ESpecialEventDependency_MAX = 2,

};

// Enum DeadByDaylight.ESpecialEventGameMode
enum class DeadByDaylight_ESpecialEventGameMode : uint8_t
{
	ESpecialEventGameMode__Progression = 0,
	ESpecialEventGameMode__Counter = 1,
	ESpecialEventGameMode__Collection = 2,
	ESpecialEventGameMode__ESpecialEventGameMode_MAX = 3,

};

// Enum DeadByDaylight.ESpecialEventStatus
enum class DeadByDaylight_ESpecialEventStatus : uint8_t
{
	ESpecialEventStatus__Inactive  = 0,
	ESpecialEventStatus__ActiveMain = 1,
	ESpecialEventStatus__ActivePost = 2,
	ESpecialEventStatus__ESpecialEventStatus_MAX = 3,

};

// Enum DeadByDaylight.ELoadCompleteState
enum class DeadByDaylight_ELoadCompleteState : uint8_t
{
	ELoadCompleteState__InProgress = 0,
	ELoadCompleteState__Success    = 1,
	ELoadCompleteState__ReloginRequested = 2,
	ELoadCompleteState__FailedEAC  = 3,
	ELoadCompleteState__FailedRecoverable = 4,
	ELoadCompleteState__FailedRecoverableProfileLoad = 5,
	ELoadCompleteState__FailedUnequipedDisableditems = 6,
	ELoadCompleteState__FailedBlocking = 7,
	ELoadCompleteState__FailedBlockingNoDBDServer = 8,
	ELoadCompleteState__FailedBlockingNotConnected = 9,
	ELoadCompleteState__FailedBlockedNoNetworkConnection = 10,
	ELoadCompleteState__FailedBlockingSharedAuthenticationFailed = 11,
	ELoadCompleteState__FailedBlockingPlatformNotAuthenticated = 12,
	ELoadCompleteState__FailedBlockingPlatformSubsystemNotInitialized = 13,
	ELoadCompleteState__FailedBlockingOnlinePresenceNotInitialized = 14,
	ELoadCompleteState__FailedBlockingPlatformNetUniqueIdInvalid = 15,
	ELoadCompleteState__FailedBlockingInvalidLocalPlayer = 16,
	ELoadCompleteState__FailedBlockingInvalidGameObjects = 17,
	ELoadCompleteState__FailedBlockingInvalidSDA = 18,
	ELoadCompleteState__FailedBlockingInvalidClientVersion = 19,
	ELoadCompleteState__FailedBlockingInvalidAtlantaClientVersion = 20,
	ELoadCompleteState__FailedBlockingWindowsStoreAccountNotLoggedIn = 21,
	ELoadCompleteState__FailedBlockingSSLCACert = 22,
	ELoadCompleteState__FailedBlockingUserCancelled = 23,
	ELoadCompleteState__FailedBlockingCDNFailure = 24,
	ELoadCompleteState__FailedBlockingCDNContentError = 25,
	ELoadCompleteState__FailedBlockingCDNCantFindContentToDownload = 26,
	ELoadCompleteState__FailedBlockingCDNNoPatchForCurrentPlatformAndVersion = 27,
	ELoadCompleteState__FailedBlockingCDNNotEnoughDiskSpace = 28,
	ELoadCompleteState__FailedBlockingCDNFailureToRetrieveContent = 29,
	ELoadCompleteState__FailedRecoverableCDNUserCancelled = 30,
	ELoadCompleteState__FailedBlockingVersionFileError = 31,
	ELoadCompleteState__FailedBlockingRTMConnection = 32,
	ELoadCompleteState__FailedBlockingMaxTrialsReached = 33,
	ELoadCompleteState__FailedBlockingMirrorsHealthCheckFailed = 34,
	ELoadCompleteState__FailedBlockingTutorialRewardsFetchFailed = 35,
	ELoadCompleteState__ELoadCompleteState_MAX = 36,

};

// Enum DeadByDaylight.EExternalEffectSource
enum class DeadByDaylight_EExternalEffectSource : uint8_t
{
	EExternalEffectSource__None    = 0,
	EExternalEffectSource__Perk    = 1,
	EExternalEffectSource__Addon   = 2,
	EExternalEffectSource__Power   = 3,
	EExternalEffectSource__EExternalEffectSource_MAX = 4,

};

// Enum DeadByDaylight.EStoreBannerLocation
enum class DeadByDaylight_EStoreBannerLocation : uint8_t
{
	EStoreBannerLocation__Primary  = 0,
	EStoreBannerLocation__Secondary = 1,
	EStoreBannerLocation__EStoreBannerLocation_MAX = 2,

};

// Enum DeadByDaylight.EInteractionStorerRole
enum class DeadByDaylight_EInteractionStorerRole : uint8_t
{
	EInteractionStorerRole__None   = 0,
	EInteractionStorerRole__AuthorityAndAutonomousProxy = 1,
	EInteractionStorerRole__ClientAndAutonomousProxy = 2,
	EInteractionStorerRole__AuthorityAndSimulatedProxy = 3,
	EInteractionStorerRole__ClientAndSimulatedProxy = 4,
	EInteractionStorerRole__EInteractionStorerRole_MAX = 5,

};

// Enum DeadByDaylight.ETextBannerPosition
enum class DeadByDaylight_ETextBannerPosition : uint8_t
{
	ETextBannerPosition__TopLeft   = 0,
	ETextBannerPosition__MiddleLeft = 1,
	ETextBannerPosition__BottomLeft = 2,
	ETextBannerPosition__MiddleRight = 3,
	ETextBannerPosition__BottomRight = 4,
	ETextBannerPosition__TopCenter = 5,
	ETextBannerPosition__MiddleCenter = 6,
	ETextBannerPosition__BottomCenter = 7,
	ETextBannerPosition__ETextBannerPosition_MAX = 8,

};

// Enum DeadByDaylight.EStorefrontState
enum class DeadByDaylight_EStorefrontState : uint8_t
{
	EStorefrontState__None         = 0,
	EStorefrontState__Character    = 1,
	EStorefrontState__Currency     = 2,
	EStorefrontState__Customization = 3,
	EStorefrontState__Featured     = 4,
	EStorefrontState__PromoPacks   = 5,
	EStorefrontState__ShrineOfSecrets = 6,
	EStorefrontState__Subscriptions = 7,
	EStorefrontState__LandingPage  = 8,
	EStorefrontState__Count        = 9,
	EStorefrontState__EStorefrontState_MAX = 10,

};

// Enum DeadByDaylight.EStoreTab
enum class DeadByDaylight_EStoreTab : uint8_t
{
	EStoreTab__Featured            = 0,
	EStoreTab__Characters          = 1,
	EStoreTab__Currency            = 2,
	EStoreTab__ShrineOfSecrets     = 3,
	EStoreTab__TabCount            = 4,
	EStoreTab__EStoreTab_MAX       = 5,

};

// Enum DeadByDaylight.EStoreState
enum class DeadByDaylight_EStoreState : uint8_t
{
	EStoreState__None              = 0,
	EStoreState__Featured          = 1,
	EStoreState__CharacterSelection = 2,
	EStoreState__CharacterStory    = 3,
	EStoreState__CharacterCatalog  = 4,
	EStoreState__BuyCurrency       = 5,
	EStoreState__ShrineOfSecrets   = 6,
	EStoreState__EStoreState_MAX   = 7,

};

// Enum DeadByDaylight.EStoryNodeState
enum class DeadByDaylight_EStoryNodeState : uint8_t
{
	EStoryNodeState__None          = 0,
	EStoryNodeState__Unavailable   = 1,
	EStoryNodeState__AvailableDefault = 2,
	EStoryNodeState__AvailableActive = 3,
	EStoryNodeState__AvailablePaused = 4,
	EStoryNodeState__Completed     = 5,
	EStoryNodeState__Claimed       = 6,
	EStoryNodeState__EStoryNodeState_MAX = 7,

};

// Enum DeadByDaylight.EStreamVideoDataType
enum class DeadByDaylight_EStreamVideoDataType : uint8_t
{
	EStreamVideoDataType__None     = 0,
	EStreamVideoDataType__LoreCinematic = 1,
	EStreamVideoDataType__SurvivorTutorial = 2,
	EStreamVideoDataType__KillerTutorial = 3,
	EStreamVideoDataType__Count    = 4,
	EStreamVideoDataType__EStreamVideoDataType_MAX = 5,

};

// Enum DeadByDaylight.ESubscriptionRewardType
enum class DeadByDaylight_ESubscriptionRewardType : uint8_t
{
	ESubscriptionRewardType__None  = 0,
	ESubscriptionRewardType__Item  = 1,
	ESubscriptionRewardType__AddOn = 2,
	ESubscriptionRewardType__Offering = 3,
	ESubscriptionRewardType__FreeTicket = 4,
	ESubscriptionRewardType__AuricCells = 5,
	ESubscriptionRewardType__BloodPoints = 6,
	ESubscriptionRewardType__IridescentShards = 7,
	ESubscriptionRewardType__Customization = 8,
	ESubscriptionRewardType__Character = 9,
	ESubscriptionRewardType__ESubscriptionRewardType_MAX = 10,

};

// Enum DeadByDaylight.ETotemState
enum class DeadByDaylight_ETotemState : uint8_t
{
	ETotemState__Cleansed          = 0,
	ETotemState__Dull              = 1,
	ETotemState__Hex               = 2,
	ETotemState__Boon              = 3,
	ETotemState__ETotemState_MAX   = 4,

};

// Enum DeadByDaylight.EPromptType
enum class DeadByDaylight_EPromptType : uint8_t
{
	EPromptType__None              = 0,
	EPromptType__ExitsPowered      = 1,
	EPromptType__HatchSpawned      = 2,
	EPromptType__HatchOpened       = 3,
	EPromptType__EPromptType_MAX   = 4,

};

// Enum DeadByDaylight.ENotificationStyle
enum class DeadByDaylight_ENotificationStyle : uint8_t
{
	ENotificationStyle__None       = 0,
	ENotificationStyle__Game       = 1,
	ENotificationStyle__Tutorial   = 2,
	ENotificationStyle__ENotificationStyle_MAX = 3,

};

// Enum DeadByDaylight.EPromptPriority
enum class DeadByDaylight_EPromptPriority : uint8_t
{
	EPromptPriority__Tutorial      = 0,
	EPromptPriority__High          = 1,
	EPromptPriority__Medium        = 2,
	EPromptPriority__Low           = 3,
	EPromptPriority__EPromptPriority_MAX = 4,

};

// Enum DeadByDaylight.ELegalTermsStatus
enum class DeadByDaylight_ELegalTermsStatus : uint8_t
{
	ELegalTermsStatus__None        = 0,
	ELegalTermsStatus__Accepted    = 1,
	ELegalTermsStatus__Declined    = 2,
	ELegalTermsStatus__ELegalTermsStatus_MAX = 3,

};

// Enum DeadByDaylight.ENewContentType
enum class DeadByDaylight_ENewContentType : uint8_t
{
	ENewContentType__COMING_SOON   = 0,
	ENewContentType__NEW_CONTENT   = 1,
	ENewContentType__PATCH_NOTES   = 2,
	ENewContentType__DEV_MESSAGES  = 3,
	ENewContentType__EVENTS        = 4,
	ENewContentType__ENewContentType_MAX = 5,

};

// Enum DeadByDaylight.EOverlayButtonOptions
enum class DeadByDaylight_EOverlayButtonOptions : uint8_t
{
	EOverlayButtonOptions__HIDDEN  = 0,
	EOverlayButtonOptions__DISABLED = 1,
	EOverlayButtonOptions__ENABLED = 2,
	EOverlayButtonOptions__EOverlayButtonOptions_MAX = 3,

};

// Enum DeadByDaylight.ESlasherMatchResultScore
enum class DeadByDaylight_ESlasherMatchResultScore : uint8_t
{
	DisgracefulDefeat              = 0,
	EntityDispleased               = 1,
	BrutalKiller                   = 2,
	RuthlessKiller                 = 3,
	MercilessKiller                = 4,
	ESlasherMatchResultScore_MAX   = 5,

};

// Enum DeadByDaylight.EUIControllerType
enum class DeadByDaylight_EUIControllerType : uint8_t
{
	EUIControllerType__KeyboardMouse = 0,
	EUIControllerType__GamePad     = 1,
	EUIControllerType__EUIControllerType_MAX = 2,

};

// Enum DeadByDaylight.EScreenShotBatching
enum class DeadByDaylight_EScreenShotBatching : uint8_t
{
	EScreenShotBatching__SelectedItemOrOutfit = 0,
	EScreenShotBatching__SelectedCharacter = 1,
	EScreenShotBatching__SelectedCharacterAndCategory = 2,
	EScreenShotBatching__ItemsMissingIcon = 3,
	EScreenShotBatching__AllItems  = 4,
	EScreenShotBatching__SelectedCharacterOutfits = 5,
	EScreenShotBatching__AllOutfits = 6,
	EScreenShotBatching__AllCharms = 7,
	EScreenShotBatching__EScreenShotBatching_MAX = 8,

};

// Enum DeadByDaylight.ELeaveLobbyReason
enum class DeadByDaylight_ELeaveLobbyReason : uint8_t
{
	ELeaveLobbyReason__eNone       = 0,
	ELeaveLobbyReason__eNetworkDisconnect = 1,
	ELeaveLobbyReason__eProfileOffline = 2,
	ELeaveLobbyReason__eAppSuspended = 3,
	ELeaveLobbyReason__eInternetDisconnect = 4,
	ELeaveLobbyReason__eHostDisconnect = 5,
	ELeaveLobbyReason__eDLCInstalled = 6,
	ELeaveLobbyReason__eTrialExtensionExpired = 7,
	ELeaveLobbyReason__ePartyManagementError = 8,
	ELeaveLobbyReason__ELeaveLobbyReason_MAX = 9,

};

// Enum DeadByDaylight.EFriendSearchPanelOption
enum class DeadByDaylight_EFriendSearchPanelOption : uint8_t
{
	EFriendSearchPanelOption__NotFoundPanel = 0,
	EFriendSearchPanelOption__NonFriendPanel = 1,
	EFriendSearchPanelOption__FriendRequestReceivedPanel = 2,
	EFriendSearchPanelOption__FriendRequestSentPanel = 3,
	EFriendSearchPanelOption__FriendPanel = 4,
	EFriendSearchPanelOption__IsOwnerPanel = 5,
	EFriendSearchPanelOption__EFriendSearchPanelOption_MAX = 6,

};

// Enum DeadByDaylight.EFriendContainerType
enum class DeadByDaylight_EFriendContainerType : uint8_t
{
	EFriendContainerType__Connected = 0,
	EFriendContainerType__Disconnected = 1,
	EFriendContainerType__PendingSentRequest = 2,
	EFriendContainerType__RecentlyPlayed = 3,
	EFriendContainerType__SocialSuggestions = 4,
	EFriendContainerType__PendingReceivedRequest = 5,
	EFriendContainerType__QueriedPlayer = 6,
	EFriendContainerType__Unknown  = 7,
	EFriendContainerType__EFriendContainerType_MAX = 8,

};

// Enum DeadByDaylight.EPurchasePopupState
enum class DeadByDaylight_EPurchasePopupState : uint8_t
{
	EPurchasePopupState__Information = 0,
	EPurchasePopupState__TitleOnly = 1,
	EPurchasePopupState__EPurchasePopupState_MAX = 2,

};

// Enum DeadByDaylight.EAtlantaSettingMenuType
enum class DeadByDaylight_EAtlantaSettingMenuType : uint8_t
{
	EAtlantaSettingMenuType__TabButton = 0,
	EAtlantaSettingMenuType__AlwaysDisplay = 1,
	EAtlantaSettingMenuType__EAtlantaSettingMenuType_MAX = 2,

};

// Enum DeadByDaylight.EBloodStoreRowStyle
enum class DeadByDaylight_EBloodStoreRowStyle : uint8_t
{
	EBloodStoreRowStyle__FiveItemRow = 0,
	EBloodStoreRowStyle__ThreeItemRow = 1,
	EBloodStoreRowStyle__EBloodStoreRowStyle_MAX = 2,

};

// Enum DeadByDaylight.EButtonType
enum class DeadByDaylight_EButtonType : uint8_t
{
	EButtonType__None              = 0,
	EButtonType__AttackButton      = 1,
	EButtonType__PowerButton       = 2,
	EButtonType__CancelButton      = 3,
	EButtonType__SettingsButton    = 4,
	EButtonType__SecondaryActionButton = 5,
	EButtonType__PowerAttackJoystick = 6,
	EButtonType__EButtonType_MAX   = 7,

};

// Enum DeadByDaylight.EInboxMessageTimeUnit
enum class DeadByDaylight_EInboxMessageTimeUnit : uint8_t
{
	EInboxMessageTimeUnit__Days    = 0,
	EInboxMessageTimeUnit__Hours   = 1,
	EInboxMessageTimeUnit__Minutes = 2,
	EInboxMessageTimeUnit__EInboxMessageTimeUnit_MAX = 3,

};

// Enum DeadByDaylight.EInboxMessageUIState
enum class DeadByDaylight_EInboxMessageUIState : uint8_t
{
	EInboxMessageUIState__New      = 0,
	EInboxMessageUIState__Read     = 1,
	EInboxMessageUIState__Archived = 2,
	EInboxMessageUIState__EInboxMessageUIState_MAX = 3,

};

// Enum DeadByDaylight.EInboxMessageUIType
enum class DeadByDaylight_EInboxMessageUIType : uint8_t
{
	EInboxMessageUIType__None      = 0,
	EInboxMessageUIType__Social    = 1,
	EInboxMessageUIType__Rewards   = 2,
	EInboxMessageUIType__News      = 3,
	EInboxMessageUIType__EInboxMessageUIType_MAX = 4,

};

// Enum DeadByDaylight.EPartyPlayerSlotWidgetState
enum class DeadByDaylight_EPartyPlayerSlotWidgetState : uint8_t
{
	EPartyPlayerSlotWidgetState__None = 0,
	EPartyPlayerSlotWidgetState__Empty = 1,
	EPartyPlayerSlotWidgetState__NotReady = 2,
	EPartyPlayerSlotWidgetState__Ready = 3,
	EPartyPlayerSlotWidgetState__Hidden = 4,
	EPartyPlayerSlotWidgetState__EPartyPlayerSlotWidgetState_MAX = 5,

};

// Enum DeadByDaylight.ERewardLayoutBox
enum class DeadByDaylight_ERewardLayoutBox : uint8_t
{
	ERewardLayoutBox__Top          = 0,
	ERewardLayoutBox__Bottom       = 1,
	ERewardLayoutBox__ERewardLayoutBox_MAX = 2,

};

// Enum DeadByDaylight.ESettingScreenButtonData
enum class DeadByDaylight_ESettingScreenButtonData : uint8_t
{
	ESettingScreenButtonData__PRIVACY = 0,
	ESettingScreenButtonData__EULA = 1,
	ESettingScreenButtonData__CREDITS = 2,
	ESettingScreenButtonData__SURVIVORTUTORIAL = 3,
	ESettingScreenButtonData__KILLERTUTORIAL = 4,
	ESettingScreenButtonData__SURVIVORCINEMATIC = 5,
	ESettingScreenButtonData__KILLERCINEMATIC = 6,
	ESettingScreenButtonData__LORECINEMATIC = 7,
	ESettingScreenButtonData__COMMUNITY = 8,
	ESettingScreenButtonData__PLAYERCLOUDID = 9,
	ESettingScreenButtonData__SUBSCRIBE = 10,
	ESettingScreenButtonData__TERMSOFUSE = 11,
	ESettingScreenButtonData__ESettingScreenButtonData_MAX = 12,

};

// Enum DeadByDaylight.ENavigationState
enum class DeadByDaylight_ENavigationState : uint8_t
{
	ENavigationState__RoleSelection = 0,
	ENavigationState__Customization = 1,
	ENavigationState__CharacterSelection = 2,
	ENavigationState__Lobby        = 3,
	ENavigationState__BloodStore   = 4,
	ENavigationState__None         = 5,
	ENavigationState__ENavigationState_MAX = 6,

};

// Enum DeadByDaylight.EInventoryButtonState
enum class DeadByDaylight_EInventoryButtonState : uint8_t
{
	EInventoryButtonState__StateDisabled = 0,
	EInventoryButtonState__StateEmpty = 1,
	EInventoryButtonState__StateLocked = 2,
	EInventoryButtonState__StateWithItem = 3,
	EInventoryButtonState__StateWithItemDisabled = 4,
	EInventoryButtonState__StateWithItemLocked = 5,
	EInventoryButtonState__StatePrivate = 6,
	EInventoryButtonState__EInventoryButtonState_MAX = 7,

};

// Enum DeadByDaylight.EFogScreenButton
enum class DeadByDaylight_EFogScreenButton : uint8_t
{
	EFogScreenButton__AddCurrency  = 0,
	EFogScreenButton__Setting      = 1,
	EFogScreenButton__Chat         = 2,
	EFogScreenButton__EFogScreenButton_MAX = 3,

};

// Enum DeadByDaylight.ERoleSelectionScreenButton
enum class DeadByDaylight_ERoleSelectionScreenButton : uint8_t
{
	ERoleSelectionScreenButton__DailyRitual = 0,
	ERoleSelectionScreenButton__Inbox = 1,
	ERoleSelectionScreenButton__InviteFriend = 2,
	ERoleSelectionScreenButton__Setting = 3,
	ERoleSelectionScreenButton__Marketing = 4,
	ERoleSelectionScreenButton__Events = 5,
	ERoleSelectionScreenButton__ERoleSelectionScreenButton_MAX = 6,

};

// Enum DeadByDaylight.ENavigationScreenButton
enum class DeadByDaylight_ENavigationScreenButton : uint8_t
{
	ENavigationScreenButton__AddCurrency = 0,
	ENavigationScreenButton__Back  = 1,
	ENavigationScreenButton__Bloodweb = 2,
	ENavigationScreenButton__ChangeRole = 3,
	ENavigationScreenButton__CharacterSelection = 4,
	ENavigationScreenButton__Customization = 5,
	ENavigationScreenButton__InviteFriend = 6,
	ENavigationScreenButton__Loadout = 7,
	ENavigationScreenButton__Start = 8,
	ENavigationScreenButton__Subscriptions = 9,
	ENavigationScreenButton__EditCustomGame = 10,
	ENavigationScreenButton__CustomGameRequestRole = 11,
	ENavigationScreenButton__ENavigationScreenButton_MAX = 12,

};

// Enum DeadByDaylight.EInboxScreenButton
enum class DeadByDaylight_EInboxScreenButton : uint8_t
{
	EInboxScreenButton__Rewards    = 0,
	EInboxScreenButton__Social     = 1,
	EInboxScreenButton__News       = 2,
	EInboxScreenButton__Back       = 3,
	EInboxScreenButton__EInboxScreenButton_MAX = 4,

};

// Enum DeadByDaylight.ETallyListPageID
enum class DeadByDaylight_ETallyListPageID : uint8_t
{
	ETallyListPageID__Scoreboard   = 0,
	ETallyListPageID__Bloodpoints  = 1,
	ETallyListPageID__Rank         = 2,
	ETallyListPageID__PlayerLevel  = 3,
	ETallyListPageID__CharacterLevel = 4,
	ETallyListPageID__NumberOfPages = 5,
	ETallyListPageID__ETallyListPageID_MAX = 6,

};

// Enum DeadByDaylight.EToastWidgetType
enum class DeadByDaylight_EToastWidgetType : uint8_t
{
	EToastWidgetType__Simple       = 0,
	EToastWidgetType__Interactable = 1,
	EToastWidgetType__EToastWidgetType_MAX = 2,

};

// Enum DeadByDaylight.ELinkedVomitState
enum class DeadByDaylight_ELinkedVomitState : uint8_t
{
	ELinkedVomitState__Idle        = 0,
	ELinkedVomitState__Charging    = 1,
	ELinkedVomitState__Vomiting    = 2,
	ELinkedVomitState__ELinkedVomitState_MAX = 3,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct DeadByDaylight.SecondaryInteractionProperties
// 0x0038
struct FSecondaryInteractionProperties
{
	struct FString                                     SecondaryInteractionID;                                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInputInteractionType               SecondaryInteractionInputType;                             // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GEYZ[0x7];                                     // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       SecondaryInteractionDescriptionText;                       // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               ShouldShow;                                                // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_APW5[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.PlayerSavedProfileDataShared
// 0x0050
struct FPlayerSavedProfileDataShared
{
	struct FString                                     playerName;                                                // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SelectedCamperIndex;                                       // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SelectedSlasherIndex;                                      // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               SelectedCharacterCustomization;                            // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharmIdSlot>                        SelectedCharacterCharms;                                   // 0x0028(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CamperStreak;                                              // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ShowPortraitBorder;                                        // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasActiveSubscription;                                     // 0x003D(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CGD0[0x2];                                     // 0x003E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     PlatformId;                                                // 0x0040(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct DeadByDaylight.FearMarketItemInstance
// 0x0018
struct FFearMarketItemInstance
{
	struct FName                                       ItemId;                                                    // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Cost;                                                      // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                BloodpointConversion;                                      // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Purchased;                                                 // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J84M[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.FearMarketOfferingInstance
// 0x0020
struct FFearMarketOfferingInstance
{
	TArray<struct FFearMarketItemInstance>             ObjectsForSale;                                            // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   StartTime;                                                 // 0x0010(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   EndTime;                                                   // 0x0018(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ArrayOfSceneComponent
// 0x0010
struct FArrayOfSceneComponent
{
	TArray<class USceneComponent*>                     sceneComp;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ManagedGameplayElementData
// 0x0050
struct FManagedGameplayElementData
{
	unsigned char                                      UnknownData_5LYS[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UActorSpawner*>                       ActivatedSpawners;                                         // 0x0008(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorSpawner*>                       RemovedSpawners;                                           // 0x0018(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EGameplayElementType                PopulationType;                                            // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_B9F2[0x3];                                     // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              CurrentPopulationCost;                                     // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxPopulationCost;                                         // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MinPopulationCost;                                         // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MapWidth;                                                  // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinProximityBetweenElements;                               // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinDistSqrBetweenElements;                                 // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TileWidth;                                                 // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FactorToAdjustToWhenOutOfProximity;                        // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SSNL[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.Dependency
// 0x0038
struct FDependency
{
	DeadByDaylight_ETileSpawnPointType                 Type;                                                      // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_OQUA[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSoftObjectPath                             AssetReference;                                            // 0x0008(0x0020) (Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                      Object;                                                    // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               Unique;                                                    // 0x0030(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_Q83V[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                count;                                                     // 0x0034(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct DeadByDaylight.ForceSpawnTileData
// 0x0020
struct FForceSpawnTileData
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                matrixX;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                matrixY;                                                   // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Rotation;                                                  // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JFRC[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.GeneratedLevelData
// 0x02A0
struct FGeneratedLevelData
{
	struct FString                                     UsedPaperTileMap;                                          // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     PremadeMap;                                                // 0x0010(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                StreamRelatedSeed;                                         // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                AvailableEscapeCount;                                      // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                AvailableSurvivorItemCount;                                // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_ESurvivorGrouping                   GroupingType;                                              // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VH6N[0x3];                                     // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USceneComponent*                             KillerSpawnPoint;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     SurvivorSpawnPoints;                                       // 0x0038(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     InteractableElementsSpawnPoints;                           // 0x0048(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FName, int>                            SpecialBehaviourRequestCounts;                             // 0x0058(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FName, struct FArrayOfSceneComponent>  SpecialBehaviourSpawnPoints;                               // 0x00A8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     SearchableSpawners;                                        // 0x00F8(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     HexSpawners;                                               // 0x0108(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     KillerLairSpawners;                                        // 0x0118(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     HatchSpawners;                                             // 0x0128(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     MainBuildingHatchSpawners;                                 // 0x0138(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     ShackHatchSpawners;                                        // 0x0148(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     BreakableWallSpawners;                                     // 0x0158(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USceneComponent*>                     EscapeSpawners;                                            // 0x0168(0x0010) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FManagedGameplayElementData                 BookshelfManagedGameplayElementData;                       // 0x0178(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FManagedGameplayElementData                 MeatHookManagedGameplayElementData;                        // 0x01C8(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FDependency>                         levelDependencies;                                         // 0x0218(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              FixedMapTileIds;                                           // 0x0228(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              FixedMapOrphanSpawners;                                    // 0x0238(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SpecialEventId;                                            // 0x0248(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseForcedMap;                                              // 0x0254(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UsePremadeMap;                                             // 0x0255(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PV09[0x2];                                     // 0x0256(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     GenerationLogs;                                            // 0x0258(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     GenerationErrors;                                          // 0x0268(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                GenerationPlayerCount;                                     // 0x0278(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_O0ZI[0x4];                                     // 0x027C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FForceSpawnTileData>                 ForceSpawnTileData;                                        // 0x0280(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              LevelLightings;                                            // 0x0290(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.PromoPackContentTypeData
// 0x0060
struct FPromoPackContentTypeData
{
	unsigned char                                      CorrespondingWidget[0x30];                                 // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      ContentTypeIcon[0x30];                                     // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct DeadByDaylight.SimpleCharacterDropdown
// 0x0004
struct FSimpleCharacterDropdown
{
	int                                                characterId;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ShopTransactionItemParameters
// 0x0028
struct FShopTransactionItemParameters
{
	int                                                ItemAmount;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W7SC[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     ItemName;                                                  // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ItemType;                                                  // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ShopTransactionItem
// 0x0028
struct FShopTransactionItem
{
	struct FShopTransactionItemParameters              Item;                                                      // 0x0000(0x0028) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ShopTransactionItemProducts
// 0x0010
struct FShopTransactionItemProducts
{
	TArray<struct FShopTransactionItem>                Items;                                                     // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ShopTransactionItemCustomData
// 0x0030
struct FShopTransactionItemCustomData
{
	struct FShopTransactionItemProducts                productsReceived;                                          // 0x0000(0x0010) (NativeAccessSpecifierPublic)
	struct FString                                     transactionName;                                           // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     TransactionType;                                           // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SkillCheckDefinition
// 0x0024
struct FSkillCheckDefinition
{
	float                                              SuccessZoneStart;                                          // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SuccessZoneEnd;                                            // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BonusZoneLength;                                           // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BonusZoneStart;                                            // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ProgressRate;                                              // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartingTickerPosition;                                    // 0x0014(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsDeactivatedAfterResponse;                                // 0x0018(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LA0U[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              WarningSoundDelay;                                         // 0x001C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsAudioMuted;                                              // 0x0020(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsJittering;                                               // 0x0021(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsSuccessZoneMirrorred;                                    // 0x0022(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsInsane;                                                  // 0x0023(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SkillCheckResponse
// 0x0018
struct FSkillCheckResponse
{
	float                                              ChargeChange;                                              // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsTriggeredByInput;                                        // 0x0004(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsSuccessful;                                              // 0x0005(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsBonus;                                                   // 0x0006(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsInsane;                                                  // 0x0007(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsTriggeringLoudNoise;                                     // 0x0008(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               FailedCountedAsGood;                                       // 0x0009(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_ESkillCheckCustomType               Type;                                                      // 0x000A(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6TWW[0x5];                                     // 0x000B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UChargeableInteractionDefinition*            Interaction;                                               // 0x0010(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SpawnPopulationHandler
// 0x00C8
struct FSpawnPopulationHandler
{
	unsigned char                                      UnknownData_NBQD[0xB8];                                    // 0x0000(0x00B8) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class USceneComponent*>                     _allAvailableSpawners;                                     // 0x00B8(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.SpecialEventObjectiveData
// 0x00E0
struct FSpecialEventObjectiveData
{
	struct FName                                       ObjectiveId;                                               // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HLPC[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Title;                                                     // 0x0010(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FText                                       Description;                                               // 0x0028(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FString                                     IconPath;                                                  // 0x0040(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ObjectiveFrameLabel;                                       // 0x0050(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       CompletedTitle;                                            // 0x0060(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FText                                       CompletedDescription;                                      // 0x0078(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FName                                       RewardId;                                                  // 0x0090(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K6DD[0x4];                                     // 0x009C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     LockedRewardGenericIconPath;                               // 0x00A0(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     UnlockedRewardGenericIconPath;                             // 0x00B0(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EPlayerRole                         PlayerRole;                                                // 0x00C0(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AROE[0x7];                                     // 0x00C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     StatName;                                                  // 0x00C8(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           Sections;                                                  // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           MaxValue;                                                  // 0x00DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SpecialEventEntryPopupData
// 0x0068
struct FSpecialEventEntryPopupData
{
	struct FText                                       Title;                                                     // 0x0000(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FText                                       Description;                                               // 0x0018(0x0018) (Edit, NativeAccessSpecifierPublic)
	struct FString                                     ImagePath;                                                 // 0x0030(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     FrameLabel;                                                // 0x0040(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       ImageBannerText;                                           // 0x0050(0x0018) (Edit, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SpecialEventCinematicData
// 0x0028
struct FSpecialEventCinematicData
{
	struct FDateTime                                   StartTime;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       VideoThumbnailId;                                          // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MK6F[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     VideoIconPath;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SpecialEventData
// 0x0170 (0x0178 - 0x0008)
struct FSpecialEventData : public FDBDTableRowBase
{
	struct FName                                       EventId;                                                   // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_ECurrencyType                       currencyType;                                              // 0x0014(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KZP3[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       EventName;                                                 // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FString                                     EventBannerLabel;                                          // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsTrackedOnline;                                           // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseSpecialEventLoadingScreen;                              // 0x0041(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5HNO[0x6];                                     // 0x0042(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FSpecialEventObjectiveData>          Objectives;                                                // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                      ObjectOutlineColour;                                       // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7V0I[0x4];                                     // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     LobbyName;                                                 // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ShopName;                                                  // 0x0070(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       AudioStateSpecialEvent;                                    // 0x0080(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UH20[0x4];                                     // 0x008C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      GameplayPlayerComponent[0x30];                             // 0x008C(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      GameplayStateComponent[0x30];                              // 0x00C0(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	TArray<struct FSpecialEventCinematicData>          Cinematics;                                                // 0x00F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_ESpecialEventGameMode               gameMode;                                                  // 0x0100(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseEventEntryScreen;                                       // 0x0101(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_X4J6[0x6];                                     // 0x0102(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSpecialEventEntryPopupData                 EventEntryData;                                            // 0x0108(0x0068) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	DeadByDaylight_ESpecialEventDependency             EventDependency;                                           // 0x0170(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VIGT[0x7];                                     // 0x0171(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.SpecialEventLoadingTextData
// 0x0050 (0x0058 - 0x0008)
struct FSpecialEventLoadingTextData : public FDBDTableRowBase
{
	struct FName                                       EventId;                                                   // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TJQF[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Title;                                                     // 0x0018(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FText                                       Description;                                               // 0x0030(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FString                                     IconPath;                                                  // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CustomTransformation
// 0x0014
struct FCustomTransformation
{
	bool                                               UseCustomTransformation;                                   // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_SLKW[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector2D                                   CustomScale;                                               // 0x0004(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                                   CustomTranslation;                                         // 0x000C(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.ItemUIData
// 0x00C0
struct FItemUIData
{
	struct FText                                       DisplayName;                                               // 0x0000(0x0018) (Edit, NativeAccessSpecifierPrivate)
	struct FText                                       Description;                                               // 0x0018(0x0018) (Edit, NativeAccessSpecifierPrivate)
	TArray<struct FString>                             IconFilePathList;                                          // 0x0030(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      IconAssetList[0x10];                                       // 0x0040(0x0010) UNKNOWN PROPERTY: ArrayProperty
	struct FCustomTransformation                       CustomTransformation;                                      // 0x0050(0x0014) (Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint32_t                                           PlatformsUnlicensedNameOverride;                           // 0x0064(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32_t                                           PlatformsUnlicensedDescriptionOverride;                    // 0x0068(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32_t                                           PlatformsForIconUnlicensedFilePathListOverride;            // 0x006C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FString>                             IconUnlicensedFilePathListOverride;                        // 0x0070(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               LicenseExpirationOverride;                                 // 0x0080(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_V1F5[0x7];                                     // 0x0081(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       DisplayNameUnlicensedOverride;                             // 0x0088(0x0018) (Edit, NativeAccessSpecifierPrivate)
	struct FText                                       DescriptionUnlicensedOverride;                             // 0x00A0(0x0018) (Edit, NativeAccessSpecifierPrivate)
	int                                                AssociatedCharacterIndex;                                  // 0x00B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_URY9[0x4];                                     // 0x00BC(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.BaseItemData
// 0x0148 (0x0150 - 0x0008)
struct FBaseItemData : public FDBDTableRowBase
{
	struct FName                                       ID;                                                        // 0x0008(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInventoryItemType                  Type;                                                      // 0x0014(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1OPF[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FItemUIData                                 UIData;                                                    // 0x0018(0x00C0) (Edit, NativeAccessSpecifierPublic)
	struct FText                                       GenericDisplayName;                                        // 0x00D8(0x0018) (Edit, NativeAccessSpecifierPublic)
	unsigned char                                      ItemBlueprint[0x30];                                       // 0x00F0(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      AssetData[0x30];                                           // 0x0120(0x0030) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct DeadByDaylight.ItemAvailability
// 0x0030
struct FItemAvailability
{
	DBDSharedTypes_EItemAvailability                   ItemAvailability;                                          // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_DMZ7[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     DLCId;                                                     // 0x0008(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                CloudInventoryId;                                          // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_4COJ[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     CommunityId;                                               // 0x0020(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.ItemData
// 0x0080 (0x01D0 - 0x0150)
struct FItemData : public FBaseItemData
{
	unsigned char                                      ItemMesh[0x30];                                            // 0x0150(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	DeadByDaylight_EItemHandPosition                   HandPosition;                                              // 0x0180(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EPlayerRole                         Role;                                                      // 0x0181(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EItemRarity                         Rarity;                                                    // 0x0182(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Inventory;                                                 // 0x0183(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Chest;                                                     // 0x0184(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EKillerAbilities                    RequiredKillerAbility;                                     // 0x0185(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_82QQ[0x2];                                     // 0x0186(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FItemAvailability                           Availability;                                              // 0x0188(0x0030) (Edit, NativeAccessSpecifierPublic)
	bool                                               IsInNonViolentBuild;                                       // 0x01B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsAvailableInAtlantaBuild;                                 // 0x01B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AntiDLC;                                                   // 0x01BA(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Bloodweb;                                                  // 0x01BB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               CanKeepInLoadout;                                          // 0x01BC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_STL4[0x3];                                     // 0x01BD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       EventId;                                                   // 0x01C0(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               CanUseAfterEventEnd;                                       // 0x01CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_ELoadoutItemType                    ItemType;                                                  // 0x01CD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LXVH[0x2];                                     // 0x01CE(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.StatusEffectProperties
// 0x0048 (0x0218 - 0x01D0)
struct FStatusEffectProperties : public FItemData
{
	TArray<struct FName>                               Tags;                                                      // 0x01D0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      StatusEffectBlueprint[0x30];                               // 0x01E0(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	DBDSharedTypes_EStatusEffectType                   StatusEffectType;                                          // 0x0210(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EExternalEffectSource               ExternalEffectSource;                                      // 0x0211(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XZHE[0x6];                                     // 0x0212(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.StatusViewProperties
// 0x00B8 (0x00C0 - 0x0008)
struct FStatusViewProperties : public FDBDTableRowBase
{
	struct FName                                       StatusViewID;                                              // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_SFHI[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Description;                                               // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FText                                       DisplayName;                                               // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      StatusViewBlueprint[0x30];                                 // 0x0048(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	DBDSharedTypes_EStatusEffectType                   StatusType;                                                // 0x0078(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_GB0Q[0x7];                                     // 0x0079(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     IconFilePath;                                              // 0x0080(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      IconAsset[0x30];                                           // 0x0090(0x0030) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct DeadByDaylight.StatusViewSource
// 0x0028
struct FStatusViewSource
{
	struct FName                                       SourceId;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               IsActive;                                                  // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_QY3Y[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _remainingTime;                                            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              PercentageFill;                                            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Level;                                                     // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	DeadByDaylight_EInventoryItemType                  SourceType;                                                // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_PGZK[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                SourceIconIndex;                                           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                SourceLevel;                                               // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

};

// ScriptStruct DeadByDaylight.StoreFeaturedBannerData
// 0x0080
struct FStoreFeaturedBannerData
{
	unsigned char                                      UnknownData_1W1R[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Title;                                                     // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       subtitle;                                                  // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FString                                     ImagePath;                                                 // 0x0038(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     AssociatedDlcId;                                           // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     AssociatedCombinedItemId;                                  // 0x0058(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     AssociatedCombinedOutfitId;                                // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_ETextBannerPosition                 TextPosition;                                              // 0x0078(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_II6O[0x7];                                     // 0x0079(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.StoreBannersData
// 0x0098 (0x00A0 - 0x0008)
struct FStoreBannersData : public FDBDTableRowBase
{
	struct FName                                       BannerId;                                                  // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DWHP[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FStoreFeaturedBannerData                    BannerData;                                                // 0x0018(0x0080) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               UseAsDefault;                                              // 0x0098(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EStoreBannerLocation                DefaultLocation;                                           // 0x0099(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A8MS[0x6];                                     // 0x009A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.InteractButtonInfo
// 0x02F8 (0x0300 - 0x0008)
struct FInteractButtonInfo : public FTableRowBase
{
	struct FName                                       InteractButtonID;                                          // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       InteractionID;                                             // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EPlayerRole                         PlayerRole;                                                // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInputInteractionType               interactionInputType;                                      // 0x0021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CRQ3[0x6];                                     // 0x0022(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateBrush                                 Icon;                                                      // 0x0028(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	DeadByDaylight_EButtonType                         CancelButtonType;                                          // 0x00B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EButtonType                         SecondaryActionButtonType;                                 // 0x00B9(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IJY8[0x6];                                     // 0x00BA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateBrush                                 AttackIcon;                                                // 0x00C0(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 AbilityIcon;                                               // 0x0150(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 ThumbJoystickUnpressedIcon;                                // 0x01E0(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 ThumbJoystickPressedIcon;                                  // 0x0270(0x0090) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.InboxMessageElapsedTime
// 0x0008
struct FInboxMessageElapsedTime
{
	int                                                ElapsedTime;                                               // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInboxMessageTimeUnit               TimeUnit;                                                  // 0x0004(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HP82[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.RichTextRewardRow
// 0x0448 (0x0450 - 0x0008)
struct FRichTextRewardRow : public FTableRowBase
{
	struct FTextBlockStyle                             TextStyle;                                                 // 0x0008(0x0288) (Edit, NativeAccessSpecifierPublic)
	struct FMargin                                     TextMargin;                                                // 0x0290(0x0010) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 Brush;                                                     // 0x02A0(0x0090) (Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 TintsBrush;                                                // 0x0330(0x0090) (Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                                 BackgroundBrush;                                           // 0x03C0(0x0090) (Edit, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.PlayerInfoData
// 0x0058
struct FPlayerInfoData
{
	struct FString                                     characterName;                                             // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     CharacterIconPath;                                         // 0x0010(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CharacterLevel;                                            // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PrestigeLevel;                                             // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               CanPrestige;                                               // 0x0028(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8NRG[0x7];                                     // 0x0029(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     playerName;                                                // 0x0030(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PlayerLevel;                                               // 0x0040(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DevotionLevel;                                             // 0x0044(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PlayerRank;                                                // 0x0048(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ActivePips;                                                // 0x004C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumPipsToNextRank;                                         // 0x0050(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Ready;                                                     // 0x0054(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsSlasher;                                                 // 0x0055(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ShowPortraitBorder;                                        // 0x0056(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasActiveSubscription;                                     // 0x0057(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.VariationData
// 0x0028 (0x0030 - 0x0008)
struct FVariationData : public FDBDTableRowBase
{
	struct FGameplayTag                                Tag;                                                       // 0x0008(0x000C) (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WSM8[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       Name;                                                      // 0x0018(0x0018) (Edit, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.VideoThumbnailProperties
// 0x0048 (0x0050 - 0x0008)
struct FVideoThumbnailProperties : public FDBDTableRowBase
{
	struct FName                                       _id;                                                       // 0x0008(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasAudio;                                                 // 0x0014(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_47LR[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector2D                                   _size;                                                     // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _source[0x30];                                             // 0x0020(0x0030) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct DeadByDaylight.ArchivesVignetteEntry
// 0x0038 (0x0040 - 0x0008)
struct FArchivesVignetteEntry : public FDBDTableRowBase
{
	struct FText                                       Title;                                                     // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       Text;                                                      // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                               HasAudio;                                                  // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_707X[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ArchivesVignettes
// 0x0060 (0x0068 - 0x0008)
struct FArchivesVignettes : public FDBDTableRowBase
{
	struct FString                                     VignetteId;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Title;                                                     // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       subtitle;                                                  // 0x0030(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FArchivesVignetteEntry>              Entries;                                                   // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CinematicPaths[0x10];                                      // 0x0058(0x0010) UNKNOWN PROPERTY: ArrayProperty

};

// ScriptStruct DeadByDaylight.ArchivesJournal
// 0x0028 (0x0040 - 0x0018)
struct FArchivesJournal : public FDBDTableRowBaseWithId
{
	struct FText                                       Title;                                                     // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FArchivesVignettes>                  Vignettes;                                                 // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.WalesCypherEventData
// 0x0030
struct FWalesCypherEventData
{
	struct FString                                     EnteredSequence;                                           // 0x0000(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ExpectedSequence;                                          // 0x0010(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TimeoutThreshold;                                          // 0x0020(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               success;                                                   // 0x0024(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               TIMEOUT;                                                   // 0x0025(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               CharmGranted;                                              // 0x0026(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TG0Q[0x1];                                     // 0x0027(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ValidCharacterSelcted;                                     // 0x0028(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BRRG[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.WalletUpdateTracker
// 0x0050
struct FWalletUpdateTracker
{
	TMap<struct FString, int>                          _walletChangeMap;                                          // 0x0000(0x0050) (NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.XpBonusData
// 0x0018
struct FXpBonusData
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                XpValue;                                                   // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_17V4[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.InteractionArray
// 0x0010
struct FInteractionArray
{
	TArray<TWeakObjectPtr<class UInteractionDefinition>> _interactions;                                             // 0x0000(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.ArmIKSensorDatum
// 0x0030
struct FArmIKSensorDatum
{
	struct FName                                       ShoulderBoneName;                                          // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CTA1[0x24];                                    // 0x000C(0x0024) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ModifierTickableConditionReplicatedData
// 0x0018
struct FModifierTickableConditionReplicatedData
{
	TArray<class UBaseModifierCondition*>              Conditions;                                                // 0x0000(0x0010) (ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasCondition;                                              // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AuthorityDataSet;                                          // 0x0011(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SUSC[0x6];                                     // 0x0012(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.StatusEffectInitializationData
// 0x0028
struct FStatusEffectInitializationData
{
	class ADBDPlayer*                                  originatingPlayer;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasOriginatingPlayer;                                      // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5YJI[0x7];                                     // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UGameplayModifierContainer*                  originatingEffect;                                         // 0x0010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasOriginatingEffect;                                      // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EStatusEffectType                   StatusEffectType;                                          // 0x0019(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WCA7[0x2];                                     // 0x001A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              customParam;                                               // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InitializationLifeTime;                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AuthorityDataSet;                                          // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GA2H[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.PerkInitializationData
// 0x0008
struct FPerkInitializationData
{
	int                                                PerkLevel;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EInputInteractionType               ActivatableInteractionInputType;                           // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AuthorityDataSet;                                          // 0x0005(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RFJ8[0x2];                                     // 0x0006(0x0002) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ItemAddonInitializationData
// 0x0002
struct FItemAddonInitializationData
{
	DeadByDaylight_EInventoryItemType                  InventoryItemType;                                         // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AuthorityDataSet;                                          // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SelectedOffering
// 0x0010
struct FSelectedOffering
{
	int                                                ownerId;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       OfferingName;                                              // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.GameBot
// 0x0008
struct FGameBot
{
	unsigned char                                      _role;                                                     // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      _difficulty;                                               // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_8VAW[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                _characterIndex;                                           // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.SpawnInfo
// 0x0040
struct FSpawnInfo
{
	class UClass*                                      actorClass;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2UT3[0x8];                                     // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  Transform;                                                 // 0x0010(0x0030) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.OutlineColourConfiguration
// 0x0010
struct FOutlineColourConfiguration
{
	struct FLinearColor                                ColourValue;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.RoleDropdown
// 0x0002
struct FRoleDropdown
{
	bool                                               ShowRoleSelection;                                         // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EPlayerRole                         Role;                                                      // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CharacterDropdown
// 0x0006 (0x0008 - 0x0002)
struct FCharacterDropdown : public FRoleDropdown
{
	unsigned char                                      UnknownData_Q4C0[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                characterId;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ScreenshotViewSetting
// 0x0028
struct FScreenshotViewSetting
{
	float                                              Distance;                                                  // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LateralOffset;                                             // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              HeightOffset;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CharacterYaw;                                              // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CharacterRoll;                                             // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CharacterPitch;                                            // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CameraPitch;                                               // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SocketName;                                                // 0x001C(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CharacterViewSetting
// 0x003C
struct FCharacterViewSetting
{
	struct FName                                       label;                                                     // 0x0000(0x000C) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterDropdown                          CharacterDropdown;                                         // 0x000C(0x0008) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FScreenshotViewSetting                      Settings;                                                  // 0x0014(0x0028) (Edit, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.SpecialEventUIInfo
// 0x0050
struct FSpecialEventUIInfo
{
	struct FString                                     EventId;                                                   // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EventBannerFrameLabel;                                     // 0x0010(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       EventName;                                                 // 0x0020(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	bool                                               IsPastEvent;                                               // 0x0038(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QH98[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     BloodwebCollectSoundEvent;                                 // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.PurchaseCurrencyData
// 0x0020
struct FPurchaseCurrencyData
{
	unsigned char                                      UnknownData_NOJV[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	DBDSharedTypes_ECurrencyType                       currencyType;                                              // 0x0008(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A3JS[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Price;                                                     // 0x000C(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DiscountPercentage;                                        // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsAffordable;                                              // 0x0014(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ICVE[0xB];                                     // 0x0015(0x000B) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.StoreItemSlotData
// 0x01B0
struct FStoreItemSlotData
{
	unsigned char                                      UnknownData_KRRF[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       ItemId;                                                    // 0x0008(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_ECustomizationCategory              Category;                                                  // 0x0014(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UDJT[0x3];                                     // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       MirrorsId;                                                 // 0x0018(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_O0VM[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     IconPath;                                                  // 0x0028(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     DisplayName;                                               // 0x0038(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     DisplayCollectionName;                                     // 0x0048(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Description;                                               // 0x0058(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RoleCategoryInfo;                                          // 0x0068(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     RarityPartInfo;                                            // 0x0078(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EItemRarity                         Rarity;                                                    // 0x0088(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WAJJ[0x7];                                     // 0x0089(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSpecialEventUIInfo                         EventInfo;                                                 // 0x0090(0x0050) (BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	TArray<struct FPurchaseCurrencyData>               PurchaseDataList;                                          // 0x00E0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               ParentBundleIds;                                           // 0x00F0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               ChildrenItemIds;                                           // 0x0100(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCustomTransformation                       CustomTransformation;                                      // 0x0110(0x0014) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                               IsOwned;                                                   // 0x0124(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsBuyable;                                                 // 0x0125(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsEquipped;                                                // 0x0126(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsNewInStore;                                              // 0x0127(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsLocked;                                                  // 0x0128(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsInStore;                                                 // 0x0129(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EPlayerRole                         AssociatedRole;                                            // 0x012A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LLQT[0x5];                                     // 0x012B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDateTime                                   ReleaseDate;                                               // 0x0130(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsEnabled;                                                 // 0x0138(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5CDO[0x77];                                    // 0x0139(0x0077) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ShopTransactionVirtualCurrencyParameters
// 0x0028
struct FShopTransactionVirtualCurrencyParameters
{
	int                                                virtualCurrencyAmount;                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GHUQ[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     virtualCurrencyName;                                       // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     virtualCurrencyType;                                       // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ShopTransactionVirtualCurrency
// 0x0028
struct FShopTransactionVirtualCurrency
{
	struct FShopTransactionVirtualCurrencyParameters   virtualCurrency;                                           // 0x0000(0x0028) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.DBDAttackTargetTracker
// 0x00B8
struct FDBDAttackTargetTracker
{
	bool                                               _useTargetTracking;                                        // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_X706[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FStatProperty                               _targetSnapDistance;                                       // 0x0008(0x0088) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       _ownerEyeSocketName;                                       // 0x0090(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       _targetBoneName;                                           // 0x009C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ACharacter>                   _trackedTarget;                                            // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ADBDPlayer>                   _owningPlayer;                                             // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.EventItemsContentTypeUIData
// 0x0090
struct FEventItemsContentTypeUIData
{
	DeadByDaylight_EEventItemContentType               ContentType;                                               // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               NeedRemoveRarityBackground;                                // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseDefaultRarityBackgroundColor;                           // 0x0002(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZDPT[0x5];                                     // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FSlateColor                                 DefaultRarityBackgroundColor;                              // 0x0008(0x0028) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      BackgroundTexture[0x30];                                   // 0x0030(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      RarityBackgroundTexture[0x30];                             // 0x0060(0x0030) UNKNOWN PROPERTY: SoftObjectProperty

};

// ScriptStruct DeadByDaylight.NativeBlockIndicatorData
// 0x0018
struct FNativeBlockIndicatorData
{
	bool                                               IsBlockActive;                                             // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsBlockUpdating;                                           // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_C221[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              CurrentBlockFade;                                          // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 FadeCurve;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                             BlockIndicator;                                            // 0x0010(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.VaultData
// 0x0038
struct FVaultData
{
	unsigned char                                      UnknownData_7OZ0[0x38];                                    // 0x0000(0x0038) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ScoreEventData
// 0x0018
struct FScoreEventData
{
	class AActor*                                      Target;                                                    // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PercentToAward;                                            // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W10I[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UObject*                                     CustomObjectParameter;                                     // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.AnimData
// 0x0001
struct FAnimData
{
	DeadByDaylight_ECharacterStance                    Stance;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.InteractionPlayerProperties
// 0x0050
struct FInteractionPlayerProperties
{
	struct FVector_NetQuantize                         AverageVelocityAtStart;                                    // 0x0000(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         PlayerPositionAtStart;                                     // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    PlayerRotationAtStart;                                     // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADBDPlayer>                   Requester;                                                 // 0x0024(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                         SnapPositionAtStart;                                       // 0x002C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    SnapRotationAtStart;                                       // 0x0038(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                              SnapDistanceAtStart;                                       // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SnapTimeAtStart;                                           // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ShouldSnapPosition;                                        // 0x004C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6PF0[0x3];                                     // 0x004D(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.TooltipPressedData
// 0x0018
struct FTooltipPressedData
{
	struct FVector2D                                   touchPosition;                                             // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JJ27[0x10];                                    // 0x0008(0x0010) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.CamperHealResult
// 0x0018
struct FCamperHealResult
{
	DeadByDaylight_ECamperDamageState                  PreviousDamageState;                                       // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_ECamperDamageState                  CurrentDamageState;                                        // 0x0001(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T681[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                HealAmount;                                                // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ADBDPlayer*>                          Healers;                                                   // 0x0008(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.BuiltLevelData
// 0x00A8
struct FBuiltLevelData
{
	struct FName                                       ThemeName;                                                 // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ThemeWeather;                                              // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       AudioStateThemes;                                          // 0x0018(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       AudioStateWeather;                                         // 0x0024(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       AudioThemeEvent;                                           // 0x0030(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BRQI[0x4];                                     // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      AudioThemeSoundBank[0x30];                                 // 0x003C(0x0030) UNKNOWN PROPERTY: SoftObjectProperty
	struct FString                                     MapName;                                                   // 0x0070(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TileCount;                                                 // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XVD4[0x4];                                     // 0x0084(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FDependency>                         Dependencies;                                              // 0x0088(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SpecialEventId;                                            // 0x0098(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LW62[0x4];                                     // 0x00A4(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.HudEditorDragFromParentAxisLimit
// 0x0014
struct FHudEditorDragFromParentAxisLimit
{
	bool                                               enable;                                                    // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EHudEditorDragAxisOption            AxisOption;                                                // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2442[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MinDragDistance;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ScaleMinDragDistanceWithParent;                            // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D4OL[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MaxDragDistance;                                           // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ScaleMaxDragDistanceWithParent;                            // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FST8[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.CharacterCustomizationDropdown
// 0x0054 (0x005C - 0x0008)
struct FCharacterCustomizationDropdown : public FCharacterDropdown
{
	struct FName                                       OutfitId;                                                  // 0x0008(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SurvivorHead;                                              // 0x0014(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SurvivorTorso;                                             // 0x0020(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SurvivorLegs;                                              // 0x002C(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       KillerHead;                                                // 0x0038(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       KillerBody;                                                // 0x0044(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       KillerWeapon;                                              // 0x0050(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CharmDropdown
// 0x000E (0x0010 - 0x0002)
struct FCharmDropdown : public FRoleDropdown
{
	unsigned char                                      UnknownData_KRMY[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       CharmId;                                                   // 0x0004(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.DataTableDropdown
// 0x0030
struct FDataTableDropdown
{
	struct FName                                       RowValue;                                                  // 0x0000(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_72LP[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     DataTableName;                                             // 0x0010(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       ColumnName;                                                // 0x0020(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_054O[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.DebugLoadoutAddon
// 0x0030
struct FDebugLoadoutAddon
{
	struct FDataTableDropdown                          AddonID;                                                   // 0x0000(0x0030) (Edit, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.DebugLoadoutPerk
// 0x0038
struct FDebugLoadoutPerk
{
	struct FDataTableDropdown                          perkId;                                                    // 0x0000(0x0030) (Edit, NativeAccessSpecifierPublic)
	int                                                PerkLevel;                                                 // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W3SM[0x4];                                     // 0x0034(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.CamperLoadout
// 0x00E0
struct FCamperLoadout
{
	struct FCharacterCustomizationDropdown             camper;                                                    // 0x0000(0x005C) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharmDropdown                              Slot0_CharmID;                                             // 0x005C(0x0010) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharmDropdown                              Slot1_CharmID;                                             // 0x006C(0x0010) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharmDropdown                              Slot2_CharmID;                                             // 0x007C(0x0010) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YA0W[0x4];                                     // 0x008C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDataTableDropdown                          ItemId;                                                    // 0x0090(0x0030) (Edit, NativeAccessSpecifierPublic)
	TArray<struct FDebugLoadoutAddon>                  AddonIDs;                                                  // 0x00C0(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDebugLoadoutPerk>                   Perks;                                                     // 0x00D0(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.BloodwebNodeProperties
// 0x0020
struct FBloodwebNodeProperties
{
	DeadByDaylight_EBloodwebNodeContentType            ContentType;                                               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EItemRarity                         Rarity;                                                    // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QXTF[0x6];                                     // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FString>                             Tags;                                                      // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                characterId;                                               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IB9E[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.BloodwebNodeGate
// 0x0000 (0x0008 - 0x0008)
struct FBloodwebNodeGate : public FDBDTableRowBase
{

};

// ScriptStruct DeadByDaylight.BloodwebChest
// 0x0030 (0x0038 - 0x0008)
struct FBloodwebChest : public FDBDTableRowBase
{
	struct FName                                       ID;                                                        // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       EventId;                                                   // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EBloodchestType                     ChestType;                                                 // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DBDSharedTypes_EItemRarity                         Rarity;                                                    // 0x0021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OZE0[0x6];                                     // 0x0022(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<float>                                      GivenItemRarity;                                           // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.BloodwebNode
// 0x0090
struct FBloodwebNode
{
	struct FBloodwebNodeProperties                     Properties;                                                // 0x0000(0x0020) (NativeAccessSpecifierPublic)
	TArray<struct FBloodwebNodeGate>                   Gates;                                                     // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	DeadByDaylight_EBloodwebNodeState                  State;                                                     // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IW3O[0x7];                                     // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     nodeID;                                                    // 0x0038(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ContentId;                                                 // 0x0048(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5A0B[0x4];                                     // 0x0054(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FBloodwebChest                              BloodwebChest;                                             // 0x0058(0x0038) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.BloodWebRingPersistentData
// 0x0010
struct FBloodWebRingPersistentData
{
	TArray<struct FBloodwebNode>                       NodeData;                                                  // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.BloodWebPersistentData
// 0x0040
struct FBloodWebPersistentData
{
	int                                                VersionNumber;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Level;                                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBloodWebRingPersistentData>         RingData;                                                  // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               Paths;                                                     // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     EntityCurrentNode;                                         // 0x0028(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   GenerationDate;                                            // 0x0038(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.PlayerSavedProfileCumulativeData
// 0x0038
struct FPlayerSavedProfileCumulativeData
{
	bool                                               FirstTimePlaying;                                          // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0SK1[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                CumulativeMatches;                                         // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CumulativeMatchesAsSurvivor;                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CumulativeMatchesAsKiller;                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CumulativeMatchesAsSurvivorNoFriends;                      // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CumulativeMatchesAsKillerNoFriends;                        // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastMatchTimestamp;                                        // 0x0018(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastSessionTimestamp;                                      // 0x0020(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CumulativeSessions;                                        // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_NAEW[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTimespan                                   CumulativePlaytime;                                        // 0x0030(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.DailyRitualInstance
// 0x0078
struct FDailyRitualInstance
{
	struct FName                                       RitualKey;                                                 // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                DifficultyTier;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<DeadByDaylight_EDBDScoreTypes>              TrackedEvents;                                             // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                        TrackedGameEvents;                                         // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        CharacterIDs;                                              // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<DBDSharedTypes_EPlayerRole>                 Roles;                                                     // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Progress;                                                  // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Threshold;                                                 // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Tolerance;                                                 // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DisplayThreshold;                                          // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ExpReward;                                                 // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Active;                                                    // 0x0064(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsNew;                                                     // 0x0065(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SCG5[0x2];                                     // 0x0066(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDateTime                                   DateAssigned;                                              // 0x0068(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NbGameElapsed;                                             // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UO3E[0x4];                                     // 0x0074(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.DailyRitualContainer
// 0x0028
struct FDailyRitualContainer
{
	struct FDateTime                                   LastRitualReceivedDate;                                    // 0x0000(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastRitualPopupDate;                                       // 0x0008(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastRitualDismissedDate;                                   // 0x0010(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDailyRitualInstance>                rituals;                                                   // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.PlayerLoadoutData
// 0x0098
struct FPlayerLoadoutData
{
	struct FName                                       Item;                                                      // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VDCU[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               ItemAddOns;                                                // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               CamperPerks;                                               // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        CamperPerkLevels;                                          // 0x0030(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       CamperFavor;                                               // 0x0040(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Power;                                                     // 0x004C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               PowerAddOns;                                               // 0x0058(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               SlasherPerks;                                              // 0x0068(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        SlasherPerkLevels;                                         // 0x0078(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       SlasherFavor;                                              // 0x0088(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IB5T[0x4];                                     // 0x0094(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.SavedStatsData
// 0x0014
struct FSavedStatsData
{
	uint32_t                                           Version;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Name;                                                      // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              value;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CharacterSavedInventoryData
// 0x0010
struct FCharacterSavedInventoryData
{
	uint32_t                                           Version;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Name;                                                      // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.AssignedPerkProperties
// 0x0014
struct FAssignedPerkProperties
{
	struct FName                                       perkId;                                                    // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PerkLevel;                                                 // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               IsTeachable;                                               // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WMP9[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.SavedCharacterLevelData
// 0x0018
struct FSavedCharacterLevelData
{
	int                                                Level;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasPerksBeenSelected;                                      // 0x0004(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasPerkSelectionBeenGenerated;                             // 0x0005(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0XBD[0x2];                                     // 0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FAssignedPerkProperties>             PerkSelection;                                             // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CharacterSavedProfileData
// 0x0158
struct FCharacterSavedProfileData
{
	int                                                BloodWebLevel;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TimesConfronted;                                           // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDateTime>                           PrestigeEarnedDates;                                       // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBloodWebPersistentData                     BloodWebData;                                              // 0x0018(0x0040) (NativeAccessSpecifierPublic)
	struct FPlayerLoadoutData                          CharacterLoadoutData;                                      // 0x0058(0x0098) (NativeAccessSpecifierPublic)
	TArray<struct FName>                               CurrentCustomization;                                      // 0x00F0(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharmIdSlot>                        CurrentCharmCustomization;                                 // 0x0100(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FName>                               UniquePerksAdded;                                          // 0x0110(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharacterSavedInventoryData>        InventoryData;                                             // 0x0120(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSavedCharacterLevelData>            CharacterLevelData;                                        // 0x0130(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSavedStatsData>                     StatProgression;                                           // 0x0140(0x0010) (ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                PrestigeLevel;                                             // 0x0150(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                CharacterExperience;                                       // 0x0154(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.SpecialEventSavedData
// 0x0018
struct FSpecialEventSavedData
{
	TArray<int>                                        SeenCinematics;                                            // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               EventEntryScreenOpened;                                    // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CZ5I[0x7];                                     // 0x0011(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.PlayerSavedProfileDataLocal
// 0x03B8
struct FPlayerSavedProfileDataLocal
{
	int                                                Tokens;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RGXY[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               offerings;                                                 // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FName, bool>                           PageVisited;                                               // 0x0018(0x0050) (NativeAccessSpecifierPublic)
	TMap<struct FName, bool>                           ChatVisible;                                               // 0x0068(0x0050) (NativeAccessSpecifierPublic)
	TMap<struct FName, bool>                           OnboardingCompleted;                                       // 0x00B8(0x0050) (NativeAccessSpecifierPublic)
	int                                                ConsecutiveMatchStreak;                                    // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Wins;                                                      // 0x010C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Losses;                                                    // 0x0110(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MRMT[0x4];                                     // 0x0114(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	uint64_t                                           CurrentSeasonTicks;                                        // 0x0118(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDailyRitualContainer                       DailyRituals;                                              // 0x0120(0x0028) (NativeAccessSpecifierPublic)
	struct FFearMarketOfferingInstance                 FearMarket;                                                // 0x0148(0x0020) (NativeAccessSpecifierPublic)
	struct FPlayerLoadoutData                          LastConnectedLoadout;                                      // 0x0168(0x0098) (NativeAccessSpecifierPublic)
	int                                                LastConnectedCharacterIndex;                               // 0x0200(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XCH1[0x4];                                     // 0x0204(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDateTime                                   DisconnectPenaltyTime;                                     // 0x0208(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastMatchEndTime;                                          // 0x0210(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastMatchStartTime;                                        // 0x0218(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastKillerMatchEndTime;                                    // 0x0220(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                                   LastSurvivorMatchEndTime;                                  // 0x0228(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBloodWebPersistentData                     BloodStoreKillers;                                         // 0x0230(0x0040) (NativeAccessSpecifierPublic)
	struct FBloodWebPersistentData                     BloodStoreSurvivors;                                       // 0x0270(0x0040) (NativeAccessSpecifierPublic)
	bool                                               CrossplayAllowed;                                          // 0x02B0(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               AutoDeclineFriendInvites;                                  // 0x02B1(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KDP3[0x6];                                     // 0x02B2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDateTime                                   _ongoingGameTime;                                          // 0x02B8(0x0008) (ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPlayerSavedProfileCumulativeData           _cumulativeData;                                           // 0x02C0(0x0038) (NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FSavedStatsData>                     _savedPlayerStats;                                         // 0x02F8(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasBeenGivenKillerTutorialEndReward;                      // 0x0308(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasBeenGivenSurvivorTutorialEndReward;                    // 0x0309(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasSeenBloodpointsOnboardingCurrencyPopup;                // 0x030A(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasSeenAuricCellsOnboardingCurrencyPopup;                 // 0x030B(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasSeenIridescentShardsOnboardingCurrencyPopup;           // 0x030C(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_7QFA[0x3];                                     // 0x030D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<int, struct FCharacterSavedProfileData>       _characterData;                                            // 0x0310(0x0050) (NativeAccessSpecifierPrivate)
	TMap<struct FName, struct FSpecialEventSavedData>  _specialEvent;                                             // 0x0360(0x0050) (NativeAccessSpecifierPrivate)
	bool                                               _hasBeginnerTooltipsBeenDisabledAtLevel;                   // 0x03B0(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_UF6D[0x7];                                     // 0x03B1(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.AtlantaCustomizedHudSettings
// 0x0040
struct FAtlantaCustomizedHudSettings
{
	struct FGameplayTag                                ID;                                                        // 0x0000(0x000C) (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   NormalizedOffset;                                          // 0x000C(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Scale;                                                     // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RenderOpacity;                                             // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Version;                                                   // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                       OverlapWrapperIds;                                         // 0x0020(0x0020) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ConsoleUserSettings
// 0x00A0
struct FConsoleUserSettings
{
	TArray<struct FInputActionKeyMapping>              ActionMappings;                                            // 0x0000(0x0010) (ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInputAxisKeyMapping>                AxisMappings;                                              // 0x0010(0x0010) (ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MenuScaleFactor;                                           // 0x0020(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                HudScaleFactor;                                            // 0x0024(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SkillCheckScaleFactor;                                     // 0x0028(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               LargeText;                                                 // 0x002C(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_I7RF[0x3];                                     // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Gamma;                                                     // 0x0030(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HUDPlayerNamesVisibility;                                  // 0x0034(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HUDScoreEventsVisibility;                                  // 0x0035(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HUDKillerHookCountVisibility;                              // 0x0036(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A6LX[0x1];                                     // 0x0037(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MainVolume;                                                // 0x0038(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MenuMusicVolume;                                           // 0x003C(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseHeadphones;                                             // 0x0040(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               MuteOnFocusLost;                                           // 0x0041(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_QK3K[0x2];                                     // 0x0042(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                KillerMouseSensitivity;                                    // 0x0044(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SurvivorMouseSensitivity;                                  // 0x0048(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                KillerControllerSensitivity;                               // 0x004C(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SurvivorControllerSensitivity;                             // 0x0050(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               InvertY;                                                   // 0x0054(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               SurvivorInvertY;                                           // 0x0055(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2HKW[0x2];                                     // 0x0056(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                HighestWeightSeenNews;                                     // 0x0058(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseAtlantaCustomizedHuds;                                  // 0x005C(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseAtlantaSurvivorQuickTurn;                               // 0x005D(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseAtlantaKillerQuickTurn;                                 // 0x005E(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_U5XM[0x1];                                     // 0x005F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FAtlantaCustomizedHudSettings>       AtlantaCustomizedHuds;                                     // 0x0060(0x0010) (ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasAcceptedCrossplayPopup;                                 // 0x0070(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               HasAcceptedCrossProgressionPopup;                          // 0x0071(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KTS2[0x6];                                     // 0x0072(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     PartyPrivacyState;                                         // 0x0078(0x0010) (ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ColorBlindMode;                                            // 0x0088(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ColorBlindModeIntensity;                                   // 0x008C(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               BeginnerMode;                                              // 0x0090(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               Subtitles;                                                 // 0x0091(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V5PS[0x2];                                     // 0x0092(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                SubtitlesBackgroundOpacity;                                // 0x0094(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                SubtitlesSize;                                             // 0x0098(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BB4S[0x4];                                     // 0x009C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.PlayerSavedProfileData
// 0x04B8
struct FPlayerSavedProfileData
{
	struct FString                                     PlayerUID;                                                 // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerSavedProfileDataShared               SharedData;                                                // 0x0010(0x0050) (NativeAccessSpecifierPublic)
	struct FPlayerSavedProfileDataLocal                LocalData;                                                 // 0x0060(0x03B8) (NativeAccessSpecifierPublic)
	struct FConsoleUserSettings                        ConsoleUserSettings;                                       // 0x0418(0x00A0) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.FootStep
// 0x0028
struct FFootStep
{
	class UDecalComponent*                             Decal;                                                     // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XUBU[0x20];                                    // 0x0008(0x0020) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.GameEventData
// 0x0028
struct FGameEventData
{
	class ADBDPlayer*                                  Instigator;                                                // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      Target;                                                    // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CustomValue;                                               // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VH3F[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UObject*                                     CustomObjectParameter;                                     // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                CustomIntValue;                                            // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1FS9[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.DamageData
// 0x0020
struct FDamageData
{
	bool                                               _isRegressing;                                             // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isIntense;                                                // 0x0001(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_4XTR[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TWeakObjectPtr<class ADBDPlayer>                   _lastDamageChangeSource;                                   // 0x0004(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_IA13[0x14];                                    // 0x000C(0x0014) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.PlayerFloatTuple
// 0x0010
struct FPlayerFloatTuple
{
	class ACharacter*                                  Player;                                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              value;                                                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZHN1[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.ReflectionCaptureTwoStates
// 0x0030
struct FReflectionCaptureTwoStates
{
	struct FComponentReference                         ComponentReference;                                        // 0x0000(0x0030) (NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.CustomKillerInstinctData
// 0x0028
struct FCustomKillerInstinctData
{
	class UNiagaraSystem*                              ParticleSystemAsset;                                       // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                        SurvivorStateTags;                                         // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                        KillerStateTags;                                           // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.OfferingData
// 0x0018
struct FOfferingData
{
	bool                                               OfferingReady;                                             // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ID4E[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FSelectedOffering>                   offerings;                                                 // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.GameBotsData
// 0x0010
struct FGameBotsData
{
	TArray<struct FGameBot>                            _bots;                                                     // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.GamePresetData
// 0x0088
struct FGamePresetData
{
	TArray<unsigned char>                              _mapAvailabilities;                                        // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _perkAvailabilities;                                       // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _offeringAvailabilities;                                   // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _itemAvailabilities;                                       // 0x0030(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _itemAddonAvailabilities;                                  // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _customizationItemAvailabilities;                          // 0x0050(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<unsigned char>                              _characterAvailabilities;                                  // 0x0060(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _allowDlcContent;                                          // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _privateMatch;                                             // 0x0071(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	DeadByDaylight_EGameplayMode                       _gameplayMode;                                             // 0x0072(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_E608[0x5];                                     // 0x0073(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FGameBotsData                               _botsData;                                                 // 0x0078(0x0010) (NativeAccessSpecifierPrivate)

};

// ScriptStruct DeadByDaylight.ProgressionPoints
// 0x0008
struct FProgressionPoints
{
	DeadByDaylight_EEmblemProgressionType              Type;                                                      // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T2A8[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Points;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ClippedActor
// 0x0060
struct FClippedActor
{
	TArray<TWeakObjectPtr<class UPrimitiveComponent>>  DisplayComponents;                                         // 0x0000(0x0010) (ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UPrimitiveComponent*, TWeakObjectPtr<class UPrimitiveComponent>> CollidingPrimitives;                                       // 0x0010(0x0050) (ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ActorSpawnerProperties
// 0x0038
struct FActorSpawnerProperties
{
	unsigned char                                      SceneElement[0x30];                                        // 0x0000(0x0030) UNKNOWN PROPERTY: SoftClassProperty
	float                                              Weight;                                                    // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T8GC[0x4];                                     // 0x0034(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.SpawnerElement
// 0x0010
struct FSpawnerElement
{
	TArray<struct FActorSpawnerProperties>             ObjectsToBeSpawned;                                        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct DeadByDaylight.ActorVariationElements
// 0x0038
struct FActorVariationElements
{
	DeadByDaylight_ETileVariation                      Type;                                                      // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2REG[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      Element[0x30];                                             // 0x0001(0x0030) UNKNOWN PROPERTY: SoftClassProperty

};

// ScriptStruct DeadByDaylight.AITerrorEvent
// 0x0028
struct FAITerrorEvent
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Q39T[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AActor*                                      Instigator;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTerrorRadiusEmitterComponent*               TerrorEmitter;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGenericTeamId                              TeamIdentifier;                                            // 0x0020(0x0001) (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3PR3[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

};

// ScriptStruct DeadByDaylight.AITrailEvent
// 0x0030
struct FAITrailEvent
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartTime;                                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EndTime;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YJ7R[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AActor*                                      Instigator;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                                IgnoreOnPerkTag;                                           // 0x0020(0x000C) (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
