#pragma once

// Name: DeadB, Version: 5


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class TheK25.Addon_K25Power_17
// 0x0018 (FullSize[0x02B0] - InheritedSize[0x0298])
class UAddon_K25Power_17 : public UItemAddon
{
public:
	unsigned char                                      UnknownData_SG2A[0x18];                                    // 0x0298(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.Addon_K25Power_17");
		return ptr;
	}



};

// Class TheK25.AISkill_FindCollectable_LamentConfiguration
// 0x0020 (FullSize[0x0140] - InheritedSize[0x0120])
class UAISkill_FindCollectable_LamentConfiguration : public UAISkill_FindCollectable
{
public:
	struct FAITunableParameter                         StopChainHuntGoalWeight;                                   // 0x0120(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAITunableParameter                         PreemptiveFindLamentGoalWeight;                            // 0x0130(0x0010) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.AISkill_FindCollectable_LamentConfiguration");
		return ptr;
	}



};

// Class TheK25.AISkill_InteractionBreakFreeFromChains
// 0x0028 (FullSize[0x0198] - InheritedSize[0x0170])
class UAISkill_InteractionBreakFreeFromChains : public UAISkill_Interaction
{
public:
	struct FDBDTunableRowHandle                        _breakFreeFromChainsMaxCharge;                             // 0x0170(0x0028) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.AISkill_InteractionBreakFreeFromChains");
		return ptr;
	}



};

// Class TheK25.AISkill_InteractionUseItem_LamentConfiguration
// 0x0028 (FullSize[0x01A0] - InheritedSize[0x0178])
class UAISkill_InteractionUseItem_LamentConfiguration : public UAISkill_InteractionUseItem
{
public:
	struct FDBDTunableRowHandle                        _solveLamentMaxCharge;                                     // 0x0178(0x0028) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.AISkill_InteractionUseItem_LamentConfiguration");
		return ptr;
	}



};

// Class TheK25.ChainAttachedGateBlockerEffect
// 0x0028 (FullSize[0x03B0] - InheritedSize[0x0388])
class UChainAttachedGateBlockerEffect : public UGateBlockerEffect
{
public:
	struct FDBDTunableRowHandle                        _blockGateLingeringTimeDyingState;                         // 0x0388(0x0028) (Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.ChainAttachedGateBlockerEffect");
		return ptr;
	}



	void OnSurvivorDamageStateChanged(DeadByDaylight_ECamperDamageState oldState, DeadByDaylight_ECamperDamageState NewState);
};

// Class TheK25.IsChainHuntActive
// 0x0028 (FullSize[0x0110] - InheritedSize[0x00E8])
class UIsChainHuntActive : public UEventDrivenModifierCondition
{
public:
	unsigned char                                      UnknownData_W3WN[0x28];                                    // 0x00E8(0x0028) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.IsChainHuntActive");
		return ptr;
	}



};

// Class TheK25.K25AnimationFollowerActor
// 0x0040 (FullSize[0x0270] - InheritedSize[0x0230])
class AK25AnimationFollowerActor : public AActor
{
public:
	class USkeletalMeshComponent*                      _skeletalMesh;                                             // 0x0230(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationMontageSlave*                      _montageFollower;                                          // 0x0238(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMontagePlayer*                              _montagePlayer;                                            // 0x0240(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_9LRZ[0x28];                                    // 0x0248(0x0028) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25AnimationFollowerActor");
		return ptr;
	}



	void OnMontageStopped(const struct FAnimationMontageDescriptor& ID);
	void OnMontageStarted(const struct FAnimationMontageDescriptor& ID, float Rate);
	void OnMontageEnd(const struct FAnimationMontageDescriptor& Montage, bool interrupted);
};

// Class TheK25.K25AnimInstance
// 0x0098 (FullSize[0x0640] - InheritedSize[0x05A8])
class UK25AnimInstance : public UKillerAnimInstance
{
public:
	unsigned char                                      UnknownData_71MF[0x8];                                     // 0x05A8(0x0008) Fix Super Size
	unsigned char                                      UnknownData_1MFS[0x90];                                    // 0x05B0(0x0090) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25AnimInstance");
		return ptr;
	}



};

// Class TheK25.K25AttackSubAnimInstance
// 0x0020 (FullSize[0x05E0] - InheritedSize[0x05C0])
class UK25AttackSubAnimInstance : public UKillerAttackSubAnimInstance
{
public:
	bool                                               _hasDownedTargetHoldingLamentConfiguration;                // 0x05C0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_Z5WR[0x1F];                                    // 0x05C1(0x001F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25AttackSubAnimInstance");
		return ptr;
	}



	void OnAttackStart(DBDSharedTypes_EAttackType attackType);
};

// Class TheK25.K25Chain
// 0x0200 (FullSize[0x0430] - InheritedSize[0x0230])
class AK25Chain : public AActor
{
public:
	unsigned char                                      UnknownData_H5AJ[0x8];                                     // 0x0230(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptMulticastDelegate                    OnAcquiredChanged;                                         // 0x0238(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 _attachedToProjectileInfluenceCurve;                       // 0x0248(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 _reelbackInfluenceCurve;                                   // 0x0250(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 _offsetMultiplierInfluenceCurve;                           // 0x0258(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CQT2[0x50];                                    // 0x0260(0x0050) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDBDTunableRowHandle                        _reelingBackSpeed;                                         // 0x02B0(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _chainOffsetMinValue;                                      // 0x02D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _chainOffsetMaxValue;                                      // 0x02DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _reelbackChainOffsetMinValue;                              // 0x02E0(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _reelbackChainOffsetMaxValue;                              // 0x02E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _chainInstanceSpacing;                                     // 0x02E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _quickChainOffsetTimerLength;                              // 0x02EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _reachingSurvivorAnchorTime;                               // 0x02F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                     _chainScale;                                               // 0x02F4(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _chainOffsetTimerLength;                                   // 0x0300(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ESDS[0x4];                                     // 0x0304(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FVector>                             _currentChainPoints;                                       // 0x0308(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _isAcquiredFromPool;                                       // 0x0318(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_L5ZS[0x3];                                     // 0x0319(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _sphereTraceRadius;                                        // 0x031C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _chainStartPosition;                                       // 0x0320(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _reelBackPosition;                                         // 0x032C(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _reelbackStartPosition;                                    // 0x0338(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_ORL7[0x4];                                     // 0x0344(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AK25Projectile*                              _projectileAttachedTo;                                     // 0x0348(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _survivorAnchorAttachedTo;                                 // 0x0350(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AK25SurvivorChainAttachmentAnchor> _targetAnchorToReach;                                      // 0x0358(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                            _chainSplineComponent;                                     // 0x0360(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*               _chainInstancedMesh;                                       // 0x0368(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                                 _currentInfluenceCurve;                                    // 0x0370(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _chainCurveOffset;                                         // 0x0378(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TheK25_EK25ChainState                              _chainState;                                               // 0x0384(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_VQI9[0x3];                                     // 0x0385(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FFastTimer                                  _curveOffsetStrengthTimer;                                 // 0x0388(0x0030) (Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                                  _reelbackTimer;                                            // 0x03B8(0x0030) (Transient, NativeAccessSpecifierPrivate)
	struct FFastTimer                                  _reachSurvivorAnchorPositionTimer;                         // 0x03E8(0x0030) (Transient, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                             _forcedPositions;                                          // 0x0418(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TheK25_EK25ChainCreationStrategy                   _chainCreationStrategy;                                    // 0x0428(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_QZ6U[0x7];                                     // 0x0429(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25Chain");
		return ptr;
	}



	void SetSplineComponent(class USplineComponent* Component);
	void SetInstancedMeshComponent(class UInstancedStaticMeshComponent* instancedMesh);
	bool IsAttachedToControlledProjectile();
	class AK25SurvivorChainAttachmentAnchor* GetSurvivorChainAttachmentAnchor();
	struct FVector GetChainStartLocation();
	struct FVector GetChainEndLocation();
	void Cosmetic_OnSurvivorStoppedRemovingChainSFX(bool hasRemovedChainDueToInteraction);
	void Cosmetic_OnSurvivorStartedRemovingChainSFX();
	void Cosmetic_OnInstantChainUnleashedTowardsAttachmentPointFX();
	void Cosmetic_OnChainUnleashedWithProjectile();
	void Cosmetic_OnChainStartedToReelback();
	void Cosmetic_OnChainDisappears();
	void Cosmetic_OnChainDetachedFromSurvivor(TheK25_EK25ChainDetachmentReason detachmentReason);
	void Cosmetic_OnChainAttachedToSurvivor(bool wasReachingSurvivorAnchorPoint);
	void Cosmetic_OnChainAppears();
};

// Class TheK25.K25ChainAttachedStatusEffect
// 0x0018 (FullSize[0x0368] - InheritedSize[0x0350])
class UK25ChainAttachedStatusEffect : public UStatusEffect
{
public:
	class UCurveFloat*                                 _percentageReductionSpeedPerChainCurve;                    // 0x0350(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25SurvivorChainAttachmentComponent*        _chainAttachmentComponent;                                 // 0x0358(0x0008) (ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                _cachedNumberOfChainsAttached;                             // 0x0360(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_2HCX[0x4];                                     // 0x0364(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainAttachedStatusEffect");
		return ptr;
	}



	void OnRep_ChainAttachementComponent();
};

// Class TheK25.K25ChainAttachmentReplicationComponent
// 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
class UK25ChainAttachmentReplicationComponent : public UActorComponent
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainAttachmentReplicationComponent");
		return ptr;
	}



	void Multicast_StartChainReelback(class AK25Chain* chainToAttach);
	void Multicast_LaunchInstantHitChainTowardsSurvivor(class AK25Chain* newChainToAttach, class AK25SurvivorChainAttachmentAnchor* targetAnchor, const struct FVector& startPosition);
	void Multicast_DetachChains(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, TArray<class AK25Chain*> chainsToDetach, TheK25_EK25ChainDetachmentReason detachmentReason, TArray<class AK25Chain*> chainsAttached);
	void Multicast_AttachChainToAnchor(class UK25SurvivorChainAttachmentComponent* chainAttachementComponent, class AK25Chain* chainToAttach, class AK25SurvivorChainAttachmentAnchor* anchorPoint);
};

// Class TheK25.K25ChainHuntEffectsComponent
// 0x0038 (FullSize[0x00F0] - InheritedSize[0x00B8])
class UK25ChainHuntEffectsComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData_DLWS[0x38];                                    // 0x00B8(0x0038) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainHuntEffectsComponent");
		return ptr;
	}



	class ADBDPlayer* GetOwningPlayer();
	void Cosmetic_TriggerChainHuntActivationSFX();
	void Cosmetic_DeactivateChainHuntEffects();
	void Cosmetic_ActivateChainHuntEffects(bool hasChainHuntStarted);
};

// Class TheK25.K25ChainLocomotionSurvivorAnimInstance
// 0x0190 (FullSize[0x0680] - InheritedSize[0x04F0])
class UK25ChainLocomotionSurvivorAnimInstance : public UBaseSurvivorAnimInstance
{
public:
	bool                                               _hasChainsAttached;                                        // 0x04F0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_AUVU[0x3];                                     // 0x04F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _breakChainInteractionCompletionPercentage;                // 0x04F4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _isPerformingBreakChainInteraction;                        // 0x04F8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_SAJL[0x3];                                     // 0x04F9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _forwardDirectionDotProductResult;                         // 0x04FC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _lateralDirectionDotProductResult;                         // 0x0500(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_0O8P[0x4];                                     // 0x0504(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AK25Chain*                                   _currentChainBeingDetached;                                // 0x0508(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _leftHandAttachmentData;                                   // 0x0510(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _rightHandAttachmentData;                                  // 0x0528(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _leftShoulderAttachmentData;                               // 0x0540(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _rightShoulderAttachmentData;                              // 0x0558(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _stomachAttachmentData;                                    // 0x0570(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FK25ChainAnchorAnimationData                _backAttachmentData;                                       // 0x0588(0x0018) (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TheK25_EK25ChainAnchorPointDirection               _chainDirection;                                           // 0x05A0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TheK25_EK25ChainAnchorPointDirection               _lastDetatchedChainDirection;                              // 0x05A1(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _hasBrokenFreeFromChain;                                   // 0x05A2(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NR15[0x1];                                     // 0x05A3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _hasBrokenFreeTime;                                        // 0x05A4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _hasBeenHitByChain;                                        // 0x05A8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_X14X[0x3];                                     // 0x05A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _hasBeenHitByChainTime;                                    // 0x05AC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                _numberOfChainsAttached;                                   // 0x05B0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_JOBE[0xCC];                                    // 0x05B4(0x00CC) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainLocomotionSurvivorAnimInstance");
		return ptr;
	}



	void OnRemoveChainChargePercentageChanged(class UChargeableComponent* ChargeableComponent, float completionPercentage);
	void OnChainDetached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor, TheK25_EK25ChainDetachmentReason detachmentReason);
	void OnChainAttached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor);
	bool IsSolvingLamentConfiguration();
	bool HasChainsAttached();
	class UK25SurvivorChainAttachmentComponent* GetSurvivorChainAttachmentComponent();
	struct FK25SurvivorChainAttachmentData GetDetachingChainAnchorData();
	TArray<class AK25SurvivorChainAttachmentAnchor*> GetChainAttachmentAnchors();
	void BP_OnChainDetached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor);
	void BP_OnChainAttached(class AK25Chain* chain, class AK25SurvivorChainAttachmentAnchor* chainAttachmentAnchor);
};

// Class TheK25.K25ChainPool
// 0x0000 (FullSize[0x00F0] - InheritedSize[0x00F0])
class UK25ChainPool : public UAuthoritativeActorPoolComponent
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainPool");
		return ptr;
	}



};

// Class TheK25.K25ChainStrike_IsGatewayOrientationTimerExpired
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UK25ChainStrike_IsGatewayOrientationTimerExpired : public UFSM_Condition
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrike_IsGatewayOrientationTimerExpired");
		return ptr;
	}



};

// Class TheK25.K25ChainStrike_IsGatewayPlacementValidCondition
// 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
class UK25ChainStrike_IsGatewayPlacementValidCondition : public UFSM_Condition
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrike_IsGatewayPlacementValidCondition");
		return ptr;
	}



};

// Class TheK25.K25ChainStrike_IsPlayerPressingInputCondition
// 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
class UK25ChainStrike_IsPlayerPressingInputCondition : public UFSM_Condition
{
public:
	DeadByDaylight_EInputInteractionType               _inputType;                                                // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_7Y1T[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrike_IsPlayerPressingInputCondition");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeBaseState
// 0x0050 (FullSize[0x00C8] - InheritedSize[0x0078])
class UK25ChainStrikeBaseState : public UFSM_State
{
public:
	unsigned char                                      _secondaryInteractionIDs[0x50];                            // 0x0078(0x0050) UNKNOWN PROPERTY: SetProperty


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeBaseState");
		return ptr;
	}



	class ADBDPlayer* GetPlayerOwner();
	class AK25Power* GetK25Power();
	class AK25Gateway* GetK25Gateway();
};

// Class TheK25.K25ChainStrikeImmunityEffect
// 0x0028 (FullSize[0x0398] - InheritedSize[0x0370])
class UK25ChainStrikeImmunityEffect : public UActivateOnEventTimedStatusEffect
{
public:
	struct FDBDTunableRowHandle                        _chainStrikeImmunityDuration;                              // 0x0370(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeImmunityEffect");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeInteraction
// 0x0208 (FullSize[0x08E0] - InheritedSize[0x06D8])
class UK25ChainStrikeInteraction : public UChargeableInteractionDefinition
{
public:
	class UClass*                                      _chainStrikeStateMachineclass;                             // 0x06D8(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _repossessFadeOutTime;                                     // 0x06E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_HH7F[0x4];                                     // 0x06E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDBDTunableRowHandle                        _repossessFadeInTime;                                      // 0x06E8(0x0028) (Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                                 _gatewayPossessionFovModifierCurve;                        // 0x0710(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                                 _controlledProjectilePossessionFovModifierCurve;           // 0x0718(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _chargeTimeAfterGatewayPlacementCancelled;                 // 0x0720(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _chargeTimeAfterGatewayPossessionCancelled;                // 0x0748(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _chargeTimeAfterControlledChainShot;                       // 0x0770(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _gatewayPossessionFovChangeDuration;                       // 0x0798(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _gatewayPossessionCameraPanTime;                           // 0x07C0(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _controlledProjectilePossessionCameraPanTime;              // 0x07E8(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _controlledProjectilePossessionFovTimeChangeDuration;      // 0x0810(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFiniteStateMachine*                         _stateMachine;                                             // 0x0838(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _authority_shouldIncrementChargeableComponent;             // 0x0840(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_Y3MX[0x68];                                    // 0x0841(0x0068) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TheK25_EChainStrikeCameraViewTarget                _chainStrikeCameraViewTarget;                              // 0x08A9(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _hasHitSurvivor;                                           // 0x08AA(0x0001) (Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_9N70[0x35];                                    // 0x08AB(0x0035) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeInteraction");
		return ptr;
	}



	void Server_SetShouldIncrementChargeableComponent(bool shouldIncrement);
	void Server_SetFallbackEndReason(TheK25_EChainStrikeEndReason chainStrikeEndReason);
	void Server_SetCameraViewTarget(TheK25_EChainStrikeCameraViewTarget NewViewTarget);
	void Server_RemoveStateTagFromPlayer(const struct FGameplayTag& Tag);
	void Server_AddStateTagToPlayer(const struct FGameplayTag& Tag);
	void OnRep_ChainStrikeCameraViewTarget();
	void Multicast_SetFallbackEndReason(TheK25_EChainStrikeEndReason chainStrikeEndReason);
	void Multicast_RemoveStateTagFromPlayer(const struct FGameplayTag& Tag);
	void Multicast_AddStateTagToPlayer(const struct FGameplayTag& Tag);
	void Cosmetic_TriggerKillerRepossessionFadeOutEffects(class ASlasherPlayer* killer, bool preventAudioTriggers);
	void Cosmetic_TriggerKillerRepossessionFadeInEffects(class ASlasherPlayer* killer, bool hasHitSurvivor, bool preventAudioTriggers);
	void Cosmetic_TriggerInvalidGatewayPlacementSFX(class ASlasherPlayer* killer);
	void Cosmetic_TriggerGatewayPossessionEffects(float TransitionTime);
	void Cosmetic_ResetAllVignetteValues(class ASlasherPlayer* killer);
};

// Class TheK25.K25ChainStrikeReplicationComponent
// 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
class UK25ChainStrikeReplicationComponent : public UActorComponent
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeReplicationComponent");
		return ptr;
	}



	void Server_EndChainStrike(class UK25ChainStrikeInteraction* Interaction, TheK25_EChainStrikeEndReason endReason);
	void Multicast_EndChainStrike(class UK25ChainStrikeInteraction* Interaction, TheK25_EChainStrikeEndReason endReason);
};

// Class TheK25.K25ChainStrikeState_EndChainStrike
// 0x0008 (FullSize[0x00D0] - InheritedSize[0x00C8])
class UK25ChainStrikeState_EndChainStrike : public UK25ChainStrikeBaseState
{
public:
	TheK25_EChainStrikeEndReason                       _chainStrikeEndReason;                                     // 0x00C8(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_T3ND[0x7];                                     // 0x00C9(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_EndChainStrike");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeState_GatewayPlacement
// 0x0000 (FullSize[0x00C8] - InheritedSize[0x00C8])
class UK25ChainStrikeState_GatewayPlacement : public UK25ChainStrikeBaseState
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_GatewayPlacement");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeState_OutOfBodyState
// 0x0028 (FullSize[0x00F0] - InheritedSize[0x00C8])
class UK25ChainStrikeState_OutOfBodyState : public UK25ChainStrikeBaseState
{
public:
	struct FDBDTunableRowHandle                        _fovTimeChangeDuration;                                    // 0x00C8(0x0028) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_OutOfBodyState");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeState_PossessGateway
// 0x0010 (FullSize[0x00D8] - InheritedSize[0x00C8])
class UK25ChainStrikeState_PossessGateway : public UK25ChainStrikeBaseState
{
public:
	unsigned char                                      UnknownData_8XG3[0x10];                                    // 0x00C8(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_PossessGateway");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeState_SelectGatewayOrientation
// 0x0018 (FullSize[0x00E0] - InheritedSize[0x00C8])
class UK25ChainStrikeState_SelectGatewayOrientation : public UK25ChainStrikeBaseState
{
public:
	unsigned char                                      UnknownData_5JJ1[0x18];                                    // 0x00C8(0x0018) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_SelectGatewayOrientation");
		return ptr;
	}



};

// Class TheK25.K25ChainStrikeState_ShootControlledProjectile
// 0x0040 (FullSize[0x0108] - InheritedSize[0x00C8])
class UK25ChainStrikeState_ShootControlledProjectile : public UK25ChainStrikeBaseState
{
public:
	float                                              _minimumThrottleTimeForInputServerCall;                    // 0x00C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _inputResetSpeed;                                          // 0x00CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_3E4X[0x38];                                    // 0x00D0(0x0038) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ChainStrikeState_ShootControlledProjectile");
		return ptr;
	}



};

// Class TheK25.K25CheatComponent
// 0x0000 (FullSize[0x00B8] - InheritedSize[0x00B8])
class UK25CheatComponent : public UActorComponent
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25CheatComponent");
		return ptr;
	}



	void DBD_K25TriggerUncontrolledChainsOnLocalSurvivor(int numbChains);
	void DBD_K25TriggerUncontrolledChainsOnClosestsSurvivorToPosition(float X, float Y, float Z, int numbChains);
	void DBD_K25TriggerUncontrolledChainsOnAllSurvivors(int numbChains);
	void DBD_K25ForceRespawnLamentConfiguration();
	void DBD_K25ForceRemoveAllChainsOnLocalSurvivor();
	void DBD_K25ForceRemoveAllChainsOnClosestsSurvivorToPosition(float X, float Y, float Z);
	void DBD_K25ForceRemoveAllChainsOnAllSurvivors();
	void DBD_K25ComeToPositionLamentConfiguration(float X, float Y, float Z);
	void DBD_K25ComeToMeLamentConfiguration();
};

// Class TheK25.K25CollectLamentConfigurationInteraction
// 0x0008 (FullSize[0x05E0] - InheritedSize[0x05D8])
class UK25CollectLamentConfigurationInteraction : public UCollectItemInteraction
{
public:
	unsigned char                                      UnknownData_K4PF[0x8];                                     // 0x05D8(0x0008) Fix Super Size


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25CollectLamentConfigurationInteraction");
		return ptr;
	}



};

// Class TheK25.K25Projectile
// 0x00F8 (FullSize[0x0430] - InheritedSize[0x0338])
class AK25Projectile : public AKillerProjectile
{
public:
	unsigned char                                      UnknownData_310B[0x48];                                    // 0x0338(0x0048) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UStaticMeshComponent*                        _staticMesh;                                               // 0x0380(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                         _characterCollider;                                        // 0x0388(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                         _environmentCollider;                                      // 0x0390(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKillerProjectileDodgeComponent*             _projectileDodgeComponent;                                 // 0x0398(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLaunchInfo                                 _launchInfo;                                               // 0x03A0(0x001C) (Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ZADE[0x4];                                     // 0x03BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AK25Chain*                                   _attachedChain;                                            // 0x03C0(0x0008) (Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _timeIgnoreSlasherCollision;                               // 0x03C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               _isActive;                                                 // 0x03CC(0x0001) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_DQCA[0x3];                                     // 0x03CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FK25ProjectileDeactivationData              _lastDeactivationData;                                     // 0x03D0(0x0020) (Transient, NoDestructor, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_W2B5[0x40];                                    // 0x03F0(0x0040) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25Projectile");
		return ptr;
	}



	void Server_RequestDisableProjectile(TheK25_EK25ProjectileDeactivateReason deactivateReason);
	void OnProjectileStopped(const struct FHitResult& Result);
	class UDBDProjectileMovementComponent* GetMovementComponent();
	struct FVector GetChainAttachmentLocation();
	void Cosmetic_OnProjectileDeactivated(const struct FK25ProjectileDeactivationData& deactivationData);
	void Cosmetic_OnProjectileActivated();
};

// Class TheK25.K25ControlledProjectile
// 0x0270 (FullSize[0x06A0] - InheritedSize[0x0430])
class AK25ControlledProjectile : public AK25Projectile
{
public:
	unsigned char                                      UnknownData_KNRG[0x8];                                     // 0x0430(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UStaticMeshComponent*                        _killerViewProjectileStaticMesh;                           // 0x0438(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpringArmComponent*                         _killerSpringArm;                                          // 0x0440(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                            _killerCameraPlacement;                                    // 0x0448(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _pitchClampAngle;                                          // 0x0450(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_K4CE[0x4];                                     // 0x0454(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTunableStat                                _maximumYawTurnRate;                                       // 0x0458(0x0080) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                                _maximumPitchTurnRate;                                     // 0x04D8(0x0080) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _cameraRollSpeedMultiplier;                                // 0x0558(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _cameraRollGoBackSpeedMultiplier;                          // 0x0580(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _cameraMaximumRollDegree;                                  // 0x05A8(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                                _numbExtraChainsOnControlledProjectileHit;                 // 0x05D0(0x0080) (Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UK25ControlledProjectileMovementComponent*   _controlledProjectileMovementComponent;                    // 0x0650(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              _currentRoll;                                              // 0x0658(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              _targetRoll;                                               // 0x065C(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_GD6E[0x30];                                    // 0x0660(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector_NetQuantize                         _lastAppliedAngularVelocity;                               // 0x0690(0x000C) (Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_RBIM[0x4];                                     // 0x069C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ControlledProjectile");
		return ptr;
	}



	void Server_ProcessYawInput(float DeltaTime, float scaledInput);
	void Server_ProcessPitchInput(float DeltaTime, float scaledInput);
	void OnRep_AngularVelocity();
	void Cosmetic_OnKillerPossessProjectileEffects();
};

// Class TheK25.K25ControlledProjectileMovementComponent
// 0x0140 (FullSize[0x03A0] - InheritedSize[0x0260])
class UK25ControlledProjectileMovementComponent : public UPhysicsBasedProjectileMovementComponent
{
public:
	struct FDBDTunableRowHandle                        _projectileBaseSpeed;                                      // 0x0260(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _baseProjectileMaximumDistance;                            // 0x0288(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _projectileSpeedIncreaseTime;                              // 0x02B0(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                                _maximumTravelDistanceStat;                                // 0x02D8(0x0080) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                                 _projectileSpeedIncreaseMultiplier;                        // 0x0358(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _totaldistanceTravelled;                                   // 0x0360(0x0004) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_4SGF[0x3C];                                    // 0x0364(0x003C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25ControlledProjectileMovementComponent");
		return ptr;
	}



};

// Class TheK25.K25EscapeLamentConfigurationGrasp
// 0x0008 (FullSize[0x06E0] - InheritedSize[0x06D8])
class UK25EscapeLamentConfigurationGrasp : public UChargeableInteractionDefinition
{
public:
	unsigned char                                      UnknownData_8I0T[0x8];                                     // 0x06D8(0x0008) Fix Super Size


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25EscapeLamentConfigurationGrasp");
		return ptr;
	}



};

// Class TheK25.K25Gateway
// 0x0278 (FullSize[0x04A8] - InheritedSize[0x0230])
class AK25Gateway : public AActor
{
public:
	unsigned char                                      UnknownData_XAUS[0x10];                                    // 0x0230(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              _rayCastZOffet;                                            // 0x0240(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _rayCastLength;                                            // 0x0244(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<float>                                      _distancePercentLocations;                                 // 0x0248(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _survivorGatewayRotationSpeed;                             // 0x0258(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _minimumIndicatorVelocity;                                 // 0x025C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _IndicatorVelocityEasingFactor;                            // 0x0260(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              _minimumTimeBeforeTargetLocationMulticast;                 // 0x0264(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _minDistanceFromPlayer;                                    // 0x0268(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTunableStat                                _maxDistanceFromPlayer;                                    // 0x0290(0x0080) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _gatewayPlacementSpeed;                                    // 0x0310(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _pitchLevelChangeAngleThreshold;                           // 0x0338(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _pitchLevelChangeZoneThreshold;                            // 0x0360(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _maximumCameraPitchOrientationAngle;                       // 0x0388(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _minimumCameraPitchOrientationAngle;                       // 0x03B0(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDBDTunableRowHandle                        _maxGatewayPossessionDuration;                             // 0x03D8(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorComponent*                             _visualComponent;                                          // 0x0400(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                     _targetLocation;                                           // 0x0408(0x000C) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_F7D0[0x14];                                    // 0x0414(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UCameraComponent*                            _cameraPlacementComponent;                                 // 0x0428(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               _isGatewayPossessed;                                       // 0x0430(0x0001) (Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_M8S3[0x1B];                                    // 0x0431(0x001B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               _isBeingPositionned;                                       // 0x044C(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_3XX2[0x1B];                                    // 0x044D(0x001B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FFastTimer                                  _possessionTimer;                                          // 0x0468(0x0030) (Transient, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_0N01[0x10];                                    // 0x0498(0x0010) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class TheK25.K25Gateway");
		return ptr;
	}



	void Server_StartGatewayPossession(const struct FVector& possessionLocation, const struct FRotator& gatewayRotation);
	void Server_SetIsGatewayBeingPositionned(bool isBeingPositionned);
	void Server_SetGatewayTargetLocation(const struct FVector& targetLocation, bool isValidLocation);
	void Server_SetGatewayOrientation(const struct FRotator& Rotation);
	void Server_EndGatewayPossession();
	void OnRep_IsGatewayPossessed();
	void OnRep_IsBeingPositionned();
	void Multicast_SetGatewayTargetLocation(const struct FVector& targetLocation, bool isValidLocation);
	void Multicast_SetGatewayOrientation(const struct FRotator& Rotation);
	void Multicast_SetGatewayLocation(const struct FVector& possessionLocation);
	bool IsGatewayPossessed();
	class UCameraComponent* GetCameraComponent();
	void Cosmetic_TriggerInvalidGatewayPlacementSFX();
	void Cosmetic_TriggerGatewayUnpossessedEffects();
	void Cosmetic_TriggerGatewayPossessionCancel();
	void Cosmetic_TriggerGatewayPossessedEffects(float TransitionTime);
	void Cosmetic_TriggerGatewayPlacementStop();
	void Cosmetic_TriggerGatewayPlacementStart();
